routes/web.php

function getSetting($key)
{
    return Cache::remember('settings.' . $key, 60, function () use ($key) {
        return Setting::query()
            ->where('key', $key)
            ->first()->toArray()['value'];
---
select * from `settings` where `key` = 'site_title' limit 1