app/Http/ViewComposers/AdminComposer.php

select * from `settings` where `key` = 'site_title' limit 1
---
    public function __construct()
    {
        $this->routeName = Route::currentRouteName();

        if (strpos($this->routeName, 'create') || strpos($this->routeName, 'edit')) {
            $this->parentRoute = route('admin.' . explode('.', $this->routeName)[1] . '.index');
            $this->parentRouteName = trans('admin.' . explode('.', $this->routeName)[1] . '.index');
        }
        $this->site_title = Setting::where('key', 'site_title')->first()->value;