app/Http/ViewComposers/SiteComposer.php

select * from `settings`
---
    public function compose($view)
    {
        $view->with([
            'site_title' => $this->site_title,
            'title' => $this->routeName,
            'user' => $this->user,
            'settings' => $this->settings,
            'footerLinks' => $this->footerLinks,
            'siteMenus' => $this->siteMenus,
            'current_uri' => $this->current_uri,
        ]);