app/Http/ViewComposers/SiteComposer.php

    public function __construct()
    {
        $this->routeName = Route::currentRouteName();

        if (strpos($this->routeName, 'create') || strpos($this->routeName, 'edit')) {
            $this->parentRoute = route('admin.' . explode('.', $this->routeName)[1] . '.index');
            $this->parentRouteName = trans('admin.' . explode('.', $this->routeName)[1] . '.index');
        }
        $this->user = Auth::user();

        $this->menus = app(AdminMenu::class)->getMenus($this->user);
        $this->settings = Cache::rememberForever('siteSettings', function () {
            return Setting::all()->pluck('value', 'key')->toArray();
        });
        $this->site_title = $this->settings['site_title'];

        $this->basketCarts = Session::get('cart');

        $this->footerLinks = Link::query()
            ->where('state', EState::enabled)
            ->orderBy('id', 'DESC')
            ->limit(5)
            ->get();

        $this->footerPosts = Post::query()
            ->where('state', EState::enabled)
            ->orderBy('id', 'DESC')
            ->limit(5)
            ->get();
---
select * from `links` where `state` = 1 order by `id` desc limit 5
select * from `posts` where `state` = 1 order by `id` desc limit 5