app/Role.php

select `permissions`.*, `permission_role`.`role_id` as `pivot_role_id`, `permission_role`.`permission_id` as `pivot_permission_id` from `permissions` inner join `permission_role` on `permissions`.`id` = `permission_role`.`permission_id` where `permission_role`.`role_id` = 1
---
    public function getPermissionListAttribute()
    {
        return $this->permissions->pluck('id')->toArray();