app/Setting.php

select * from `settings`
---
    public static function getColumns()
    {
        self::$columns = Setting::all()->groupBy('key')->map(function ($column) {
            return current($column->toArray());
        });