app/Http/Controllers/PagesController.php

    public function about(Request $request)
    {
        $pages = Page::query()
            ->whereIn('page_name', ['about', 'our_team', 'testimonial_page'])
            ->get()
            ->keyBy('page_name');

        $teams = Team::query()
            ->whereState(EState::enabled)
            ->orderBy('id', 'ASC')
            ->get();

        $testimonials = Testimonial::query()
            ->whereState(EState::enabled)
            ->orderBy('id', 'ASC')
            ->get();
---
select * from `pages` where `page_name` in ('about', 'our_team', 'testimonial_page')
select * from `teams` where `state` = 1 order by `id` asc
select * from `testimonials` where `state` = 1 order by `id` asc

    public function clients(Request $request)
    {
        $page = Page::query()
            ->where('page_name', 'clients_page')
            ->first();

        $clients = Client::query()
            ->whereState(EState::enabled)
            ->orderBy('id', 'ASC')
            ->get();
---
select * from `pages` where `page_name` = 'clients' limit 1
select * from `clients` where `state` = 1 order by `id` asc