app/Http/Controllers/ProjectsController.php

    public function index(Request $request)
    {
        $page = Page::query()
            ->whereState(EState::enabled)
            ->where('page_name', 'projects_page')
            ->first();

        $items = Project::query()
            ->with('categories')
            ->where('state', EState::enabled)
            ->where('published_at', '<', Carbon::now())
            ->orderBy('published_at', 'DESC')
            ->paginate(12);
---
select * from `pages` where `state` = 1 and `page_name` = 'projects_page' limit 1
select * from `projects` where `state` = 1 and `published_at` < '2019-04-21 13:56:42' order by `published_at` desc limit 12 offset 0
select `categories`.*, `category_project`.`project_id` as `pivot_project_id`, `category_project`.`category_id` as `pivot_category_id` from `categories` inner join `category_project` on `categories`.`id` = `category_project`.`category_id` where `category_project`.`project_id` in (1)
select count(*) as aggregate from `projects` where `state` = 1 and `published_at` < '2019-04-21 13:56:42'

    public function show($id, $slug = null)
    {
        $item = Project::query()
            ->where('state', EState::enabled)
            ->with('user', 'categories', 'media')
            ->withCount(['comments' => function ($q) {
                $q/*->where('comments.status', ECommentType::approved)*/->where('comments.state', EState::enabled);
            }])
            ->find($id);

        $prevProject = Project::query()
            ->where('state', EState::enabled)
            ->where('id', '<', $id)
            ->orderBy('id', 'DESC')
            ->first();

        $nextProject = Project::query()
            ->where('state', EState::enabled)
            ->where('id', '>', $id)
            ->orderBy('id', 'ASC')
            ->first();
---
select * from `users` where `users`.`id` in (1)
select `categories`.*, `category_project`.`project_id` as `pivot_project_id`, `category_project`.`category_id` as `pivot_category_id` from `categories` inner join `category_project` on `categories`.`id` = `category_project`.`category_id` where `category_project`.`project_id` in (1)
select * from `projects` where `state` = 1 and `id` < '1' order by `id` desc limit 1
select * from `projects` where `state` = 1 and `id` > '1' order by `id` asc limit 1