app/Http/Controllers/SiteController.php

    public function index()
    {
        $settings = Setting::all()->pluck('value', 'key')->toArray();

        $sliders = Slider::query()
            ->whereState(EState::enabled)
            ->where('published_at', '<=', Carbon::now())
            ->orderBy('published_at', 'DESC')
            ->take(6)
            ->get();

        $about = Page::query()
            ->where('page_name', 'about')
            ->first();

        $news = Post::query()
            ->where('published_at', '<=', Carbon::now())
            ->where('featured', 1)
            ->enabled()
            ->whereType('news')
            ->orderBy('published_at', 'DESC')
            ->take(2)
            ->get();

        $videoItem = Post::query()
            ->where('published_at', '<=', Carbon::now())
            ->where('featured', 1)
            ->enabled()
            ->whereType('video')
            ->orderBy('published_at', 'DESC')
            ->first();
---
select * from `sliders` where `state` = 1 and `published_at` <= '2019-04-21 14:39:09' order by `published_at` desc limit 6
select * from `pages` where `page_name` = 'about' limit 1
select * from `posts` where `published_at` <= '2019-04-21 14:39:10' and `featured` = 1 and `state` = 1 and `type` = 'news' order by `published_at` desc limit 2