-- phpMyAdmin SQL Dump
-- version 4.7.5
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Jan 24, 2018 at 08:03 AM
-- Server version: 5.7.19-0ubuntu0.16.04.1
-- PHP Version: 7.1.10-1+ubuntu16.04.1+deb.sury.org+1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `test`
--

-- --------------------------------------------------------

--
-- Table structure for table `admins`
--

CREATE TABLE `admins` (
  `id` int(10) UNSIGNED NOT NULL,
  `state` int(11) NOT NULL DEFAULT '1',
  `created_by` int(10) UNSIGNED NOT NULL,
  `updated_by` int(10) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `admins`
--

INSERT INTO `admins` (`id`, `state`, `created_by`, `updated_by`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, 1, 1, 1, '2018-01-22 05:56:12', '2018-01-22 05:56:12', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` int(10) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `slug` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `content` text COLLATE utf8_unicode_ci,
  `page_title` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `meta_keywords` text COLLATE utf8_unicode_ci,
  `meta_description` text COLLATE utf8_unicode_ci,
  `state` int(11) NOT NULL DEFAULT '1',
  `created_by` int(10) UNSIGNED NOT NULL,
  `updated_by` int(10) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `title`, `slug`, `content`, `page_title`, `meta_keywords`, `meta_description`, `state`, `created_by`, `updated_by`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, 'ایرانی', 'ایرانی', '', '', '', '', 1, 1, 1, '2018-01-23 06:49:00', '2018-01-23 06:49:00', NULL),
(2, 'فرنگی', 'فرنگی', '', '', '', '', 1, 1, 1, '2018-01-23 06:49:15', '2018-01-23 06:49:15', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `category_restaurant`
--

CREATE TABLE `category_restaurant` (
  `id` int(10) UNSIGNED NOT NULL,
  `restaurant_id` int(10) UNSIGNED NOT NULL,
  `category_id` int(10) UNSIGNED NOT NULL,
  `state` int(11) NOT NULL DEFAULT '1',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `chains`
--

CREATE TABLE `chains` (
  `id` int(10) UNSIGNED NOT NULL,
  `title_fa` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `title_en` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `slug` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `content` text COLLATE utf8_unicode_ci,
  `page_title` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `meta_keywords` text COLLATE utf8_unicode_ci,
  `meta_description` text COLLATE utf8_unicode_ci,
  `state` int(11) NOT NULL DEFAULT '1',
  `created_by` int(10) UNSIGNED NOT NULL,
  `updated_by` int(10) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `chains`
--

INSERT INTO `chains` (`id`, `title_fa`, `title_en`, `slug`, `content`, `page_title`, `meta_keywords`, `meta_description`, `state`, `created_by`, `updated_by`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, 'رستوران بوف', 'رستوران بوف', 'رستوران بوف', '', '', '', '', 1, 1, 1, '2018-01-23 07:01:17', '2018-01-23 07:01:17', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `customers`
--

CREATE TABLE `customers` (
  `id` int(10) UNSIGNED NOT NULL,
  `state` int(11) NOT NULL DEFAULT '1',
  `created_by` int(10) UNSIGNED NOT NULL,
  `updated_by` int(10) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `likes`
--

CREATE TABLE `likes` (
  `id` int(10) UNSIGNED NOT NULL,
  `user_id` int(10) UNSIGNED DEFAULT NULL,
  `user_ip` varchar(45) COLLATE utf8_unicode_ci NOT NULL,
  `score_type` int(11) NOT NULL,
  `likable_id` int(10) UNSIGNED NOT NULL,
  `likable_type` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `state` int(11) NOT NULL DEFAULT '1',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `locations`
--

CREATE TABLE `locations` (
  `id` int(10) UNSIGNED NOT NULL,
  `title_fa` varchar(255) NOT NULL,
  `title_en` varchar(255) NOT NULL,
  `slug` varchar(255) NOT NULL,
  `slug_fa` varchar(255) DEFAULT NULL,
  `description` text,
  `type` int(11) NOT NULL DEFAULT '0',
  `latitude` varchar(255) DEFAULT NULL,
  `longitude` varchar(255) DEFAULT NULL,
  `map_zoom` varchar(3) NOT NULL DEFAULT '13',
  `parent_id` int(11) DEFAULT NULL,
  `lft` int(11) DEFAULT NULL,
  `rgt` int(11) DEFAULT NULL,
  `depth` int(11) DEFAULT NULL,
  `state` int(11) NOT NULL,
  `created_by` int(10) UNSIGNED NOT NULL,
  `updated_by` int(10) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `locations`
--

INSERT INTO `locations` (`id`, `title_fa`, `title_en`, `slug`, `slug_fa`, `description`, `type`, `latitude`, `longitude`, `map_zoom`, `parent_id`, `lft`, `rgt`, `depth`, `state`, `created_by`, `updated_by`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, 'جهان', 'world', 'world', 'جهان', '', 1, NULL, NULL, '13', NULL, 1, 1780, 0, 1, 1, 1, '2017-01-17 08:03:14', '2018-01-24 07:10:25', NULL),
(2, 'آسیا', 'asia', 'asia', 'آسیا', '', 2, '35.766012', '51.432455', '13', 1, 2, 1287, 1, 1, 1, 1, '2017-01-17 08:03:14', '2018-01-24 07:15:27', NULL),
(3, 'ایران', 'iran', 'iran', 'ایران', '', 3, NULL, NULL, '13', 2, 3, 890, 2, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:23:36', NULL),
(4, 'استان آذربایجان شرقی', 'east azerbaijan province', 'east-azerbaijan-province', 'استان-آذربایجان-شرقی', '', 4, NULL, NULL, '13', 3, 454, 495, 3, 1, 1, 1, '2017-01-17 08:03:14', '2017-12-16 19:55:23', NULL),
(5, 'بستان آباد', 'bostanabad', 'bostanabad', 'بستان-آباد', '', 5, NULL, NULL, '13', 4, 485, 486, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:23:36', NULL),
(6, 'هشترود', 'hashtrud', 'hashtrud', 'هشترود', '', 5, NULL, NULL, '13', 4, 463, 464, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:23:36', NULL),
(7, 'جلفا', 'jolfa', 'jolfa', 'جلفا', '', 5, NULL, NULL, '13', 4, 465, 466, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:23:36', NULL),
(8, 'شبستر', 'shabestar', 'shabestar', 'شبستر', '', 5, NULL, NULL, '13', 4, 467, 468, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:23:36', NULL),
(9, 'ملکان', 'malekan', 'malekan', 'ملکان', '', 5, NULL, NULL, '13', 4, 469, 470, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:23:36', NULL),
(10, 'ورزقان', 'varzaqan', 'varzaqan', 'ورزقان', '', 5, NULL, NULL, '13', 4, 471, 472, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:23:36', NULL),
(11, 'مراغه', 'maragheh', 'maragheh', 'مراغه', '', 5, NULL, NULL, '13', 4, 491, 492, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:23:36', NULL),
(12, 'آذرشهر', 'azarshahr', 'azarshahr', 'آذرشهر', '', 5, NULL, NULL, '13', 4, 461, 462, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:23:36', NULL),
(13, 'عجب شیر', 'ajab shir', 'ajab-shir', 'عجب-شیر', '', 5, NULL, NULL, '13', 4, 493, 494, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:23:36', NULL),
(14, 'بناب', 'bonab', 'bonab', 'بناب', '', 5, NULL, NULL, '13', 4, 459, 460, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:23:36', NULL),
(15, 'کلیبر', 'kaleybar', 'kaleybar', 'کلیبر', '', 5, NULL, NULL, '13', 4, 473, 474, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:23:36', NULL),
(16, 'تبریز', 'tabriz', 'tabriz', 'تبریز', '', 5, NULL, NULL, '13', 4, 475, 476, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:23:36', NULL),
(17, 'اسکو', 'osku', 'osku', 'اسکو', '', 5, NULL, NULL, '13', 4, 477, 478, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:23:36', NULL),
(18, 'سراب', 'sarab', 'sarab', 'سراب', '', 5, NULL, NULL, '13', 4, 479, 480, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:23:36', NULL),
(19, 'مرند', 'marand', 'marand', 'مرند', '', 5, NULL, NULL, '13', 4, 481, 482, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:23:36', NULL),
(20, 'میانه', 'mianeh', 'mianeh', 'میانه', '', 5, NULL, NULL, '13', 4, 483, 484, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:23:36', NULL),
(21, 'خدا آفرین', 'khoda afarin', 'khoda-afarin', 'خدا-آفرین', '', 5, NULL, NULL, '13', 4, 455, 456, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:23:36', NULL),
(22, 'هریس', 'heris', 'heris', 'هریس', '', 5, NULL, NULL, '13', 4, 487, 488, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:23:36', NULL),
(23, 'اهر', 'ahar', 'ahar', 'اهر', '', 5, NULL, NULL, '13', 4, 457, 458, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:23:36', NULL),
(24, 'چاراویماق', 'charuymaq', 'charuymaq', 'چاراویماق', '', 5, NULL, NULL, '13', 4, 489, 490, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:23:36', NULL),
(25, 'استان آذربایجان غربی', 'west azerbaijan province', 'west-azerbaijan-province', 'استان-آذربایجان-غربی', '', 4, NULL, NULL, '13', 3, 4, 39, 3, 1, 1, 1, '2017-01-17 08:03:14', '2018-01-24 07:25:19', NULL),
(26, 'چالدران', 'chaldoran', 'chaldoran', 'چالدران', '', 5, NULL, NULL, '13', 25, 21, 22, 4, 1, 1, 1, '2017-01-17 08:03:14', '2018-01-24 07:25:18', NULL),
(27, 'مهاباد', 'mahabad', 'mahabad', 'مهاباد', '', 5, NULL, NULL, '13', 25, 5, 6, 4, 1, 1, 1, '2017-01-17 08:03:14', '2018-01-24 07:25:18', NULL),
(28, 'ماکو', 'maku', 'maku', 'ماکو', '', 5, NULL, NULL, '13', 25, 31, 32, 4, 1, 1, 1, '2017-01-17 08:03:14', '2018-01-24 07:25:18', NULL),
(29, 'نقده', 'naqadeh', 'naqadeh', 'نقده', '', 5, NULL, NULL, '13', 25, 7, 8, 4, 1, 1, 1, '2017-01-17 08:03:14', '2018-01-24 07:25:18', NULL),
(30, 'شاهین دژ', 'shahin dezh', 'shahin-dezh', 'شاهین-دژ', '', 5, NULL, NULL, '13', 25, 23, 24, 4, 1, 1, 1, '2017-01-17 08:03:14', '2018-01-24 07:25:18', NULL),
(31, 'پلدشت', 'poldasht', 'poldasht', 'پلدشت', '', 5, NULL, NULL, '13', 25, 9, 10, 4, 1, 1, 1, '2017-01-17 08:03:14', '2018-01-24 07:25:18', NULL),
(32, 'شوط', 'showt', 'showt', 'شوط', '', 5, NULL, NULL, '13', 25, 33, 34, 4, 1, 1, 1, '2017-01-17 08:03:14', '2018-01-24 07:25:18', NULL),
(33, 'ارومیه', 'urmia', 'urmia', 'ارومیه', '', 5, NULL, NULL, '13', 25, 11, 12, 4, 1, 1, 1, '2017-01-17 08:03:14', '2018-01-24 07:25:18', NULL),
(34, 'تکاب', 'takab', 'takab', 'تکاب', '', 5, NULL, NULL, '13', 25, 25, 26, 4, 1, 1, 1, '2017-01-17 08:03:14', '2018-01-24 07:25:18', NULL),
(35, 'بوکان', 'bukan', 'bukan', 'بوکان', '', 5, NULL, NULL, '13', 25, 13, 14, 4, 1, 1, 1, '2017-01-17 08:03:14', '2018-01-24 07:25:18', NULL),
(36, 'خوی', 'khoy', 'khoy', 'خوی', '', 5, NULL, NULL, '13', 25, 35, 36, 4, 1, 1, 1, '2017-01-17 08:03:14', '2018-01-24 07:25:18', NULL),
(37, 'سر دشت', 'sardasht', 'sardasht', 'سر-دشت', '', 5, NULL, NULL, '13', 25, 15, 16, 4, 1, 1, 1, '2017-01-17 08:03:14', '2018-01-24 07:25:18', NULL),
(38, 'میاندوآب', 'miandoab', 'miandoab', 'میاندوآب', '', 5, NULL, NULL, '13', 25, 27, 28, 4, 1, 1, 1, '2017-01-17 08:03:14', '2018-01-24 07:25:18', NULL),
(39, 'سلماس', 'salmas', 'salmas', 'سلماس', '', 5, NULL, NULL, '13', 25, 17, 18, 4, 1, 1, 1, '2017-01-17 08:03:14', '2018-01-24 07:25:18', NULL),
(40, 'پیرانشهر', 'piranshahr', 'piranshahr', 'پیرانشهر', '', 5, NULL, NULL, '13', 25, 37, 38, 4, 1, 1, 1, '2017-01-17 08:03:14', '2018-01-24 07:25:18', NULL),
(41, 'چایپاره', 'chaypareh', 'chaypareh', 'چایپاره', '', 5, NULL, NULL, '13', 25, 19, 20, 4, 1, 1, 1, '2017-01-17 08:03:14', '2018-01-24 07:25:18', NULL),
(42, 'اشنویه', 'oshnavieh', 'oshnavieh', 'اشنویه', '', 5, NULL, NULL, '13', 25, 29, 30, 4, 1, 1, 1, '2017-01-17 08:03:14', '2018-01-24 07:25:18', NULL),
(43, 'استان اردبیل', 'ardabil province', 'ardabil-province', 'استان-اردبیل', '', 4, NULL, NULL, '13', 3, 254, 275, 3, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:17:26', NULL),
(44, 'خلخال', 'khalkhal', 'khalkhal', 'خلخال', '', 5, NULL, NULL, '13', 43, 269, 270, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:17:26', NULL),
(45, 'اردبیل', 'ardabil', 'ardabil', 'اردبیل', '', 5, NULL, NULL, '13', 43, 259, 260, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:17:26', NULL),
(46, 'پارس آباد', 'parsabad', 'parsabad', 'پارس-آباد', '', 5, NULL, NULL, '13', 43, 255, 256, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:17:26', NULL),
(47, 'نیر', 'nir', 'nir', 'نیر', '', 5, NULL, NULL, '13', 43, 261, 262, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:17:26', NULL),
(48, 'نمین', 'namin', 'namin', 'نمین', '', 5, NULL, NULL, '13', 43, 271, 272, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:17:26', NULL),
(49, 'گرمی', 'germi', 'germi', 'گرمی', '', 5, NULL, NULL, '13', 43, 263, 264, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:17:26', NULL),
(50, 'مشگین شهر', 'meshginshahr', 'meshginshahr', 'مشگین-شهر', '', 5, NULL, NULL, '13', 43, 257, 258, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:17:26', NULL),
(51, 'بیله سوار', 'bileh savar', 'bileh-savar', 'بیله-سوار', '', 5, NULL, NULL, '13', 43, 265, 266, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:17:26', NULL),
(52, 'سرعین', 'sareyn', 'sareyn', 'سرعین', '', 5, NULL, NULL, '13', 43, 273, 274, 4, 1, 1, 1, '2017-01-17 08:03:14', '2017-11-06 20:17:26', NULL),
(53, 'کوثر', 'kowsar county', 'kowsar-county', 'کوثر', '', 5, NULL, NULL, '13', 43, 267, 268, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:17:26', NULL),
(54, 'استان اصفهان', 'isfahan province', 'isfahan-province', 'استان-اصفهان', '', 4, NULL, NULL, '13', 3, 578, 625, 3, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(55, 'شاهین شهر و میمه', 'shahin shahr and meymeh', 'shahin-shahr-and-meymeh', 'شاهین-شهر-و-میمه', '', 5, NULL, NULL, '13', 54, 581, 582, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(56, 'سمیرم', 'semirom', 'semirom', 'سمیرم', '', 5, NULL, NULL, '13', 54, 597, 598, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(57, 'اصفهان', 'isfahan', 'isfahan', 'اصفهان', '', 5, NULL, NULL, '13', 54, 583, 584, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(58, 'خمینی شهر', 'khomeyni shahr', 'khomeyni-shahr', 'خمینی-شهر', '', 5, NULL, NULL, '13', 54, 599, 600, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(59, 'تیران و کرون', 'tiran and karvan', 'tiran-and-karvan', 'تیران-و-کرون', '', 5, NULL, NULL, '13', 54, 585, 586, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(60, 'شهرضا', 'shahreza', 'shahreza', 'شهرضا', '', 5, NULL, NULL, '13', 54, 601, 602, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(61, 'کاشان', 'kashan', 'kashan', 'کاشان', '', 5, NULL, NULL, '13', 54, 587, 588, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(62, 'مبارکه', 'mobarakeh', 'mobarakeh', 'مبارکه', '', 5, NULL, NULL, '13', 54, 603, 604, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(63, 'اردستان', 'ardestan', 'ardestan', 'اردستان', '', 5, NULL, NULL, '13', 54, 589, 590, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(64, 'فلاورجان', 'falavarjan', 'falavarjan', 'فلاورجان', '', 5, NULL, NULL, '13', 54, 605, 606, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(65, 'فریدونشهر', 'fereydunshahr', 'fereydunshahr', 'فریدونشهر', '', 5, NULL, NULL, '13', 54, 591, 592, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(66, 'گلپایگان', 'golpayegan', 'golpayegan', 'گلپایگان', '', 5, NULL, NULL, '13', 54, 593, 594, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(67, 'خوانسار', 'khvansar', 'khvansar', 'خوانسار', '', 5, NULL, NULL, '13', 54, 607, 608, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(68, 'نائین', 'nain', 'nain', 'نائین', '', 5, NULL, NULL, '13', 54, 609, 610, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(69, 'نطنز', 'natanz', 'natanz', 'نطنز', '', 5, NULL, NULL, '13', 54, 611, 612, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(70, 'آران و بیدگل', 'aran va bidgol', 'aran-va-bidgol', 'آران-و-بیدگل', '', 5, NULL, NULL, '13', 54, 613, 614, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(71, 'دهاقان', 'dehaqan', 'dehaqan', 'دهاقان', '', 5, NULL, NULL, '13', 54, 623, 624, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(72, 'نجف آباد', 'najafabad', 'najafabad', 'نجف-آباد', '', 5, NULL, NULL, '13', 54, 595, 596, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(73, 'خور و بیابانک', 'khur and biabanak', 'khur-and-biabanak', 'خور-و-بیابانک', '', 5, NULL, NULL, '13', 54, 615, 616, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(74, 'چادگان', 'chadegan', 'chadegan', 'چادگان', '', 5, NULL, NULL, '13', 54, 617, 618, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(75, 'برخوار', 'borkhar', 'borkhar', 'برخوار', '', 5, NULL, NULL, '13', 54, 619, 620, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(76, 'لنجان', 'lenjan', 'lenjan', 'لنجان', '', 5, NULL, NULL, '13', 54, 621, 622, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(77, 'فریدن', 'faridan', 'faridan', 'فریدن', '', 5, NULL, NULL, '13', 54, 579, 580, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(78, 'استان ایلام', 'ilam province', 'ilam-province', 'استان-ایلام', '', 4, NULL, NULL, '13', 3, 114, 131, 3, 1, 1, 1, '2017-01-17 08:03:15', '2017-05-16 18:50:05', NULL),
(79, 'ایلام', 'ilam', 'ilam', 'ایلام', '', 5, NULL, NULL, '13', 78, 119, 120, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-05-16 18:50:05', NULL),
(80, 'ایوان', 'eyvan', 'eyvan', 'ایوان', '', 5, NULL, NULL, '13', 78, 121, 122, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-05-16 18:50:05', NULL),
(81, 'آبدانان', 'abdanan', 'abdanan', 'آبدانان', '', 5, NULL, NULL, '13', 78, 123, 124, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-05-16 18:50:05', NULL),
(82, 'دره شهر', 'darreh shahr', 'darreh-shahr', 'دره-شهر', '', 5, NULL, NULL, '13', 78, 125, 126, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-05-16 18:50:05', NULL),
(83, 'مهران', 'mehran', 'mehran', 'مهران', '', 5, NULL, NULL, '13', 78, 127, 128, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-05-16 18:50:05', NULL),
(84, 'دهلران', 'dehloran', 'dehloran', 'دهلران', '', 5, NULL, NULL, '13', 78, 129, 130, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-05-16 18:50:05', NULL),
(85, 'شیروان و چرداول', 'shirvan and chardavol', 'shirvan-and-chardavol', 'شیروان-و-چرداول', '', 5, NULL, NULL, '13', 78, 115, 116, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-05-16 18:50:05', NULL),
(86, 'ملکشاهی', 'malekshahi', 'malekshahi', 'ملکشاهی', '', 5, NULL, NULL, '13', 78, 117, 118, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-05-16 18:50:05', NULL),
(87, 'استان بوشهر', 'bushehr provinc', 'bushehr-provinc', 'استان-بوشهر', '', 4, NULL, NULL, '13', 3, 136, 159, 3, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:17:26', NULL),
(88, 'بوشهر', 'bushehr', 'bushehr', 'بوشهر', '', 5, NULL, NULL, '13', 87, 137, 138, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-05-16 18:50:05', NULL),
(89, 'دیلم', 'deylam', 'deylam', 'دیلم', '', 5, NULL, NULL, '13', 87, 139, 140, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-05-16 18:50:05', NULL),
(90, 'کنگان', 'bandar kangan', 'bandar-kangan', 'کنگان', '', 5, NULL, NULL, '13', 87, 141, 142, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-05-16 18:50:05', NULL),
(91, 'دیر', 'bandar deyr', 'bandar-deyr', 'دیر', '', 5, NULL, NULL, '13', 87, 143, 144, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-05-16 18:50:05', NULL),
(92, 'دشتی', 'dashti', 'dashti', 'دشتی', '', 5, NULL, NULL, '13', 87, 145, 146, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-05-16 18:50:05', NULL),
(93, 'تنگستان', 'tangestan', 'tangestan', 'تنگستان', '', 5, NULL, NULL, '13', 87, 147, 148, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-05-16 18:50:05', NULL),
(94, 'دشتستان', 'dashtestan', 'dashtestan', 'دشتستان', '', 5, NULL, NULL, '13', 87, 149, 150, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-05-16 18:50:05', NULL),
(95, 'گناوه', 'bandar ganaveh', 'bandar-ganaveh', 'گناوه', '', 5, NULL, NULL, '13', 87, 151, 152, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-05-16 18:50:05', NULL),
(96, 'جم', 'jam', 'jam', 'جم', '', 5, NULL, NULL, '13', 87, 153, 154, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-05-16 18:50:05', NULL),
(97, 'استان تهران', 'tehran province', 'tehran-province', 'استان-تهران', '', 4, NULL, NULL, '13', 3, 224, 253, 3, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:17:26', NULL),
(98, 'قدس', 'qods', 'qods', 'قدس', '', 5, NULL, NULL, '13', 97, 225, 226, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:17:26', NULL),
(99, 'پاکدشت', 'pakdasht', 'pakdasht', 'پاکدشت', '', 5, NULL, NULL, '13', 97, 227, 228, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:17:26', NULL),
(100, 'تهران', 'tehran', 'tehran', 'تهران', '', 5, NULL, NULL, '13', 97, 229, 230, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:17:26', NULL),
(101, 'رباط کریم', 'robat karim', 'robat-karim', 'رباط-کریم', '', 5, NULL, NULL, '13', 97, 231, 232, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:17:26', NULL),
(102, 'شهریار', 'shahriar', 'shahriar', 'شهریار', '', 5, NULL, NULL, '13', 97, 233, 234, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:17:26', NULL),
(103, 'ورامین', 'varamin', 'varamin', 'ورامین', '', 5, NULL, NULL, '13', 97, 237, 238, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:17:26', NULL),
(104, 'اسلامشهر', 'eslamshahr', 'eslamshahr', 'اسلامشهر', '', 5, NULL, NULL, '13', 97, 243, 244, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:17:26', NULL),
(105, 'فیروز کوه', 'firuzkuh', 'firuzkuh', 'فیروز-کوه', '', 5, NULL, NULL, '13', 97, 239, 240, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:17:26', NULL),
(106, 'ری', 'ray', 'ray', 'ری', '', 5, NULL, NULL, '13', 97, 241, 242, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:17:26', NULL),
(107, 'شمیرانات', 'shemiranat', 'shemiranat', 'شمیرانات', '', 5, NULL, NULL, '13', 97, 245, 246, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:17:26', NULL),
(108, 'دماوند', 'damavand', 'damavand', 'دماوند', '', 5, NULL, NULL, '13', 97, 251, 252, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:17:26', NULL),
(109, 'پیشوا', 'pishva', 'pishva', 'پیشوا', '', 5, NULL, NULL, '13', 97, 247, 248, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:17:26', NULL),
(110, 'بهارستان', 'baharestan', 'baharestan', 'بهارستان', '', 5, NULL, NULL, '13', 97, 235, 236, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:17:26', NULL),
(111, 'ملارد', 'malard', 'malard', 'ملارد', '', 5, NULL, NULL, '13', 97, 249, 250, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:17:26', NULL),
(112, 'استان چهار محال و بختیاری', 'chaharmahal and bakhtiari province', 'chaharmahal-and-bakhtiari-province', 'استان-چهار-محال-و-بختیاری', '', 4, NULL, NULL, '13', 3, 160, 175, 3, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:17:26', NULL),
(113, 'لردگان', 'lordegan', 'lordegan', 'لردگان', '', 5, NULL, NULL, '13', 112, 165, 166, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:17:26', NULL),
(114, 'شهر کرد', 'shahr-e kord', 'shahr-e-kord', 'شهر-کرد', '', 5, NULL, NULL, '13', 112, 161, 162, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:17:26', NULL),
(115, 'بروجن', 'borujen', 'borujen', 'بروجن', '', 5, NULL, NULL, '13', 112, 167, 168, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:17:26', NULL),
(116, 'اردل', 'ardal', 'ardal', 'اردل', '', 5, NULL, NULL, '13', 112, 173, 174, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:17:26', NULL),
(117, 'فارسان', 'farsan', 'farsan', 'فارسان', '', 5, NULL, NULL, '13', 112, 169, 170, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:17:26', NULL),
(118, 'کوهرنگ', 'kuhrang', 'kuhrang', 'کوهرنگ', '', 5, NULL, NULL, '13', 112, 163, 164, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:17:26', NULL),
(119, 'کیار', 'kiar', 'kiar', 'کیار', '', 5, NULL, NULL, '13', 112, 171, 172, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:17:26', NULL),
(120, 'استان خراسان شمالی', 'north khorasan province', 'north-khorasan-province', 'استان-خراسان-شمالی', '', 4, NULL, NULL, '13', 3, 756, 771, 3, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(121, 'جاجرم', 'jajrom', 'jajrom', 'جاجرم', '', 5, NULL, NULL, '13', 120, 757, 758, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(122, 'اسفراین', 'esfarayen', 'esfarayen', 'اسفراین', '', 5, NULL, NULL, '13', 120, 765, 766, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(123, 'فاروج', 'faruj', 'faruj', 'فاروج', '', 5, NULL, NULL, '13', 120, 759, 760, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(124, 'بجنورد', 'bojnord', 'bojnord', 'بجنورد', '', 5, NULL, NULL, '13', 120, 767, 768, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(125, 'شیروان', 'shirvan', 'shirvan', 'شیروان', '', 5, NULL, NULL, '13', 120, 761, 762, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(126, 'گرمه', 'garmeh', 'garmeh', 'گرمه', '', 5, NULL, NULL, '13', 120, 769, 770, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(127, 'مانه و سملقان', 'maneh and samalqan', 'maneh-and-samalqan', 'مانه-و-سملقان', '', 5, NULL, NULL, '13', 120, 763, 764, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(128, 'استان خوزستان', 'khuzestan province', 'khuzestan-province', 'استان-خوزستان', '', 4, NULL, NULL, '13', 3, 526, 577, 3, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(129, 'مسجد سلیمان', 'masjed soleyman', 'masjed-soleyman', 'مسجد-سلیمان', '', 5, NULL, NULL, '13', 128, 527, 528, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(130, 'اندیمشک', 'andimeshk', 'andimeshk', 'اندیمشک', '', 5, NULL, NULL, '13', 128, 535, 536, 4, 1, 1, 1, '2017-01-17 08:03:15', '2017-11-06 20:23:36', NULL),
(131, 'بندر ماهشهر', 'bandar-e mahshahr', 'bandar-e-mahshahr', 'بندر-ماهشهر', '', 5, NULL, NULL, '13', 128, 529, 530, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(132, 'شادگان', 'shadegan', 'shadegan', 'شادگان', '', 5, NULL, NULL, '13', 128, 537, 538, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(133, 'امیدیه', 'omidiyeh', 'omidiyeh', 'امیدیه', '', 5, NULL, NULL, '13', 128, 531, 532, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(134, 'لالی', 'lali', 'lali', 'لالی', '', 5, NULL, NULL, '13', 128, 533, 534, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(135, 'رامهرمز', 'ramhormoz', 'ramhormoz', 'رامهرمز', '', 5, NULL, NULL, '13', 128, 575, 576, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(136, 'آغاجاری', 'aghajari', 'aghajari', 'آغاجاری', '', 5, NULL, NULL, '13', 128, 567, 568, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(137, 'آبادان', 'abadan', 'abadan', 'آبادان', '', 5, NULL, NULL, '13', 128, 569, 570, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(138, 'خرمشهر', 'khorramshahr', 'khorramshahr', 'خرمشهر', '', 5, NULL, NULL, '13', 128, 571, 572, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(139, 'اهواز', 'ahvaz', 'ahvaz', 'اهواز', '', 5, NULL, NULL, '13', 128, 573, 574, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(140, 'شوشتر', 'shushtar', 'shushtar', 'شوشتر', '', 5, NULL, NULL, '13', 128, 539, 540, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(141, 'شوش', 'shush', 'shush', 'شوش', '', 5, NULL, NULL, '13', 128, 541, 542, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(142, 'ایذه', 'izeh', 'izeh', 'ایذه', '', 5, NULL, NULL, '13', 128, 543, 544, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(143, 'باغ ملک', 'bagh-e malek', 'bagh-e-malek', 'باغ-ملک', '', 5, NULL, NULL, '13', 128, 545, 546, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(144, 'دزفول', 'dezful', 'dezful', 'دزفول', '', 5, NULL, NULL, '13', 128, 547, 548, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(145, 'بهبهان', 'behbahan', 'behbahan', 'بهبهان', '', 5, NULL, NULL, '13', 128, 549, 550, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(146, 'باوی', 'bavi', 'bavi', 'باوی', '', 5, NULL, NULL, '13', 128, 551, 552, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(147, 'اندیکا', 'andika', 'andika', 'اندیکا', '', 5, NULL, NULL, '13', 128, 553, 554, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(148, 'رامشیر', 'ramshir', 'ramshir', 'رامشیر', '', 5, NULL, NULL, '13', 128, 555, 556, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(149, 'هفتگل', 'haftkel', 'haftkel', 'هفتگل', '', 5, NULL, NULL, '13', 128, 557, 558, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(150, 'دشت آزادگان', 'dasht-e azadegan', 'dasht-e-azadegan', 'دشت-آزادگان', '', 5, NULL, NULL, '13', 128, 559, 560, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(151, 'گتوند', 'gotvand', 'gotvand', 'گتوند', '', 5, NULL, NULL, '13', 128, 561, 562, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(152, 'هویزه', 'hoveyzeh', 'hoveyzeh', 'هویزه', '', 5, NULL, NULL, '13', 128, 563, 564, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(153, 'هندیجان', 'hendijan', 'hendijan', 'هندیجان', '', 5, NULL, NULL, '13', 128, 565, 566, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(154, 'استان زنجان', 'zanjan province', 'zanjan-province', 'استان-زنجان', '', 4, NULL, NULL, '13', 3, 874, 889, 3, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(155, 'طارم', 'tarom', 'tarom', 'طارم', '', 5, NULL, NULL, '13', 154, 881, 882, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(156, 'ماهنشان', 'mah neshan', 'mah-neshan', 'ماهنشان', '', 5, NULL, NULL, '13', 154, 883, 884, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(157, 'ابهر', 'abhar', 'abhar', 'ابهر', '', 5, NULL, NULL, '13', 154, 887, 888, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(158, 'زنجان', 'zanjan', 'zanjan', 'زنجان', '', 5, NULL, NULL, '13', 154, 885, 886, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(159, 'خدابنده', 'khodabandeh', 'khodabandeh', 'خدابنده', '', 5, NULL, NULL, '13', 154, 875, 876, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(160, 'خرمدره', 'khorramdarreh', 'khorramdarreh', 'خرمدره', '', 5, NULL, NULL, '13', 154, 879, 880, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(161, 'ایجرود', 'ijrud', 'ijrud', 'ایجرود', '', 5, NULL, NULL, '13', 154, 877, 878, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(162, 'استان سمنان', 'semnan province', 'semnan-province', 'استان-سمنان', '', 4, NULL, NULL, '13', 3, 392, 407, 3, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:17:26', NULL),
(163, 'گرمسار', 'garmsar', 'garmsar', 'گرمسار', '', 5, NULL, NULL, '13', 162, 393, 394, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:17:26', NULL),
(164, 'دامغان', 'damghan', 'damghan', 'دامغان', '', 5, NULL, NULL, '13', 162, 401, 402, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:17:26', NULL),
(165, 'سمنان', 'semnan', 'semnan', 'سمنان', '', 5, NULL, NULL, '13', 162, 395, 396, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:17:26', NULL),
(166, 'شاهرود', 'shahrud', 'shahrud', 'شاهرود', '', 5, NULL, NULL, '13', 162, 403, 404, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:17:26', NULL),
(167, 'میامی', 'mayamey', 'mayamey', 'میامی', '', 5, NULL, NULL, '13', 162, 397, 398, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:17:26', NULL),
(168, 'آرادان', 'aradan', 'aradan', 'آرادان', '', 5, NULL, NULL, '13', 162, 405, 406, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:17:26', NULL),
(169, 'مهدی شهر', 'mehdishahr', 'mehdishahr', 'مهدی-شهر', '', 5, NULL, NULL, '13', 162, 399, 400, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:17:26', NULL),
(170, 'استان سیستان و بلوچستان', 'sistan and baluchestan province', 'sistan-and-baluchestan-province', 'استان-سیستان-و-بلوچستان', '', 4, NULL, NULL, '13', 3, 496, 525, 3, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(171, 'ایرانشهر', 'iranshahr', 'iranshahr', 'ایرانشهر', '', 5, NULL, NULL, '13', 170, 497, 498, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(172, 'خاش', 'khash', 'khash', 'خاش', '', 5, NULL, NULL, '13', 170, 509, 510, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(173, 'نیک شهر', 'nik shahr', 'nik-shahr', 'نیک-شهر', '', 5, NULL, NULL, '13', 170, 499, 500, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(174, 'سراوان', 'saravan', 'saravan', 'سراوان', '', 5, NULL, NULL, '13', 170, 511, 512, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(175, 'زابل', 'zabol', 'zabol', 'زابل', '', 5, NULL, NULL, '13', 170, 501, 502, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(176, 'زاهدان', 'zahedan', 'zahedan', 'زاهدان', '', 5, NULL, NULL, '13', 170, 513, 514, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(177, 'چابهار', 'chabahar', 'chabahar', 'چابهار', '', 5, '25.294991974045526', '60.64453125', '12', 170, 523, 524, 4, 1, 1, 69792, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(178, 'سیب سوران', 'sib and suran', 'sib-and-suran', 'سیب-سوران', '', 5, NULL, NULL, '13', 170, 515, 516, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(179, 'هیرمند', 'hirmand', 'hirmand', 'هیرمند', '', 5, NULL, NULL, '13', 170, 503, 504, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(180, 'زهک', 'zehak', 'zehak', 'زهک', '', 5, NULL, NULL, '13', 170, 517, 518, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(181, 'مهرستان', 'mehrestan', 'mehrestan', 'مهرستان', '', 5, NULL, NULL, '13', 170, 505, 506, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(182, 'سرباز', 'sarbaz', 'sarbaz', 'سرباز', '', 5, NULL, NULL, '13', 170, 519, 520, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(183, 'دلگان', 'dalgan', 'dalgan', 'دلگان', '', 5, NULL, NULL, '13', 170, 507, 508, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(184, 'کنارک', 'konarak', 'konarak', 'کنارک', '', 5, NULL, NULL, '13', 170, 521, 522, 4, 1, 1, 1, '2017-01-17 08:03:16', '2017-11-06 20:23:36', NULL),
(185, 'استان فارس', 'fars province', 'fars-province', 'استان-فارس', '', 4, NULL, NULL, '13', 3, 40, 99, 3, 1, 1, 1, '2017-01-17 08:03:16', '2018-01-24 07:25:18', NULL),
(186, 'مرودشت', 'marvdasht', 'marvdasht', 'مرودشت', '', 5, NULL, NULL, '13', 185, 51, 52, 4, 1, 1, 1, '2017-01-17 08:03:16', '2018-01-24 07:25:18', NULL),
(187, 'ارسنجان', 'arsanjan', 'arsanjan', 'ارسنجان', '', 5, NULL, NULL, '13', 185, 85, 86, 4, 1, 1, 1, '2017-01-17 08:03:16', '2018-01-24 07:25:18', NULL),
(188, 'استهبان', 'estahban', 'estahban', 'استهبان', '', 5, NULL, NULL, '13', 185, 53, 54, 4, 1, 1, 1, '2017-01-17 08:03:16', '2018-01-24 07:25:18', NULL),
(189, 'اقلید', 'eqlid', 'eqlid', 'اقلید', '', 5, NULL, NULL, '13', 185, 75, 76, 4, 1, 1, 1, '2017-01-17 08:03:16', '2018-01-24 07:25:18', NULL),
(190, 'بوانات', 'bavanat', 'bavanat', 'بوانات', '', 5, NULL, NULL, '13', 185, 55, 56, 4, 1, 1, 1, '2017-01-17 08:03:16', '2018-01-24 07:25:18', NULL),
(191, 'پاسارگاد', 'pasargad', 'pasargad', 'پاسارگاد', '', 5, NULL, NULL, '13', 185, 77, 78, 4, 1, 1, 1, '2017-01-17 08:03:16', '2018-01-24 07:25:18', NULL),
(192, 'جهرم', 'jahrom', 'jahrom', 'جهرم', '', 5, NULL, NULL, '13', 185, 57, 58, 4, 1, 1, 1, '2017-01-17 08:03:16', '2018-01-24 07:25:18', NULL),
(193, 'خنج', 'khonj', 'khonj', 'خنج', '', 5, NULL, NULL, '13', 185, 79, 80, 4, 1, 1, 1, '2017-01-17 08:03:16', '2018-01-24 07:25:18', NULL),
(194, 'زرین دشت', 'zarrin dasht', 'zarrin-dasht', 'زرین-دشت', '', 5, NULL, NULL, '13', 185, 59, 60, 4, 1, 1, 1, '2017-01-17 08:03:16', '2018-01-24 07:25:18', NULL),
(195, 'سپیدان', 'sepidan', 'sepidan', 'سپیدان', '', 5, NULL, NULL, '13', 185, 81, 82, 4, 1, 1, 1, '2017-01-17 08:03:16', '2018-01-24 07:25:18', NULL),
(196, 'فسا', 'fasa', 'fasa', 'فسا', '', 5, NULL, NULL, '13', 185, 61, 62, 4, 1, 1, 1, '2017-01-17 08:03:16', '2018-01-24 07:25:18', NULL),
(197, 'فیروز آباد', 'firuzabad', 'firuzabad', 'فیروز-آباد', '', 5, NULL, NULL, '13', 185, 83, 84, 4, 1, 1, 1, '2017-01-17 08:03:16', '2018-01-24 07:25:18', NULL),
(198, 'کازرون', 'kazerun', 'kazerun', 'کازرون', '', 5, NULL, NULL, '13', 185, 63, 64, 4, 1, 1, 1, '2017-01-17 08:03:17', '2018-01-24 07:25:18', NULL),
(199, 'لارستان', 'larestan', 'larestan', 'لارستان', '', 5, NULL, NULL, '13', 185, 97, 98, 4, 1, 1, 1, '2017-01-17 08:03:17', '2018-01-24 07:25:18', NULL),
(200, 'لامرد', 'lamerd', 'lamerd', 'لامرد', '', 5, NULL, NULL, '13', 185, 65, 66, 4, 1, 1, 1, '2017-01-17 08:03:17', '2018-01-24 07:25:18', NULL),
(201, 'ممسنی', 'mamasani', 'mamasani', 'ممسنی', '', 5, NULL, NULL, '13', 185, 73, 74, 4, 1, 1, 1, '2017-01-17 08:03:17', '2018-01-24 07:25:18', NULL),
(202, 'آباده', 'abadeh', 'abadeh', 'آباده', '', 5, NULL, NULL, '13', 185, 67, 68, 4, 1, 1, 1, '2017-01-17 08:03:17', '2018-01-24 07:25:18', NULL),
(203, 'داراب', 'darab', 'darab', 'داراب', '', 5, NULL, NULL, '13', 185, 41, 42, 4, 1, 1, 1, '2017-01-17 08:03:17', '2018-01-24 07:25:18', NULL),
(204, 'خرم بید', 'khorrambid', 'khorrambid', 'خرم-بید', '', 5, NULL, NULL, '13', 185, 69, 70, 4, 1, 1, 1, '2017-01-17 08:03:17', '2018-01-24 07:25:18', NULL),
(205, 'شیراز', 'shiraz', 'shiraz', 'شیراز', '', 5, NULL, NULL, '13', 185, 71, 72, 4, 1, 1, 1, '2017-01-17 08:03:17', '2018-01-24 07:25:18', NULL),
(206, 'خرامه', 'kharameh', 'kharameh', 'خرامه', '', 5, NULL, NULL, '13', 185, 95, 96, 4, 1, 1, 1, '2017-01-17 08:03:17', '2018-01-24 07:25:18', NULL),
(207, 'نی ریز', 'neyriz', 'neyriz', 'نی-ریز', '', 5, NULL, NULL, '13', 185, 87, 88, 4, 1, 1, 1, '2017-01-17 08:03:17', '2018-01-24 07:25:18', NULL),
(208, 'سروستان', 'sarvestan', 'sarvestan', 'سروستان', '', 5, NULL, NULL, '13', 185, 43, 44, 4, 1, 1, 1, '2017-01-17 08:03:17', '2018-01-24 07:25:18', NULL),
(209, 'رستم', 'rostam', 'rostam', 'رستم', '', 5, NULL, NULL, '13', 185, 89, 90, 4, 1, 1, 1, '2017-01-17 08:03:17', '2018-01-24 07:25:18', NULL),
(210, 'مهر', 'mohr', 'mohr', 'مهر', '', 5, NULL, NULL, '13', 185, 45, 46, 4, 1, 1, 1, '2017-01-17 08:03:17', '2018-01-24 07:25:18', NULL),
(211, 'گراش', 'gerash', 'gerash', 'گراش', '', 5, NULL, NULL, '13', 185, 91, 92, 4, 1, 1, 1, '2017-01-17 08:03:17', '2018-01-24 07:25:18', NULL),
(212, 'فراشبند', 'farashband', 'farashband', 'فراشبند', '', 5, NULL, NULL, '13', 185, 47, 48, 4, 1, 1, 1, '2017-01-17 08:03:17', '2018-01-24 07:25:18', NULL),
(213, 'کوار', 'kavar', 'kavar', 'کوار', '', 5, NULL, NULL, '13', 185, 93, 94, 4, 1, 1, 1, '2017-01-17 08:03:17', '2018-01-24 07:25:18', NULL),
(214, 'قیروکارزین', 'qir and karzin', 'qir-and-karzin', 'قیروکارزین', '', 5, NULL, NULL, '13', 185, 49, 50, 4, 1, 1, 1, '2017-01-17 08:03:17', '2018-01-24 07:25:18', NULL),
(215, 'استان قزوین', 'qazvin province', 'qazvin-province', 'استان-قزوین', '', 4, NULL, NULL, '13', 3, 100, 113, 3, 1, 1, 1, '2017-01-17 08:03:17', '2017-05-16 18:50:05', NULL),
(216, 'بوئین زهرا', 'buin zahra', 'buin-zahra', 'بوئین-زهرا', '', 5, NULL, NULL, '13', 215, 101, 102, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-05-16 18:50:05', NULL),
(217, 'قزوین', 'qazvin', 'qazvin', 'قزوین', '', 5, NULL, NULL, '13', 215, 103, 104, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-05-16 18:50:05', NULL),
(218, 'آبیک', 'abyek', 'abyek', 'آبیک', '', 5, NULL, NULL, '13', 215, 105, 106, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-05-16 18:50:05', NULL),
(219, 'تاکستان', 'takestan', 'takestan', 'تاکستان', '', 5, NULL, NULL, '13', 215, 107, 108, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-05-16 18:50:05', NULL),
(220, 'آوج', 'avaj', 'avaj', 'آوج', '', 5, NULL, NULL, '13', 215, 109, 110, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-05-16 18:50:05', NULL),
(221, 'البرز', 'alborz', 'alborz', 'البرز', '', 5, NULL, NULL, '13', 215, 111, 112, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-05-16 18:50:05', NULL),
(222, 'استان قم', 'qom province', 'qom-province', 'استان-قم', '', 4, NULL, NULL, '13', 3, 132, 135, 3, 1, 1, 1, '2017-01-17 08:03:17', '2017-05-16 18:50:05', NULL),
(223, 'قم', 'qom', 'qom', 'قم', '', 5, NULL, NULL, '13', 222, 133, 134, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-07-18 11:23:40', NULL),
(224, 'استان کردستان', 'kurdistan province', 'kurdistan-province', 'استان-کردستان', '', 4, NULL, NULL, '13', 3, 318, 339, 3, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(225, 'بانه', 'baneh', 'baneh', 'بانه', '', 5, NULL, NULL, '13', 224, 329, 330, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(226, 'قروه', 'qorveh', 'qorveh', 'قروه', '', 5, NULL, NULL, '13', 224, 321, 322, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(227, 'کامیاران', 'kamyaran', 'kamyaran', 'کامیاران', '', 5, NULL, NULL, '13', 224, 331, 332, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(228, 'دیواندره', 'divandarreh', 'divandarreh', 'دیواندره', '', 5, NULL, NULL, '13', 224, 323, 324, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(229, 'مریوان', 'marivan', 'marivan', 'مریوان', '', 5, NULL, NULL, '13', 224, 333, 334, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(230, 'سقز', 'saqqez', 'saqqez', 'سقز', '', 5, NULL, NULL, '13', 224, 325, 326, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(231, 'سنندج', 'sanandaj', 'sanandaj', 'سنندج', '', 5, NULL, NULL, '13', 224, 335, 336, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(232, 'سروآباد', 'sarvabad', 'sarvabad', 'سروآباد', '', 5, NULL, NULL, '13', 224, 327, 328, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(233, 'بیجار', 'bijar', 'bijar', 'بیجار', '', 5, NULL, NULL, '13', 224, 337, 338, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(234, 'دهگلان', 'dehgolan', 'dehgolan', 'دهگلان', '', 5, NULL, NULL, '13', 224, 319, 320, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(235, 'استان کرمان', 'kerman province', 'kerman-province', 'استان-کرمان', '', 4, NULL, NULL, '13', 3, 176, 223, 3, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(236, 'بردسیر', 'bardsir', 'bardsir', 'بردسیر', '', 5, NULL, NULL, '13', 235, 177, 178, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(237, 'راور', 'ravar', 'ravar', 'راور', '', 5, NULL, NULL, '13', 235, 179, 180, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(238, 'زرند', 'zarand', 'zarand', 'زرند', '', 5, NULL, NULL, '13', 235, 181, 182, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(239, 'شهر بابک', 'shahr-e babak', 'shahr-e-babak', 'شهر-بابک', '', 5, NULL, NULL, '13', 235, 183, 184, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(240, 'جیرفت', 'jiroft', 'jiroft', 'جیرفت', '', 5, NULL, NULL, '13', 235, 185, 186, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(241, 'رفسنجان', 'rafsanjan', 'rafsanjan', 'رفسنجان', '', 5, NULL, NULL, '13', 235, 187, 188, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(242, 'سیرجان', 'sirjan', 'sirjan', 'سیرجان', '', 5, NULL, NULL, '13', 235, 189, 190, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(243, 'کهنوج', 'kahnuj', 'kahnuj', 'کهنوج', '', 5, NULL, NULL, '13', 235, 209, 210, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(244, 'بم', 'bam', 'bam', 'بم', '', 5, NULL, NULL, '13', 235, 191, 192, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(245, 'کرمان', 'kerman', 'kerman', 'کرمان', '', 5, NULL, NULL, '13', 235, 217, 218, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(246, 'بافت', 'baft', 'baft', 'بافت', '', 5, NULL, NULL, '13', 235, 219, 220, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(247, 'فاریاب', 'faryab', 'faryab', 'فاریاب', '', 5, NULL, NULL, '13', 235, 211, 212, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(248, 'ارزوئیه', 'arzuiyeh', 'arzuiyeh', 'ارزوئیه', '', 5, NULL, NULL, '13', 235, 213, 214, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(249, 'نرماشیر', 'narmashir', 'narmashir', 'نرماشیر', '', 5, NULL, NULL, '13', 235, 215, 216, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(250, 'فهرج', 'fahraj', 'fahraj', 'فهرج', '', 5, NULL, NULL, '13', 235, 221, 222, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(251, 'کوهبنان', 'kuhbanan', 'kuhbanan', 'کوهبنان', '', 5, NULL, NULL, '13', 235, 193, 194, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(252, 'رودبار جنوب', 'rudbar-e jonubi', 'rudbar-e-jonubi', 'رودبار-جنوب', '', 5, NULL, NULL, '13', 235, 195, 196, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(253, 'عنبر آباد', 'anbarabad', 'anbarabad', 'عنبر-آباد', '', 5, NULL, NULL, '13', 235, 197, 198, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(254, 'قلعه گنج', 'qaleh ganj', 'qaleh-ganj', 'قلعه-گنج', '', 5, NULL, NULL, '13', 235, 199, 200, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(255, 'منوجان', 'manujan', 'manujan', 'منوجان', '', 5, NULL, NULL, '13', 235, 201, 202, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(256, 'ریگان', 'rigan', 'rigan', 'ریگان', '', 5, NULL, NULL, '13', 235, 203, 204, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(257, 'انار', 'anar', 'anar', 'انار', '', 5, NULL, NULL, '13', 235, 205, 206, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(258, 'رابر', 'rabor', 'rabor', 'رابر', '', 5, NULL, NULL, '13', 235, 207, 208, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(259, 'استان کرمانشاه', 'kermanshah province', 'kermanshah-province', 'استان-کرمانشاه', '', 4, NULL, NULL, '13', 3, 340, 369, 3, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(260, 'اسلام آباد غرب', 'eslamabad-e gharb', 'eslamabad-e-gharb', 'اسلام-آباد-غرب', '', 5, NULL, NULL, '13', 259, 347, 348, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(261, 'ثلاث باباجانی', 'salas-e babajani', 'salas-e-babajani', 'ثلاث-باباجانی', '', 5, NULL, NULL, '13', 259, 345, 346, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(262, 'جوانرود', 'javanrud', 'javanrud', 'جوانرود', '', 5, NULL, NULL, '13', 259, 349, 350, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(263, 'سر پل ذهاب', 'sarpol-e zahab', 'sarpol-e-zahab', 'سر-پل-ذهاب', '', 5, NULL, NULL, '13', 259, 361, 362, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(264, 'سنقر', 'sonqor', 'sonqor', 'سنقر', '', 5, NULL, NULL, '13', 259, 351, 352, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(265, 'صحنه', 'sahneh', 'sahneh', 'صحنه', '', 5, NULL, NULL, '13', 259, 363, 364, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(266, 'قصر شیرین', 'qasr-e shirin', 'qasr-e-shirin', 'قصر-شیرین', '', 5, NULL, NULL, '13', 259, 353, 354, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(267, 'گیلانغرب', 'gilan-e gharb', 'gilan-e-gharb', 'گیلانغرب', '', 5, NULL, NULL, '13', 259, 365, 366, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(268, 'پاوه', 'paweh', 'paweh', 'پاوه', '', 5, NULL, NULL, '13', 259, 355, 356, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(269, 'کرمانشاه', 'kermanshah', 'kermanshah', 'کرمانشاه', '', 5, NULL, NULL, '13', 259, 367, 368, 4, 1, 1, 1, '2017-01-17 08:03:17', '2017-11-06 20:17:26', NULL),
(270, 'کنگاور', 'kangavar', 'kangavar', 'کنگاور', '', 5, NULL, NULL, '13', 259, 357, 358, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:17:26', NULL),
(271, 'روانسر', 'ravansar', 'ravansar', 'روانسر', '', 5, NULL, NULL, '13', 259, 341, 342, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:17:26', NULL),
(272, 'هرسین', 'harsin', 'harsin', 'هرسین', '', 5, NULL, NULL, '13', 259, 359, 360, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:17:26', NULL),
(273, 'دالاهو', 'dalahu', 'dalahu', 'دالاهو', '', 5, NULL, NULL, '13', 259, 343, 344, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:17:26', NULL),
(274, 'استان کهگیلویه و بویراحمد', 'kohgiluyeh and boyer', 'kohgiluyeh-and-boyer', 'استان-کهگیلویه-و-بویراحمد', '', 4, NULL, NULL, '13', 3, 648, 665, 3, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(275, 'بویر احمد', 'boyer-ahmad', 'boyer-ahmad', 'بویر-احمد', '', 5, NULL, NULL, '13', 274, 651, 652, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(276, 'کهگیلویه', 'kohgiluyeh', 'kohgiluyeh', 'کهگیلویه', '', 5, NULL, NULL, '13', 274, 659, 660, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(277, 'دنا', 'dana', 'dana', 'دنا', '', 5, NULL, NULL, '13', 274, 653, 654, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(278, 'گچساران', 'gachsaran', 'gachsaran', 'گچساران', '', 5, NULL, NULL, '13', 274, 661, 662, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(279, 'چرام', 'charam', 'charam', 'چرام', '', 5, NULL, NULL, '13', 274, 655, 656, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(280, 'باشت', 'basht', 'basht', 'باشت', '', 5, NULL, NULL, '13', 274, 663, 664, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(281, 'بهمئی', 'bahmai', 'bahmai', 'بهمئی', '', 5, NULL, NULL, '13', 274, 657, 658, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(282, 'استان گلستان', 'golestan province', 'golestan-province', 'استان-گلستان', '', 4, NULL, NULL, '13', 3, 692, 721, 3, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(283, 'رامیان', 'ramian', 'ramian', 'رامیان', '', 5, NULL, NULL, '13', 282, 693, 694, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(284, 'بندر گز', 'bandar-e gaz', 'bandar-e-gaz', 'بندر-گز', '', 5, NULL, NULL, '13', 282, 709, 710, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(285, 'علی آباد', 'aliabad-e katul', 'aliabad-e-katul', 'علی-آباد', '', 5, NULL, NULL, '13', 282, 695, 696, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(286, 'مینودشت', 'minudasht', 'minudasht', 'مینودشت', '', 5, NULL, NULL, '13', 282, 711, 712, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(287, 'کلاله', 'kalaleh', 'kalaleh', 'کلاله', '', 5, NULL, NULL, '13', 282, 713, 714, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(288, 'ترکمن', 'torkaman', 'torkaman', 'ترکمن', '', 5, NULL, NULL, '13', 282, 697, 698, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(289, 'آزاد شهر', 'azadshahr', 'azadshahr', 'آزاد-شهر', '', 5, NULL, NULL, '13', 282, 719, 720, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(290, 'گرگان', 'gorgan', 'gorgan', 'گرگان', '', 5, NULL, NULL, '13', 282, 717, 718, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(291, 'گنبد کاووس', 'gonbad-e kavus', 'gonbad-e-kavus', 'گنبد-کاووس', '', 5, NULL, NULL, '13', 282, 699, 700, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(292, 'کردکوی', 'kordkuy', 'kordkuy', 'کردکوی', '', 5, NULL, NULL, '13', 282, 701, 702, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(293, 'آق قلا', 'aqqala', 'aqqala', 'آق-قلا', '', 5, NULL, NULL, '13', 282, 703, 704, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(294, 'مراوه تپه', 'maraveh tappeh', 'maraveh-tappeh', 'مراوه-تپه', '', 5, NULL, NULL, '13', 282, 705, 706, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(295, 'گمیشان', 'gomishan', 'gomishan', 'گمیشان', '', 5, NULL, NULL, '13', 282, 707, 708, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(296, 'گالیکش', 'galikash', 'galikash', 'گالیکش', '', 5, NULL, NULL, '13', 282, 715, 716, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(297, 'استان گیلان', 'gilan province', 'gilan-province', 'استان-گیلان', '', 4, NULL, NULL, '13', 3, 722, 755, 3, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(298, 'آستارا', 'astara', 'astara', 'آستارا', '', 5, NULL, NULL, '13', 297, 723, 724, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(299, 'بندر انزلی', 'bandar-e anzali', 'bandar-e-anzali', 'بندر-انزلی', '', 5, NULL, NULL, '13', 297, 735, 736, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(300, 'طوالش', 'talesh', 'talesh', 'طوالش', '', 5, NULL, NULL, '13', 297, 749, 750, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(301, 'رضوانشهر', 'rezvanshahr', 'rezvanshahr', 'رضوانشهر', '', 5, NULL, NULL, '13', 297, 737, 738, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(302, 'لنگرود', 'langarud', 'langarud', 'لنگرود', '', 5, NULL, NULL, '13', 297, 725, 726, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(303, 'آستانه اشرفیه', 'astaneh-ye ashrafiyeh', 'astaneh-ye-ashrafiyeh', 'آستانه-اشرفیه', '', 5, NULL, NULL, '13', 297, 739, 740, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(304, 'شفت', 'shaft', 'shaft', 'شفت', '', 5, NULL, NULL, '13', 297, 751, 752, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(305, 'رشت', 'rasht', 'rasht', 'رشت', '', 5, NULL, NULL, '13', 297, 741, 742, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(306, 'لاهیجان', 'lahijan', 'lahijan', 'لاهیجان', '', 5, NULL, NULL, '13', 297, 727, 728, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(307, 'سیاهکل', 'siahkal', 'siahkal', 'سیاهکل', '', 5, NULL, NULL, '13', 297, 743, 744, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(308, 'فومن', 'fuman', 'fuman', 'فومن', '', 5, NULL, NULL, '13', 297, 753, 754, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(309, 'رودسر', 'rudsar', 'rudsar', 'رودسر', '', 5, NULL, NULL, '13', 297, 745, 746, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(310, 'رودبار', 'rudbar', 'rudbar', 'رودبار', '', 5, NULL, NULL, '13', 297, 747, 748, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(311, 'صومعه سرا', 'sowme`eh sara', 'sowmeeh-sara', 'صومعه-سرا', '', 5, NULL, NULL, '13', 297, 729, 730, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(312, 'املش', 'amlash', 'amlash', 'املش', '', 5, NULL, NULL, '13', 297, 731, 732, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(313, 'ماسال', 'masal', 'masal', 'ماسال', '', 5, NULL, NULL, '13', 297, 733, 734, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(314, 'استان لرستان', 'lorestan province', 'lorestan-province', 'استان-لرستان', '', 4, NULL, NULL, '13', 3, 626, 647, 3, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(315, 'دلفان', 'delfan', 'delfan', 'دلفان', '', 5, NULL, NULL, '13', 314, 627, 628, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(316, 'ازنا', 'azna', 'azna', 'ازنا', '', 5, NULL, NULL, '13', 314, 629, 630, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(317, 'کوهدشت', 'kuhdasht', 'kuhdasht', 'کوهدشت', '', 5, NULL, NULL, '13', 314, 631, 632, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(318, 'بروجرد', 'borujerd', 'borujerd', 'بروجرد', '', 5, NULL, NULL, '13', 314, 633, 634, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(319, 'خرم آباد', 'khorramabad', 'khorramabad', 'خرم-آباد', '', 5, NULL, NULL, '13', 314, 641, 642, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(320, 'دورود', 'dorud', 'dorud', 'دورود', '', 5, NULL, NULL, '13', 314, 635, 636, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(321, 'الیگودرز', 'aligudarz', 'aligudarz', 'الیگودرز', '', 5, NULL, NULL, '13', 314, 643, 644, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(322, 'پلدختر', 'pol-e dokhtar', 'pol-e-dokhtar', 'پلدختر', '', 5, NULL, NULL, '13', 314, 637, 638, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL);
INSERT INTO `locations` (`id`, `title_fa`, `title_en`, `slug`, `slug_fa`, `description`, `type`, `latitude`, `longitude`, `map_zoom`, `parent_id`, `lft`, `rgt`, `depth`, `state`, `created_by`, `updated_by`, `created_at`, `updated_at`, `deleted_at`) VALUES
(323, 'سلسله', 'selseleh', 'selseleh', 'سلسله', '', 5, NULL, NULL, '13', 314, 645, 646, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(324, 'دوره', 'dowreh', 'dowreh', 'دوره', '', 5, NULL, NULL, '13', 314, 639, 640, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:23:36', NULL),
(325, 'استان مازندران', 'mazandaran province', 'mazandaran-province', 'استان-مازندران', '', 4, NULL, NULL, '13', 3, 276, 317, 3, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:17:26', NULL),
(326, 'بهشهر', 'behshahr', 'behshahr', 'بهشهر', '', 5, NULL, NULL, '13', 325, 291, 292, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:17:26', NULL),
(327, 'جویبار', 'juybar', 'juybar', 'جویبار', '', 5, NULL, NULL, '13', 325, 277, 278, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:17:26', NULL),
(328, 'آمل', 'amol', 'amol', 'آمل', '', 5, NULL, NULL, '13', 325, 293, 294, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:17:26', NULL),
(329, 'بابل', 'babol', 'babol', 'بابل', '', 5, NULL, NULL, '13', 325, 283, 284, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:17:26', NULL),
(330, 'رامسر', 'ramsar', 'ramsar', 'رامسر', '', 5, NULL, NULL, '13', 325, 295, 296, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:17:26', NULL),
(331, 'ساری', 'sari', 'sari', 'ساری', '', 5, NULL, NULL, '13', 325, 285, 286, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:17:26', NULL),
(332, 'قائم شهر', 'qaem shahr', 'qaem-shahr', 'قائم-شهر', '', 5, NULL, NULL, '13', 325, 297, 298, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:17:26', NULL),
(333, 'نکا', 'neka', 'neka', 'نکا', '', 5, NULL, NULL, '13', 325, 299, 300, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:17:26', NULL),
(334, 'نوشهر', 'nowshahr', 'nowshahr', 'نوشهر', '', 5, NULL, NULL, '13', 325, 287, 288, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:17:26', NULL),
(335, 'چالوس', 'chalus', 'chalus', 'چالوس', '', 5, NULL, NULL, '13', 325, 301, 302, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:17:26', NULL),
(336, 'تنکابن', 'tonekabon', 'tonekabon', 'تنکابن', '', 5, NULL, NULL, '13', 325, 311, 312, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:17:26', NULL),
(337, 'سواد کوه', 'savadkuh', 'savadkuh', 'سواد-کوه', '', 5, NULL, NULL, '13', 325, 303, 304, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:17:26', NULL),
(338, 'نور', 'noor', 'noor', 'نور', '', 5, NULL, NULL, '13', 325, 279, 280, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:17:26', NULL),
(339, 'محمود آباد', 'mahmudabad', 'mahmudabad', 'محمود-آباد', '', 5, NULL, NULL, '13', 325, 305, 306, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:17:26', NULL),
(340, 'بابلسر', 'babolsar', 'babolsar', 'بابلسر', '', 5, NULL, NULL, '13', 325, 313, 314, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:17:26', NULL),
(341, 'فریدونکنار', 'fereydunkenar', 'fereydunkenar', 'فریدونکنار', '', 5, NULL, NULL, '13', 325, 307, 308, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:17:26', NULL),
(342, 'میاندورود', 'miandorud', 'miandorud', 'میاندورود', '', 5, NULL, NULL, '13', 325, 281, 282, 4, 1, 1, 1, '2017-01-17 08:03:18', '2017-11-06 20:17:26', NULL),
(343, 'عباس آباد', 'abbasabad', 'abbasabad', 'عباس-آباد', '', 5, NULL, NULL, '13', 325, 309, 310, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:17:26', NULL),
(344, 'گلوگاه', 'galugah', 'galugah', 'گلوگاه', '', 5, NULL, NULL, '13', 325, 289, 290, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:17:26', NULL),
(345, 'استان مرکزی', 'central province', 'central-province', 'استان-مرکزی', '', 4, NULL, NULL, '13', 3, 666, 691, 3, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(346, 'آشتیان', 'ashtian', 'ashtian', 'آشتیان', '', 5, NULL, NULL, '13', 345, 667, 668, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(347, 'تفرش', 'tafresh', 'tafresh', 'تفرش', '', 5, NULL, NULL, '13', 345, 669, 670, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(348, 'خمین', 'khomeyn', 'khomeyn', 'خمین', '', 5, NULL, NULL, '13', 345, 671, 672, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(349, 'شازند', 'shazand', 'shazand', 'شازند', '', 5, NULL, NULL, '13', 345, 673, 674, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(350, 'محلات', 'mahallat', 'mahallat', 'محلات', '', 5, NULL, NULL, '13', 345, 675, 676, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(351, 'دلیجان', 'delijan', 'delijan', 'دلیجان', '', 5, NULL, NULL, '13', 345, 677, 678, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(352, 'ساوه', 'saveh', 'saveh', 'ساوه', '', 5, NULL, NULL, '13', 345, 685, 686, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(353, 'اراک', 'arak', 'arak', 'اراک', '', 5, NULL, NULL, '13', 345, 679, 680, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(354, 'فراهان', 'farahan', 'farahan', 'فراهان', '', 5, NULL, NULL, '13', 345, 689, 690, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(355, 'کمیجان', 'komijan', 'komijan', 'کمیجان', '', 5, NULL, NULL, '13', 345, 681, 682, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(356, 'زرندیه', 'zarandieh', 'zarandieh', 'زرندیه', '', 5, NULL, NULL, '13', 345, 687, 688, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(357, 'خنداب', 'khondab', 'khondab', 'خنداب', '', 5, NULL, NULL, '13', 345, 683, 684, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(358, 'استان هرمزگان', 'hormozgan province', 'hormozgan-province', 'استان-هرمزگان', '', 4, NULL, NULL, '13', 3, 408, 441, 3, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(359, 'رودان', 'rudan', 'rudan', 'رودان', '', 5, NULL, NULL, '13', 358, 411, 412, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:17:26', NULL),
(360, 'بندرعباس', 'bandar abbas', 'bandar-abbas', 'بندرعباس', '', 5, '35.766012', '51.432455', '13', 358, 413, 414, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:17:26', NULL),
(361, 'میناب', 'minab', 'minab', 'میناب', '', 5, NULL, NULL, '13', 358, 423, 424, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:17:26', NULL),
(362, 'سیریک', 'sirik', 'sirik', 'سیریک', '', 5, NULL, NULL, '13', 358, 415, 416, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:17:26', NULL),
(363, 'خمیر', 'bandar khamir', 'bandar-khamir', 'خمیر', '', 5, NULL, NULL, '13', 358, 425, 426, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:17:26', NULL),
(364, 'بستک', 'bastak', 'bastak', 'بستک', '', 5, NULL, NULL, '13', 358, 417, 418, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:17:26', NULL),
(365, 'بندرلنگه', 'bandar lengeh', 'bandar-lengeh', 'بندرلنگه', '', 5, NULL, NULL, '13', 358, 427, 428, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:17:26', NULL),
(366, 'قشم', 'qeshm', 'qeshm', 'قشم', '', 5, NULL, NULL, '13', 358, 419, 420, 4, 1, 1, 1, '2017-01-17 08:03:19', '2018-01-15 16:08:53', NULL),
(367, 'ابوموسی', 'abu musa', 'abu-musa', 'ابوموسی', '', 5, NULL, NULL, '13', 358, 429, 430, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:17:26', NULL),
(368, 'جاسک', 'jask', 'jask', 'جاسک', '', 5, NULL, NULL, '13', 358, 421, 422, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:17:26', NULL),
(369, 'پارسیان', 'parsian', 'parsian', 'پارسیان', '', 5, NULL, NULL, '13', 358, 431, 432, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:17:26', NULL),
(370, 'بشاگرد', 'bashagard', 'bashagard', 'بشاگرد', '', 5, NULL, NULL, '13', 358, 435, 436, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:17:26', NULL),
(371, 'حاجی آباد', 'hajjiabad', 'hajjiabad', 'حاجی-آباد', '', 5, NULL, NULL, '13', 358, 433, 434, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:17:26', NULL),
(372, 'کیش', 'kish', 'kish', 'کیش', '', 5, NULL, NULL, '13', 358, 409, 410, 4, 1, 1, 1, '2017-01-17 08:03:19', '2018-01-15 16:33:10', NULL),
(373, 'استان همدان', 'hamadan province', 'hamadan-province', 'استان-همدان', '', 4, NULL, NULL, '13', 3, 772, 791, 3, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(374, 'تویسرکان', 'tuyserkan', 'tuyserkan', 'تویسرکان', '', 5, NULL, NULL, '13', 373, 783, 784, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(375, 'بهار', 'bahar', 'bahar', 'بهار', '', 5, NULL, NULL, '13', 373, 775, 776, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(376, 'اسد آباد', 'asadabad', 'asadabad', 'اسد-آباد', '', 5, NULL, NULL, '13', 373, 789, 790, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(377, 'نهاوند', 'nahavand', 'nahavand', 'نهاوند', '', 5, NULL, NULL, '13', 373, 777, 778, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(378, 'رزن', 'razan', 'razan', 'رزن', '', 5, NULL, NULL, '13', 373, 785, 786, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(379, 'کبودرآهنگ', 'kabudrahang', 'kabudrahang', 'کبودرآهنگ', '', 5, NULL, NULL, '13', 373, 779, 780, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(380, 'ملایر', 'malayer', 'malayer', 'ملایر', '', 5, NULL, NULL, '13', 373, 773, 774, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(381, 'همدان', 'hamadan', 'hamadan', 'همدان', '', 5, NULL, NULL, '13', 373, 781, 782, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(382, 'فامنین', 'famenin', 'famenin', 'فامنین', '', 5, NULL, NULL, '13', 373, 787, 788, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(383, 'استان یزد', 'yazd province', 'yazd-province', 'استان-یزد', '', 4, NULL, NULL, '13', 3, 792, 815, 3, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(384, 'ابرکوه', 'abarkuh', 'abarkuh', 'ابرکوه', '', 5, NULL, NULL, '13', 383, 809, 810, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-28 14:50:02', NULL),
(385, 'اردکان', 'ardakan', 'ardakan', 'اردکان', '', 5, NULL, NULL, '13', 383, 795, 796, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(386, 'بافق', 'bafq', 'bafq', 'بافق', '', 5, '31.62040980934372', '55.41383743286133', '12', 383, 813, 814, 4, 1, 1, 69896, '2017-01-17 08:03:19', '2017-12-30 18:36:32', NULL),
(387, 'میبد', 'meybod', 'meybod', 'میبد', '', 5, NULL, NULL, '13', 383, 797, 798, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(388, 'مهریز', 'mehriz', 'mehriz', 'مهریز', '', 5, NULL, NULL, '13', 383, 793, 794, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(389, 'طبس', 'tabas', 'tabas', 'طبس', '', 5, NULL, NULL, '13', 383, 799, 800, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(390, 'تفت', 'taft', 'taft', 'تفت', '', 5, NULL, NULL, '13', 383, 805, 806, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-28 14:50:02', NULL),
(391, 'یزد', 'yazd', 'yazd', 'یزد', '', 5, NULL, NULL, '13', 383, 801, 802, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(392, 'صدوق', 'saduq', 'saduq', 'صدوق', '', 5, NULL, NULL, '13', 383, 811, 812, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-28 14:50:02', NULL),
(393, 'خاتم', 'khatam', 'khatam', 'خاتم', '', 5, NULL, NULL, '13', 383, 803, 804, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(394, 'بهاباد', 'behabad', 'behabad', 'بهاباد', '', 5, NULL, NULL, '13', 383, 807, 808, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-28 14:50:02', NULL),
(395, 'استان خراسان رضوی', 'razavi khorasan province', 'razavi-khorasan-province', 'استان-خراسان-رضوی', '', 4, NULL, NULL, '13', 3, 816, 873, 3, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(396, 'گناباد', 'gonabad', 'gonabad', 'گناباد', '', 5, NULL, NULL, '13', 395, 829, 830, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(397, 'تایباد', 'taybad', 'taybad', 'تایباد', '', 5, NULL, NULL, '13', 395, 845, 846, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(398, 'چناران', 'chenaran', 'chenaran', 'چناران', '', 5, NULL, NULL, '13', 395, 859, 860, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(399, 'خلیل آباد', 'khalilabad', 'khalilabad', 'خلیل-آباد', '', 5, NULL, NULL, '13', 395, 847, 848, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(400, 'رشتخوار', 'roshtkhar', 'roshtkhar', 'رشتخوار', '', 5, NULL, NULL, '13', 395, 865, 866, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(401, 'سبزوار', 'sabzevar', 'sabzevar', 'سبزوار', '', 5, NULL, NULL, '13', 395, 849, 850, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(402, 'سرخس', 'sarakhs', 'sarakhs', 'سرخس', '', 5, NULL, NULL, '13', 395, 861, 862, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(403, 'کاشمر', 'kashmar', 'kashmar', 'کاشمر', '', 5, NULL, NULL, '13', 395, 851, 852, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(404, 'نیشابور', 'nishapur', 'nishapur', 'نیشابور', '', 5, NULL, NULL, '13', 395, 827, 828, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(405, 'مه ولات', 'mahvelat', 'mahvelat', 'مه-ولات', '', 5, NULL, NULL, '13', 395, 853, 854, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(406, 'تربت جام', 'torbat-e jam', 'torbat-e-jam', 'تربت-جام', '', 5, NULL, NULL, '13', 395, 863, 864, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(407, 'قوچان', 'quchan', 'quchan', 'قوچان', '', 5, NULL, NULL, '13', 395, 855, 856, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(408, 'فریمان', 'fariman', 'fariman', 'فریمان', '', 5, NULL, NULL, '13', 395, 867, 868, 4, 1, 1, 1, '2017-01-17 08:03:19', '2017-11-06 20:23:36', NULL),
(409, 'کلات', 'kalat', 'kalat', 'کلات', '', 5, NULL, NULL, '13', 395, 857, 858, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:23:36', NULL),
(410, 'مشهد', 'mashhad', 'mashhad', 'مشهد', '', 5, '36.27085020723903', '59.622802734375', '11', 395, 871, 872, 4, 1, 1, 69896, '2017-01-17 08:03:20', '2018-01-15 15:56:33', NULL),
(411, 'تربت حیدریه', 'torbat-e heydarieh', 'torbat-e-heydarieh', 'تربت-حیدریه', '', 5, NULL, NULL, '13', 395, 831, 832, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:23:36', NULL),
(412, 'خواف', 'khvaf', 'khvaf', 'خواف', '', 5, NULL, NULL, '13', 395, 833, 834, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:23:36', NULL),
(413, 'درگز', 'dargaz', 'dargaz', 'درگز', '', 5, NULL, NULL, '13', 395, 869, 870, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:23:36', NULL),
(414, 'بجستان', 'bajestan', 'bajestan', 'بجستان', '', 5, NULL, NULL, '13', 395, 835, 836, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:23:36', NULL),
(415, 'داورزن', 'davarzan', 'davarzan', 'داورزن', '', 5, NULL, NULL, '13', 395, 837, 838, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:23:36', NULL),
(416, 'بینالود', 'binalud', 'binalud', 'بینالود', '', 5, NULL, NULL, '13', 395, 839, 840, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:23:36', NULL),
(417, 'زاوه', 'zaveh', 'zaveh', 'زاوه', '', 5, NULL, NULL, '13', 395, 841, 842, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:23:36', NULL),
(418, 'جوین', 'jowayin', 'jowayin', 'جوین', '', 5, NULL, NULL, '13', 395, 843, 844, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:23:36', NULL),
(419, 'خوشاب', 'khoshab', 'khoshab', 'خوشاب', '', 5, NULL, NULL, '13', 395, 817, 818, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:23:36', NULL),
(420, 'فیروزه', 'firuzeh', 'firuzeh', 'فیروزه', '', 5, NULL, NULL, '13', 395, 819, 820, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:23:36', NULL),
(421, 'جغتای', 'joghatai', 'joghatai', 'جغتای', '', 5, NULL, NULL, '13', 395, 821, 822, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:23:36', NULL),
(422, 'بردسکن', 'bardaskan', 'bardaskan', 'بردسکن', '', 5, NULL, NULL, '13', 395, 823, 824, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:23:36', NULL),
(423, 'باخرز', 'bakharz', 'bakharz', 'باخرز', '', 5, NULL, NULL, '13', 395, 825, 826, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:23:36', NULL),
(424, 'استان خراسان جنوبی', 'south khorasan province', 'south-khorasan-province', 'استان-خراسان-جنوبی', '', 4, NULL, NULL, '13', 3, 370, 391, 3, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:17:26', NULL),
(425, 'فردوس', 'ferdows', 'ferdows', 'فردوس', '', 5, NULL, NULL, '13', 424, 371, 372, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:17:26', NULL),
(426, 'قائنات', 'qaen', 'qaen', 'قائنات', '', 5, NULL, NULL, '13', 424, 389, 390, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:17:26', NULL),
(427, 'بیرجند', 'birjand', 'birjand', 'بیرجند', '', 5, NULL, NULL, '13', 424, 373, 374, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:17:26', NULL),
(428, 'زیرکوه', 'zirkuh', 'zirkuh', 'زیرکوه', '', 5, NULL, NULL, '13', 424, 375, 376, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:17:26', NULL),
(429, 'خوسف', 'khusf', 'khusf', 'خوسف', '', 5, NULL, NULL, '13', 424, 377, 378, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:17:26', NULL),
(430, 'سرایان', 'sarayan', 'sarayan', 'سرایان', '', 5, NULL, NULL, '13', 424, 379, 380, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:17:26', NULL),
(431, 'درمیان', 'darmian', 'darmian', 'درمیان', '', 5, NULL, NULL, '13', 424, 381, 382, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:17:26', NULL),
(432, 'بشرویه', 'boshruyeh', 'boshruyeh', 'بشرویه', '', 5, NULL, NULL, '13', 424, 383, 384, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:17:26', NULL),
(433, 'سربیشه', 'sarbisheh', 'sarbisheh', 'سربیشه', '', 5, NULL, NULL, '13', 424, 385, 386, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:17:26', NULL),
(434, 'نهبندان', 'nehbandan', 'nehbandan', 'نهبندان', '', 5, NULL, NULL, '13', 424, 387, 388, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:17:26', NULL),
(435, 'استان البرز', 'alborz province', 'alborz-province', 'استان-البرز', '', 4, NULL, NULL, '13', 3, 442, 453, 3, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:23:36', NULL),
(436, 'کرج', 'karaj', 'karaj', 'کرج', '', 5, NULL, NULL, '13', 435, 443, 444, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:23:36', NULL),
(437, 'ساوجبلاغ', 'savojbolagh', 'savojbolagh', 'ساوجبلاغ', '', 5, NULL, NULL, '13', 435, 445, 446, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:23:36', NULL),
(438, 'طالقان', 'taleqan', 'taleqan', 'طالقان', '', 5, NULL, NULL, '13', 435, 447, 448, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:23:36', NULL),
(439, 'نظر آباد', 'nazarabad', 'nazarabad', 'نظر-آباد', '', 5, NULL, NULL, '13', 435, 449, 450, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:23:36', NULL),
(440, 'اشتهارد', 'eshtehard', 'eshtehard', 'اشتهارد', '', 5, NULL, NULL, '13', 435, 451, 452, 4, 1, 1, 1, '2017-01-17 08:03:20', '2017-11-06 20:23:36', NULL),
(442, 'ترکیه', 'Turkey', 'turkey', 'ترکیه', '', 3, '35.766012', '51.432455', '12', 2, 1085, 1174, 2, 1, 1, 1, '2017-01-22 05:50:20', '2018-01-02 22:01:51', NULL),
(443, 'آنتالیا', 'Antalya', 'antalya', 'آنتالیا', '', 4, '36.88181755936464', '30.7177734375', '9', 442, 1134, 1165, 3, 1, 1, 69896, '2017-01-22 05:50:20', '2018-01-15 16:59:01', NULL),
(444, 'شهر آنتالیا', 'Antalya City', 'antalya-city', 'شهر-آنتالیا', '', 5, '35.766012', '51.432455', '12', 443, 1159, 1160, 4, 1, 1, 69792, '2017-01-22 05:50:20', '2017-12-10 15:50:06', NULL),
(445, 'لارا', 'Lara', 'lara', 'لارا', '', 5, '35.766012', '51.432455', '12', 443, 1135, 1138, 4, 1, 1, 1, '2017-01-22 05:50:20', '2017-12-10 15:50:06', NULL),
(446, 'کمر', 'Kemer', 'kemer', 'کمر', '', 5, '35.766012', '51.432455', '12', 443, 1139, 1146, 4, 1, 1, 1, '2017-01-22 05:50:20', '2017-12-10 15:50:06', NULL),
(447, 'کندو', 'Kundu', 'kundu', 'کندو', '', 6, '36.856339', '30.8853626', '13', 445, 1136, 1137, 5, 1, 1, 1, '2017-01-22 05:50:20', '2017-12-10 15:50:06', NULL),
(448, 'بلک', 'Belek', 'belek', 'بلک', '', 7, '', '', '', 443, 1147, 1148, 4, 1, 1, 1, '2017-01-22 05:50:20', '2017-12-10 15:50:06', NULL),
(449, 'بلدیبی', 'Beldibi', 'beldibi', 'بلدیبی', '', 7, '', '', '', 446, 1144, 1145, 5, 1, 1, 1, '2017-01-22 05:50:20', '2017-12-10 15:50:06', NULL),
(450, 'چامیووا', 'Camyuva', 'camyuva', 'چامیووا', '', 7, '', '', '', 446, 1140, 1141, 5, 1, 1, 1, '2017-01-22 05:50:20', '2017-12-10 15:50:06', NULL),
(451, 'سیده', 'Side', 'side', 'سیده', '', 7, '', '', '', 443, 1149, 1150, 4, 1, 1, 1, '2017-01-22 05:50:20', '2017-12-10 15:50:06', NULL),
(452, 'گوینوک', 'Goynuk', 'goynuk', 'گوینوک', '', 7, '', '', '', 446, 1142, 1143, 5, 1, 1, 1, '2017-01-22 05:50:20', '2017-12-10 15:50:06', NULL),
(453, 'کیزیلیکاگ', 'Kizilagac', 'kizilagac', 'کیزیلیکاگ', '', 7, '', '', '', 443, 1151, 1152, 4, 1, 1, 1, '2017-01-22 05:50:20', '2017-12-10 15:50:06', NULL),
(454, 'آوسالار', 'Avsallar', 'avsallar', 'آوسالار', '', 7, '35.766012', '51.432455', '12', 462, 1156, 1157, 5, 1, 1, 69792, '2017-01-22 05:50:20', '2017-12-10 15:50:06', NULL),
(455, 'کلاکلی', 'Colakli', 'colakli', 'کلاکلی', '', 7, '', '', '', 443, 1153, 1154, 4, 1, 1, 1, '2017-01-22 05:50:20', '2017-12-10 15:50:06', NULL),
(456, 'استانبول', 'Istanbul', 'istanbul', 'استانبول', '', 5, '35.766012', '51.432455000000004', '12', 442, 1112, 1113, 3, 1, 1, 69896, '2017-01-22 05:50:20', '2018-01-15 17:04:46', NULL),
(457, 'کوش آداسی', 'Kusadasi', 'kusadasi', 'کوش_آداسی', '', 5, '37.85750715625203', '27.260684967041016', '13', 840, 1115, 1116, 4, 1, 1, 69792, '2017-01-22 05:50:20', '2018-01-15 16:29:57', NULL),
(458, 'بدروم', 'Bodrum', 'bodrum', 'بدروم', '', 5, '35.766012', '51.432455', '12', 442, 1110, 1111, 3, 1, 1, 1, '2017-01-22 05:50:20', '2017-12-10 15:50:06', NULL),
(459, 'مارماریس', 'Marmaris', 'marmaris', 'مارماریس', '', 5, '35.766012', '51.432455', '12', 442, 1108, 1109, 3, 1, 1, 1, '2017-01-22 05:50:20', '2018-01-15 15:21:12', NULL),
(460, 'آنکارا', 'ankara', 'ankara', 'آنکارا', '', 5, '35.766012', '51.432455', '12', 442, 1098, 1099, 3, 1, 1, 69756, '2017-01-22 05:50:20', '2018-01-14 14:58:37', NULL),
(461, 'ازمیر', 'Izmir', 'izmir', 'ازمیر', '', 5, '38.42373905276718', '27.143096923828125', '11', 841, 1121, 1122, 4, 1, 1, 69792, '2017-01-22 05:50:20', '2018-01-15 16:29:57', NULL),
(462, 'آلانیا', 'Alanya', 'alanya', 'آلانیا', '', 5, '35.766012', '51.432455', '12', 443, 1155, 1158, 4, 1, 1, 69792, '2017-01-22 05:50:20', '2017-12-10 15:50:06', NULL),
(463, 'وان', 'Van', 'van', 'وان', '', 5, '35.766012', '51.432455', '12', 442, 1104, 1105, 3, 1, 1, 69756, '2017-01-22 05:50:21', '2018-01-15 14:26:54', NULL),
(464, 'قونیه', 'Konya', 'konya', 'قونیه', '', 5, '35.766012', '51.432455', '12', 442, 1168, 1169, 3, 1, 1, 69896, '2017-01-22 05:50:21', '2017-12-14 14:23:19', NULL),
(465, 'ترابزون', 'Trabzon', 'trabzon', 'ترابزون', '', 5, '', '', '', 442, 1086, 1087, 3, 1, 1, 1, '2017-01-22 05:50:21', '2017-12-10 15:50:06', NULL),
(466, 'ایغدیر', 'Igdir', 'igdir', 'ایغدیر', '', 5, '', '', '', 442, 1088, 1089, 3, 1, 1, 1, '2017-01-22 05:50:21', '2017-12-10 15:50:06', NULL),
(467, 'دیدیم', 'Didim', 'didim', 'دیدیم', '', 5, '37.37588679823346', '27.26480484008789', '13', 840, 1117, 1118, 4, 1, 1, 69792, '2017-01-22 05:50:21', '2017-12-10 15:50:06', NULL),
(468, 'کاپادوکیا', 'Cappadocia', 'cappadocia', 'کاپادوکیا', '', 5, '42.00727725786289', '13.277921676635742', '12', 442, 1166, 1167, 3, 1, 1, 69896, '2017-01-22 05:50:21', '2017-12-10 15:50:06', NULL),
(469, 'ارزروم', 'Erzurum', 'erzurum', 'ارزروم', '', 5, '', '', '', 442, 1090, 1091, 3, 1, 1, 1, '2017-01-22 05:50:21', '2017-12-10 15:50:06', NULL),
(470, 'اولودنیز', 'Oludeniz', 'oludeniz', 'اولودنیز', '', 5, '35.766012', '51.432455', '12', 442, 1102, 1103, 3, 1, 1, 69756, '2017-01-22 05:50:21', '2017-12-10 15:50:06', NULL),
(471, 'فتحیه', 'Fethiye', 'fethiye', 'فتحیه', '', 5, '35.766012', '51.432455', '12', 442, 1100, 1101, 3, 1, 1, 69756, '2017-01-22 05:50:21', '2017-12-10 15:50:06', NULL),
(472, 'پاموکاله', 'Pamukkale', 'pamukkale', 'پاموکاله', '', 5, '', '', '', 442, 1092, 1093, 3, 1, 1, 1, '2017-01-22 05:50:21', '2017-12-10 15:50:06', NULL),
(473, 'امارات', 'uae', 'uae', 'امارات', '', 3, '35.766012', '51.432455', '12', 2, 891, 900, 2, 1, 1, 1, '2017-01-22 05:50:21', '2017-11-06 20:23:36', NULL),
(474, 'دبی', 'Dubai', 'dubai', 'دبی', '', 5, '35.766012', '51.432455', '12', 473, 898, 899, 3, 1, 1, 69896, '2017-01-22 05:50:21', '2018-01-15 16:58:00', NULL),
(475, 'راس الخیمه', 'Ras_Al_Khaimah', 'ras_al_khaimah', 'راس-الخیمه', '', 5, '', '', '', 473, 892, 893, 3, 1, 1, 1, '2017-01-22 05:50:21', '2017-11-06 20:23:36', NULL),
(476, 'تایلند', 'Thailand', 'thailand', 'تایلند', '', 3, '35.766012', '51.432455', '12', 2, 1041, 1060, 2, 1, 1, 1, '2017-01-22 05:50:21', '2017-12-10 15:50:06', NULL),
(477, 'پاتایا', 'Pataya', 'pataya', 'پاتایا', '', 5, '35.766012', '51.432455', '12', 476, 1056, 1057, 3, 1, 1, 1, '2017-01-22 05:50:21', '2018-01-15 16:54:05', NULL),
(478, 'بانکوک', 'Bangkok', 'bangkok', 'بانکوک', '', 5, '35.766012', '51.432455', '12', 476, 1046, 1047, 3, 1, 1, 69756, '2017-01-22 05:50:21', '2018-01-15 16:38:55', NULL),
(479, 'کرابی', 'Krabi', 'krabi', 'کرابی', '', 5, '35.766012', '51.432455', '12', 707, 1049, 1050, 4, 1, 1, 1, '2017-01-22 05:50:21', '2017-12-10 15:50:06', NULL),
(480, 'سامویی', 'Samui', 'samui', 'سامویی', '', 5, '35.766012', '51.432455', '12', 476, 1042, 1043, 3, 1, 1, 1, '2017-01-22 05:50:21', '2018-01-15 14:48:11', NULL),
(481, 'پوکت', 'Phuket', 'phuket', 'پوکت', '', 5, '35.766012', '51.432455', '12', 476, 1054, 1055, 3, 1, 1, 1, '2017-01-22 05:50:21', '2018-01-15 16:58:08', NULL),
(482, 'جزیره فی فی', 'Phi_Phi_Islands', 'phi_phi_islands', 'جزیره-فی-فی', '', 5, '35.766012', '51.432455', '12', 707, 1051, 1052, 4, 1, 1, 1, '2017-01-22 05:50:21', '2018-01-13 18:27:22', NULL),
(483, 'چیانگ مای', 'Chiang_Mai', 'chiang_mai', 'چیانگ-مای', '', 5, '35.766012', '51.432455', '12', 476, 1044, 1045, 3, 1, 1, 1, '2017-01-22 05:50:21', '2017-12-10 15:50:06', NULL),
(484, 'مالزی', 'Malaysia', 'malaysia', 'مالزی', '', 3, '35.766012', '51.432455', '12', 2, 1215, 1234, 2, 1, 1, 69896, '2017-01-22 05:50:21', '2018-01-02 22:01:51', NULL),
(485, 'کوالالامپور', 'Kualalampur', 'kualalampur', 'کوالالامپور', '', 5, '35.766012', '51.432455', '12', 484, 1228, 1229, 3, 1, 1, 1, '2017-01-22 05:50:21', '2018-01-15 16:57:45', NULL),
(486, 'لنکاوی', 'Langkawi', 'langkawi', 'لنکاوی', '', 5, '35.766012', '51.432455', '12', 484, 1216, 1217, 3, 1, 1, 1, '2017-01-22 05:50:21', '2018-01-15 16:57:45', NULL),
(487, 'پنانگ', 'Penang', 'penang', 'پنانگ', '', 5, '35.766012', '51.432455000000004', '13', 484, 1226, 1227, 3, 1, 1, 1, '2017-01-22 05:50:21', '2018-01-15 16:37:37', NULL),
(488, 'جزیره ردانگ', 'Pulau_Redang', 'pulau_redang', 'جزیره-ردانگ', '', 5, '35.766012', '51.432455', '12', 484, 1218, 1219, 3, 1, 1, 1, '2017-01-22 05:50:21', '2018-01-02 22:01:51', NULL),
(489, 'کوتا کینابالو', 'Kota_Kinabalu', 'kota_kinabalu', 'کوتا-کینابالو', '', 5, '35.766012', '51.432455', '12', 708, 1221, 1222, 4, 1, 1, 1, '2017-01-22 05:50:21', '2018-01-02 22:01:51', NULL),
(490, 'جزیره مانوکان', 'Manukan_Island', 'manukan_island', 'جزیره-مانوکان', '', 5, '35.766012', '51.432455', '12', 708, 1223, 1224, 4, 1, 1, 1, '2017-01-22 05:50:21', '2018-01-02 22:01:51', NULL),
(492, 'اندونزی', 'Indoneisia', 'indoneisia', 'اندونزی', '', 3, '35.766012', '51.432455', '12', 2, 925, 936, 2, 1, 1, 1, '2017-01-22 05:50:21', '2017-11-12 20:23:12', NULL),
(493, 'بالی', 'Bali', 'bali', 'بالی', '', 5, '35.766012', '51.432455', '12', 492, 928, 935, 3, 1, 1, 69896, '2017-01-22 05:50:21', '2018-01-15 16:17:46', NULL),
(494, 'جاکارتا', 'Jakarta', 'jakarta', 'جاکارتا', '', 5, '', '', '', 492, 926, 927, 3, 1, 1, 1, '2017-01-22 05:50:21', '2017-11-06 20:23:36', NULL),
(495, 'سنگاپور', 'Singapore', 'singapore', 'سنگاپور', '', 3, '1.3498201887565244', '103.86749267578125', '10', 2, 1015, 1020, 2, 1, 1, 69792, '2017-01-22 05:50:21', '2018-01-15 15:53:43', NULL),
(496, 'شهر سنگاپور', 'Singapore-City', 'singapore-city', 'شهر-سنگاپور', '', 5, '35.766012', '51.432455', '12', 495, 1018, 1019, 3, 1, 1, 69792, '2017-01-22 05:50:21', '2018-01-15 16:46:48', NULL),
(497, 'جزیره سنتوسا', 'Sentosa', 'sentosa', 'جزیره-سنتوسا', '', 5, '', '', '', 495, 1016, 1017, 3, 1, 1, 1, '2017-01-22 05:50:22', '2017-12-10 15:50:06', NULL),
(498, 'چین', 'China', 'china', 'چین', '', 3, '35.766012', '51.432455', '12', 2, 1061, 1084, 2, 1, 1, 1, '2017-01-22 05:50:22', '2017-12-10 15:50:06', NULL),
(499, 'شانگهای', 'Shanghai', 'shanghai', 'شانگهای', '', 5, '35.766012', '51.432455', '12', 498, 1080, 1081, 3, 1, 1, 69896, '2017-01-22 05:50:22', '2018-01-15 16:45:58', NULL),
(500, 'پکن', 'Beijing', 'beijing', 'پکن', '', 5, '35.766012', '51.432455', '12', 498, 1076, 1077, 3, 1, 1, 69896, '2017-01-22 05:50:22', '2018-01-15 16:45:58', NULL),
(501, 'گوانجو', 'Guangzhou', 'guangzhou', 'گوانجو', '', 5, '35.766012', '51.432455', '12', 498, 1078, 1079, 3, 1, 1, 69896, '2017-01-22 05:50:22', '2018-01-15 15:56:19', NULL),
(502, 'هانگزو', 'Hangzhou', 'hangzhou', 'هانگزو', '', 5, '', '', '', 498, 1062, 1063, 3, 1, 1, 1, '2017-01-22 05:50:22', '2018-01-15 15:29:02', NULL),
(503, 'شنزن', 'Shenzhen', 'shenzhen', 'شنزن', '', 5, '', '', '', 498, 1064, 1065, 3, 1, 1, 1, '2017-01-22 05:50:22', '2017-12-10 15:50:06', NULL),
(504, 'شیامن', 'Xiamen', 'xiamen', 'شیامن', '', 5, '', '', '', 498, 1066, 1067, 3, 1, 1, 1, '2017-01-22 05:50:22', '2017-12-10 15:50:06', NULL),
(505, 'سوژو', 'Suzhou', 'suzhou', 'سوژو', '', 5, '', '', '', 498, 1068, 1069, 3, 1, 1, 1, '2017-01-22 05:50:22', '2017-12-10 15:50:06', NULL),
(506, 'ایوو', 'Yiwu', 'yiwu', 'ایوو', '', 5, '', '', '', 498, 1070, 1071, 3, 1, 1, 1, '2017-01-22 05:50:22', '2017-12-10 15:50:06', NULL),
(507, 'گویلین', 'Guilin', 'guilin', 'گویلین', '', 5, '', '', '', 498, 1072, 1073, 3, 1, 1, 1, '2017-01-22 05:50:22', '2017-12-10 15:50:06', NULL),
(508, 'مالدیو', 'Maldive', 'maldive', 'مالدیو', '', 3, '35.766012', '51.432455', '12', 2, 999, 1010, 2, 1, 1, 69756, '2017-01-22 05:50:22', '2018-01-13 14:49:46', NULL),
(509, 'کره جنوبی', 'South_Korea', 'south_korea', 'کره-جنوبی', '', 3, '35.766012', '51.432455', '12', 2, 971, 978, 2, 1, 1, 1, '2017-01-22 05:50:22', '2017-11-12 20:23:12', NULL),
(510, 'سئول', 'Seoul', 'seoul', 'سئول', '', 5, '', '', '', 509, 972, 973, 3, 1, 1, 1, '2017-01-22 05:50:22', '2018-01-08 21:24:01', NULL),
(511, 'بوسان', 'Busan', 'busan', 'بوسان', '', 5, '', '', '', 509, 974, 975, 3, 1, 1, 1, '2017-01-22 05:50:22', '2018-01-08 21:24:01', NULL),
(512, 'جزیره جیجو', 'jeju_island', 'jeju_island', 'جزیره-جیجو', '', 4, '35.766012', '51.432455', '12', 509, 976, 977, 3, 1, 1, 1, '2017-01-22 05:50:22', '2018-01-08 21:24:01', NULL),
(513, 'ژاپن', 'Japan', 'japan', 'ژاپن', '', 3, '35.766012', '51.432455', '12', 2, 979, 994, 2, 1, 1, 1, '2017-01-22 05:50:22', '2017-12-10 15:50:06', NULL),
(514, 'توکیو', 'Tokyo', 'tokyo', 'توکیو', '', 5, '', '', '', 513, 980, 981, 3, 1, 1, 1, '2017-01-22 05:50:22', '2017-11-12 20:23:12', NULL),
(515, 'اوزاکا', 'Osaka', 'osaka', 'اوزاکا', '', 5, '', '', '', 513, 982, 983, 3, 1, 1, 1, '2017-01-22 05:50:22', '2017-11-12 20:23:12', NULL),
(516, 'یوکوهاما', 'Yokohama', 'yokohama', 'یوکوهاما', '', 5, '', '', '', 513, 984, 985, 3, 1, 1, 1, '2017-01-22 05:50:22', '2017-11-12 20:23:12', NULL),
(517, 'آتامی', 'Atami', 'atami', 'آتامی', '', 5, '', '', '', 513, 986, 987, 3, 1, 1, 1, '2017-01-22 05:50:22', '2017-11-12 20:23:12', NULL),
(518, 'عراق', 'Iraq', 'iraq', 'عراق', '', 3, '35.766012', '51.432455', '12', 2, 955, 962, 2, 1, 1, 1, '2017-01-22 05:50:22', '2017-11-12 20:23:12', NULL),
(519, 'نجف', 'Najaf', 'najaf', 'نجف', '', 5, '', '', '', 518, 956, 957, 3, 1, 1, 1, '2017-01-22 05:50:22', '2017-11-12 20:23:12', NULL),
(520, 'کربلا', 'Karbala', 'karbala', 'کربلا', '', 5, '', '', '', 518, 958, 959, 3, 1, 1, 1, '2017-01-22 05:50:22', '2017-11-12 20:23:12', NULL),
(521, 'اربیل', 'Erbil', 'erbil', 'اربیل', '', 5, '', '', '', 518, 960, 961, 3, 1, 1, 1, '2017-01-22 05:50:22', '2017-11-12 20:23:12', NULL),
(522, 'سریلانکا', 'Sri_Lanka', 'sri_lanka', 'سریلانکا', '', 3, '35.766012', '51.432455', '12', 2, 1263, 1286, 2, 1, 1, 69896, '2017-01-22 05:50:22', '2018-01-02 22:01:51', NULL),
(523, 'کلمبو', 'Colombo', 'colombo', 'کلمبو', '', 5, '35.766012', '51.432455', '12', 522, 1278, 1279, 3, 1, 1, 69896, '2017-01-22 05:50:22', '2018-01-15 13:47:44', NULL),
(524, 'کندی', 'Kandy', 'kandy', 'کندی', '', 5, '35.766012', '51.432455', '12', 522, 1280, 1281, 3, 1, 1, 69896, '2017-01-22 05:50:22', '2018-01-09 21:35:48', NULL),
(525, 'بنتوتا', 'Bentota', 'bentota', 'بنتوتا', '', 5, '35.766012', '51.432455', '12', 522, 1282, 1283, 3, 1, 1, 69896, '2017-01-22 05:50:22', '2018-01-15 13:47:44', NULL),
(526, 'کالوتارا', 'Kalutara', 'kalutara', 'کالوتارا', '', 5, '', '', '', 522, 1264, 1265, 3, 1, 1, 1, '2017-01-22 05:50:22', '2018-01-02 22:01:51', NULL),
(527, 'پانادورا', 'Panadura', 'panadura', 'پانادورا', '', 5, '', '', '', 522, 1266, 1267, 3, 1, 1, 1, '2017-01-22 05:50:22', '2018-01-02 22:01:51', NULL),
(528, 'ویتنام', 'Vietnam', 'vietnam', 'ویتنام', '', 3, '35.766012', '51.432455', '12', 2, 937, 950, 2, 1, 1, 1, '2017-01-22 05:50:22', '2017-11-12 20:23:12', NULL),
(529, 'شهر هوشی مین', 'Ho Chi Minh City', 'ho-chi-minh-city', 'شهر-هوشی-مین', '', 5, '35.766012', '51.432455', '12', 528, 946, 947, 3, 1, 1, 69896, '2017-01-22 05:50:22', '2017-12-28 18:19:27', NULL),
(530, 'هانوی', 'Hanoi', 'hanoi', 'هانوی', '', 5, '', '', '', 528, 938, 939, 3, 1, 1, 1, '2017-01-22 05:50:22', '2017-12-28 18:19:27', NULL),
(531, 'فان تیئت', 'Phan_Thiet', 'phan_thiet', 'فان-تیئت', '', 5, '', '', '', 528, 940, 941, 3, 1, 1, 1, '2017-01-22 05:50:22', '2017-11-12 20:23:12', NULL),
(532, 'دانانگ', 'Da_Nang', 'da_nang', 'دانانگ', '', 5, '', '', '', 528, 942, 943, 3, 1, 1, 1, '2017-01-22 05:50:22', '2017-11-12 20:23:12', NULL),
(533, 'کامبوج', 'Cambodia', 'cambodia', 'کامبوج', '', 3, '35.766012', '51.432455', '12', 2, 995, 996, 2, 1, 1, 1, '2017-01-22 05:50:22', '2017-12-10 15:50:06', NULL),
(534, 'لبنان', 'Lebanon', 'lebanon', 'لبنان', '', 3, '35.766012', '51.432455', '12', 2, 963, 970, 2, 1, 1, 1, '2017-01-22 05:50:22', '2017-11-12 20:23:12', NULL),
(535, 'بیروت', 'Beirut', 'beirut', 'بیروت', '', 5, '', '', '', 534, 964, 965, 3, 1, 1, 1, '2017-01-22 05:50:22', '2017-11-12 20:23:12', NULL),
(536, 'جونیه', 'Jounieh', 'jounieh', 'جونیه', '', 5, '', '', '', 534, 966, 967, 3, 1, 1, 1, '2017-01-22 05:50:22', '2017-11-12 20:23:12', NULL),
(537, 'ضبیه', 'Dbayeh', 'dbayeh', 'ضبیه', '', 5, '', '', '', 534, 968, 969, 3, 1, 1, 1, '2017-01-22 05:50:22', '2017-11-12 20:23:12', NULL),
(538, 'عمان', 'Oman', 'oman', 'عمان', '', 3, '35.766012', '51.432455', '12', 2, 951, 954, 2, 1, 1, 1, '2017-01-22 05:50:22', '2017-11-12 20:23:12', NULL),
(539, 'مسقط', 'Muscat', 'muscat', 'مسقط', '', 5, '', '', '', 538, 952, 953, 3, 1, 1, 1, '2017-01-22 05:50:22', '2017-11-12 20:23:12', NULL),
(540, 'قزاقستان', 'Kazakhstan', 'kazakhstan', 'قزاقستان', '', 3, '35.766012', '51.432455', '12', 2, 921, 924, 2, 1, 1, 1, '2017-01-22 05:50:22', '2017-11-06 20:23:36', NULL),
(541, 'آلماتی', 'Almaty', 'almaty', 'آلماتی', '', 5, '', '', '', 540, 922, 923, 3, 1, 1, 1, '2017-01-22 05:50:22', '2017-11-26 14:35:17', NULL),
(542, 'لائوس', 'Laos', 'laos', 'لائوس', '', 3, '35.766012', '51.432455', '12', 2, 997, 998, 2, 1, 1, 1, '2017-01-22 05:50:23', '2017-12-10 15:50:06', NULL),
(543, 'فیلیپین', 'Philippines', 'philippines', 'فیلیپین', '', 3, '12.46876014482322', '122.8271484375', '5', 2, 1021, 1028, 2, 1, 1, 69792, '2017-01-22 05:50:23', '2017-12-10 15:50:06', NULL),
(544, 'روسیه', 'Russia', 'russia', 'روسیه', '', 3, '35.766012', '51.432455', '12', 548, 1377, 1390, 2, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(545, 'مسکو', 'Moscow', 'moscow', 'مسکو', '', 5, '35.766012', '51.432455', '12', 544, 1386, 1387, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(546, 'سن پترزبورگ', 'Saint_Petersburg', 'saint_petersburg', 'سن-پترزبورگ', '', 5, '59.9405679537694', '30.340118408203125', '10', 544, 1382, 1383, 3, 1, 1, 1, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(547, 'سوچی', 'Sochi', 'sochi', 'سوچی', '', 5, '35.766012', '51.432455', '12', 544, 1388, 1389, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-14 19:47:23', NULL),
(548, 'اروپا', 'Europe', 'europe', 'اروپا', '', 2, '48.0973529', '4.1383679', '13', 1, 1288, 1565, 1, 1, 1, 1, '2017-01-22 05:50:23', '2018-01-03 20:05:10', NULL),
(549, 'فرانسه', 'France', 'france', 'فرانسه', '', 3, '46.619261036171515', '2.548828125', '5', 548, 1447, 1456, 2, 1, 1, 69896, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(550, 'پاریس', 'Paris', 'paris', 'پاریس', '', 5, '35.766012', '51.432455', '12', 549, 1450, 1451, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-15 15:54:54', NULL),
(551, 'نیس', 'Nice', 'nice', 'نیس', '', 5, '35.766012', '51.432455', '12', 549, 1452, 1453, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(552, 'موناکو', 'Monaco', 'monaco', 'موناکو', '', 7, '', '', '', 549, 1448, 1449, 3, 1, 1, 1, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(553, 'یونان', 'Greece', 'greece', 'یونان', '', 3, '39.436192999314095', '22.642822265625', '6', 548, 1507, 1518, 2, 1, 1, 69896, '2017-01-22 05:50:23', '2018-01-06 17:56:12', NULL),
(554, 'آتن', 'Athens', 'athens', 'آتن', '', 5, '37.98317483351337', '23.730125427246094', '11', 553, 1516, 1517, 3, 1, 1, 69896, '2017-01-22 05:50:23', '2018-01-15 16:27:28', NULL),
(555, 'میکونوس', 'Mykonos', 'mykonos', 'میکونوس', '', 7, '', '', '', 553, 1508, 1509, 3, 1, 1, 1, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(556, 'آتیکا', 'Attica', 'attica', 'آتیکا', '', 7, '', '', '', 553, 1510, 1511, 3, 1, 1, 1, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(557, 'تسالونیکی', 'Thessaloniki', 'thessaloniki', 'تسالونیکی', '', 5, '35.766012', '51.432455', '12', 553, 1512, 1513, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(558, 'نافپلیو', 'Nafplio', 'nafplio', 'نافپلیو', '', 5, '35.766012', '51.432455', '12', 553, 1514, 1515, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(559, 'اسپانیا', 'Spain', 'spain', 'اسپانیا', '', 3, '39.436192999314095', '-3.5595703125', '6', 548, 1541, 1560, 2, 1, 1, 69896, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(560, 'بارسلون', 'Barcelona', 'barcelona', 'بارسلون', '', 5, '35.766012', '51.432455', '12', 559, 1546, 1547, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-15 15:54:54', NULL),
(561, 'مادرید', 'Madrid', 'madrid', 'مادرید', '', 5, '40.415064437473674', '-3.706512451171875', '10', 559, 1558, 1559, 3, 1, 1, 69896, '2017-01-22 05:50:23', '2018-01-08 21:43:38', NULL),
(562, 'والنسیا', 'Valencia', 'valencia', 'والنسیا', '', 5, '35.766012', '51.432455', '12', 559, 1548, 1549, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(563, 'جزایر قناری', 'Canary_Islands', 'canary_islands', 'جزایر-قناری', '', 7, '', '', '', 559, 1542, 1543, 3, 1, 1, 1, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(564, 'ایبیزا', 'Ibiza', 'ibiza', 'ایبیزا', '', 7, '', '', '', 559, 1544, 1545, 3, 1, 1, 1, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(565, 'سویل', 'Seville', 'seville', 'سویل', '', 5, '35.766012', '51.432455', '12', 559, 1550, 1551, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(566, 'کوردوبا', 'Cordoba', 'cordoba', 'کوردوبا', '', 5, '35.766012', '51.432455', '12', 559, 1552, 1553, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(567, 'گرانادا', 'Granada', 'granada', 'گرانادا', '', 5, '35.766012', '51.432455', '12', 559, 1554, 1555, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(568, 'تنریف', 'Tenerife', 'tenerife', 'تنریف', '', 5, '35.766012', '51.432455', '12', 559, 1556, 1557, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(569, 'پرتغال', 'Portugal', 'portugal', 'پرتغال', '', 3, '39.65645604812829', '-8.4375', '6', 548, 1365, 1372, 2, 1, 1, 69896, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(570, 'لیسبون', 'Lisbon', 'lisbon', 'لیسبون', '', 5, '35.766012', '51.432455', '12', 569, 1368, 1369, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(571, 'پورتو', 'Porto', 'porto', 'پورتو', '', 5, '35.766012', '51.432455', '12', 569, 1370, 1371, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(572, 'ایتالیا', 'Italy', 'italy', 'ایتالیا', '', 3, '42.90816007196054', '12.48046875', '5', 548, 1477, 1492, 2, 1, 1, 69896, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(573, 'رم', 'Rome', 'rome', 'رم', '', 5, '35.766012', '51.432455', '12', 572, 1480, 1481, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-15 15:54:54', NULL),
(574, 'میلان', 'Milan', 'milan', 'میلان', '', 5, '35.766012', '51.432455', '12', 572, 1482, 1483, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(575, 'ونیز', 'Venice', 'venice', 'ونیز', '', 5, '35.766012', '51.432455', '12', 572, 1484, 1485, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-15 15:54:34', NULL),
(576, 'فلورانس', 'Florence', 'florence', 'فلورانس', '', 5, '35.766012', '51.432455', '12', 572, 1486, 1487, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-15 15:54:34', NULL),
(577, 'پادوا', 'Padua', 'padua', 'پادوا', '', 5, '35.766012', '51.432455', '12', 572, 1488, 1489, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(578, 'بولونیا', 'Bologna', 'bologna', 'بولونیا', '', 5, '35.766012', '51.432455', '12', 572, 1490, 1491, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(579, 'آلمان', 'Germany', 'germany', 'آلمان', '', 3, '35.766012', '51.432455', '12', 548, 1403, 1420, 2, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(580, 'مونیخ', 'Munich', 'munich', 'مونیخ', '', 5, '35.766012', '51.432455', '12', 579, 1414, 1415, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-07 19:50:26', NULL),
(581, 'کلن', 'Cologne', 'cologne', 'کلن', '', 5, '35.766012', '51.432455', '12', 579, 1412, 1413, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(582, 'هامبورگ', 'Hamburg', 'hamburg', 'هامبورگ', '', 5, '53.550099314556185', '9.98382568359375', '7', 579, 1416, 1417, 3, 1, 1, 69896, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(583, 'برلین', 'Berlin', 'berlin', 'برلین', '', 5, '35.766012', '51.432455', '12', 579, 1410, 1411, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-03 19:49:50', NULL),
(584, 'دوسلدورف', 'Dusseldorf', 'dusseldorf', 'دوسلدورف', '', 5, '35.766012', '51.432455', '12', 579, 1408, 1409, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(585, 'فرانکفورت', 'Frankfurt', 'frankfurt', 'فرانکفورت', '', 5, '35.766012', '51.432455', '12', 579, 1406, 1407, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(586, 'هانوفر', 'Hanover', 'hanover', 'هانوفر', '', 5, '35.766012', '51.432455', '12', 579, 1404, 1405, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(587, 'هلند', 'Netherlands', 'netherlands', 'هلند', '', 3, '52.16719363541221', '5.394287109375', '7', 548, 1497, 1506, 2, 1, 1, 69896, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(588, 'آمستردام', 'Amsterdam', 'amsterdam', 'آمستردام', '', 5, '35.766012', '51.432455', '12', 587, 1498, 1499, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-10 14:27:54', NULL),
(589, 'اتریش', 'Austria', 'austria', 'اتریش', '', 3, '47.62097541515849', '14.26025390625', '6', 548, 1443, 1446, 2, 1, 1, 69896, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(590, 'وین', 'Vienna', 'vienna', 'وین', '', 5, '35.766012', '51.432455', '12', 589, 1444, 1445, 3, 1, 1, 69896, '2017-01-22 05:50:23', '2018-01-15 15:54:54', NULL),
(591, 'انگلستان', 'England', 'england', 'انگلستان', '', 3, '52.456009392640766', '-1.64794921875', '5', 548, 1339, 1342, 2, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(592, 'لندن', 'London', 'london', 'لندن', '', 5, '35.766012', '51.432455', '12', 591, 1340, 1341, 3, 1, 1, 69792, '2017-01-22 05:50:23', '2018-01-08 19:26:37', NULL),
(593, 'مجارستان', 'Hungary', 'hungary', 'مجارستان', '', 3, '46.97275640318636', '19.3798828125', '7', 548, 1493, 1496, 2, 1, 1, 69896, '2017-01-22 05:50:23', '2018-01-02 22:01:51', NULL),
(594, 'بوداپست', 'Budapest', 'budapest', 'بوداپست', '', 5, '35.766012', '51.432455', '12', 593, 1494, 1495, 3, 1, 1, 69896, '2017-01-22 05:50:24', '2018-01-14 18:29:17', NULL),
(595, 'کرواسی', 'Croatia', 'croatia', 'کرواسی', '', 3, '35.766012', '51.432455', '12', 548, 1391, 1402, 2, 1, 1, 69792, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL),
(596, 'زاگرب', 'Zagreb', 'zagreb', 'زاگرب', '', 5, '35.766012', '51.432455', '12', 595, 1400, 1401, 3, 1, 1, 69792, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL),
(597, 'پاداسترانا', 'Podstrana', 'podstrana', 'پاداسترانا', '', 7, '', '', '', 595, 1392, 1393, 3, 1, 1, 1, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL),
(598, 'دوبروونیک', 'Dubrovnik', 'dubrovnik', 'دوبروونیک', '', 7, '', '', '', 595, 1394, 1395, 3, 1, 1, 1, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL),
(599, 'اسپلیت', 'Split', 'split', 'اسپلیت', '', 7, '', '', '', 595, 1396, 1397, 3, 1, 1, 1, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL),
(600, 'هوار', 'Hvar', 'hvar', 'هوار', '', 7, '', '', '', 595, 1398, 1399, 3, 1, 1, 1, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL),
(601, 'صربستان', 'Serbia', 'serbia', 'صربستان', '', 3, '44.08758502824516', '20.80810546875', '6', 548, 1439, 1442, 2, 1, 1, 69896, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL),
(602, 'بلگراد', 'Belgrade', 'belgrade', 'بلگراد', '', 5, '35.766012', '51.432455', '12', 601, 1440, 1441, 3, 1, 1, 69792, '2017-01-22 05:50:24', '2018-01-15 15:10:37', NULL),
(603, 'بلاروس', 'Belarus', 'belarus', 'بلاروس', '', 3, '35.766012', '51.432455', '12', 548, 1421, 1424, 2, 1, 1, 69792, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL),
(604, 'مینسک', 'Minsk', 'minsk', 'مینسک', '', 5, '53.90332682647335', '27.560062408447266', '10', 603, 1422, 1423, 3, 1, 1, 69896, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL),
(605, 'رومانی', 'Romania', 'romania', 'رومانی', '', 3, '35.766012', '51.432455', '12', 548, 1425, 1428, 2, 1, 1, 69792, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL),
(606, 'بخارست', 'Bucharest', 'bucharest', 'بخارست', '', 5, '35.766012', '51.432455', '12', 605, 1426, 1427, 3, 1, 1, 69792, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL),
(607, 'جمهوری چک', 'Czech_Republic', 'czech_republic', 'جمهوری-چک', '', 3, '35.766012', '51.432455', '12', 548, 1373, 1376, 2, 1, 1, 69792, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL),
(608, 'پراگ', 'Prague', 'prague', 'پراگ', '', 5, '35.766012', '51.432455', '12', 607, 1374, 1375, 3, 1, 1, 69792, '2017-01-22 05:50:24', '2018-01-03 19:49:50', NULL),
(609, 'اوکراین', 'Ukraine', 'ukraine', 'اوکراین', '', 3, '35.766012', '51.432455', '12', 548, 1429, 1434, 2, 1, 1, 69792, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL),
(610, 'کی یف', 'Kiev', 'kiev', 'کی-یف', '', 5, '35.766012', '51.432455', '12', 609, 1432, 1433, 3, 1, 1, 69792, '2017-01-22 05:50:24', '2018-01-10 19:01:47', NULL),
(611, 'اودسا', 'Odessa', 'odessa', 'اودسا', '', 7, '', '', '', 609, 1430, 1431, 3, 1, 1, 1, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL),
(612, 'مونته نگرو', 'Montenegro', 'montenegro', 'مونته-نگرو', '', 3, '35.766012', '51.432455', '12', 548, 1435, 1438, 2, 1, 1, 69792, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL),
(613, 'بودوا', 'Budva', 'budva', 'بودوا', '', 5, '35.766012', '51.432455', '12', 612, 1436, 1437, 3, 1, 1, 69792, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL),
(614, 'سوئیس', 'Switzerland', 'switzerland', 'سوئیس', '', 3, '46.769968433569815', '8.009033203125', '7', 548, 1457, 1476, 2, 1, 1, 69896, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL),
(615, 'زوریخ', 'Zurich', 'zurich', 'زوریخ', '', 5, '35.766012', '51.432455', '12', 614, 1466, 1467, 3, 1, 1, 69896, '2017-01-22 05:50:24', '2018-01-15 15:26:11', NULL),
(616, 'ژنو', 'Geneva', 'geneva', 'ژنو', '', 5, '35.766012', '51.432455', '12', 614, 1470, 1471, 3, 1, 1, 69792, '2017-01-22 05:50:24', '2018-01-09 19:50:55', NULL),
(617, 'اینترلاکن', 'Interlaken', 'interlaken', 'اینترلاکن', '', 7, '', '', '', 614, 1458, 1459, 3, 1, 1, 1, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL),
(618, 'بلژیک', 'Belgium', 'belgium', 'بلژیک', '', 3, '35.766012', '51.432455', '12', 548, 1343, 1354, 2, 1, 1, 69896, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL),
(619, 'بروکسل', 'Brussels', 'brussels', 'بروکسل', '', 5, '35.766012', '51.432455', '12', 618, 1344, 1345, 3, 1, 1, 69896, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL),
(620, 'آذربایجان', 'Azerbaijan', 'azerbaijan', 'آذربایجان', '', 3, '35.766012', '51.432455', '12', 2, 901, 914, 2, 1, 1, 1, '2017-01-22 05:50:24', '2017-11-06 20:23:36', NULL),
(621, 'باکو', 'Baku', 'baku', 'باکو', '', 5, '40.384212768155045', '49.78474840000001', '11', 620, 912, 913, 3, 1, 1, 69756, '2017-01-22 05:50:24', '2018-01-15 15:24:49', NULL),
(622, 'قوبا', 'Quba', 'quba', 'قوبا', '', 5, '41.3629894', '48.4919571', '12', 620, 902, 903, 3, 1, 1, 1, '2017-01-22 05:50:24', '2017-11-06 20:23:36', NULL),
(623, 'گنجه', 'Ganja', 'ganja', 'گنجه', '', 5, '40.6943215', '46.2984663', '12', 620, 904, 905, 3, 1, 1, 1, '2017-01-22 05:50:24', '2017-11-06 20:23:36', NULL),
(624, 'لریک', 'Lerik', 'lerik', 'لریک', '', 6, '38.7754309', '48.4049677', '12', 625, 907, 908, 4, 1, 1, 1, '2017-01-22 05:50:24', '2017-11-06 20:23:36', NULL),
(625, 'لنکران', 'Lankaran', 'lankaran', 'لنکران', '', 5, '38.7648545', '48.8099702', '12', 620, 906, 909, 3, 1, 1, 1, '2017-01-22 05:50:24', '2017-11-06 20:23:36', NULL),
(626, 'قبرس', 'Cyprus', 'cyprus', 'قبرس', '', 3, '35.02099970111467', '33.24462890625', '9', 548, 1519, 1540, 2, 1, 1, 69896, '2017-01-22 05:50:24', '2018-01-15 16:10:38', NULL),
(627, 'قبرس شمالی', 'North_Cyprus', 'north_cyprus', 'قبرس-شمالی', '', 3, '35.766012', '51.432455', '12', 626, 1520, 1527, 3, 1, 1, 69792, '2017-01-22 05:50:24', '2018-01-10 14:07:09', NULL),
(628, 'قبرس جنوبی', 'South_Cyprus', 'south_cyprus', 'قبرس-جنوبی', '', 3, '35.766012', '51.432455', '12', 626, 1528, 1539, 3, 1, 1, 69896, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL),
(629, 'لیماسول', 'Limassol', 'limassol', 'لیماسول', '', 5, '35.766012', '51.432455', '12', 628, 1533, 1534, 4, 1, 1, 69792, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL),
(630, 'لارناکا', 'Larnaca', 'larnaca', 'لارناکا', '', 5, '35.766012', '51.432455', '12', 628, 1535, 1536, 4, 1, 1, 69792, '2017-01-22 05:50:24', '2018-01-03 21:58:32', NULL),
(631, 'آییا ناپا', 'Ayia_Napa', 'ayia_napa', 'آیا-ناپا', '', 7, '35.766012', '51.432455', '12', 628, 1531, 1532, 4, 1, 1, 69896, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL),
(632, 'پافوس', 'Paphos', 'paphos', 'پافوس', '', 5, '35.766012', '51.432455', '12', 628, 1537, 1538, 4, 1, 1, 69792, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL);
INSERT INTO `locations` (`id`, `title_fa`, `title_en`, `slug`, `slug_fa`, `description`, `type`, `latitude`, `longitude`, `map_zoom`, `parent_id`, `lft`, `rgt`, `depth`, `state`, `created_by`, `updated_by`, `created_at`, `updated_at`, `deleted_at`) VALUES
(633, 'پروتاراس', 'Protaras', 'protaras', 'پروتاراس', '', 7, '', '', '', 628, 1529, 1530, 4, 1, 1, 1, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL),
(634, 'هند', 'India', 'india', 'هند', '', 3, '20.8911524', '73.7340252', '12', 2, 1235, 1256, 2, 1, 1, 69896, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL),
(635, 'دهلی', 'Delhi', 'delhi', 'دهلی', '', 5, '35.766012', '51.432455', '12', 634, 1240, 1241, 3, 1, 1, 69756, '2017-01-22 05:50:24', '2018-01-15 14:59:50', NULL),
(636, 'آگرا', 'Agra', 'agra', 'آگرا', '', 5, '35.766012', '51.432455', '12', 634, 1242, 1243, 3, 1, 1, 69756, '2017-01-22 05:50:24', '2018-01-15 14:59:50', NULL),
(637, 'جیپور', 'Jaipore', 'jaipore', 'جیپور', '', 5, '35.766012', '51.432455', '12', 634, 1236, 1237, 3, 1, 1, 1, '2017-01-22 05:50:24', '2018-01-15 14:59:50', NULL),
(638, 'بمبئی', 'Mumbai', 'mumbai', 'بمبئی', '', 5, '35.766012', '51.432455', '12', 634, 1238, 1239, 3, 1, 1, 1, '2017-01-22 05:50:24', '2018-01-13 19:51:13', NULL),
(639, 'گوا', 'Goa', 'goa', 'گوا', '', 5, '35.766012', '51.432455', '12', 634, 1248, 1249, 3, 1, 1, 69896, '2017-01-22 05:50:24', '2018-01-15 14:24:19', NULL),
(640, 'کرالا', 'Kerala', 'kerala', 'کرالا', '', 4, '35.766012', '51.432455', '12', 634, 1244, 1247, 3, 1, 1, 69756, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL),
(641, 'ارمنستان', 'Armenia', 'armenia', 'ارمنستان', '', 3, '35.766012', '51.432455', '12', 2, 915, 920, 2, 1, 1, 1, '2017-01-22 05:50:24', '2017-12-16 16:03:34', NULL),
(642, 'ایروان', 'Yerevan', 'yerevan', 'ایروان', '', 5, '35.766012', '51.432455', '12', 641, 918, 919, 3, 1, 1, 69896, '2017-01-22 05:50:24', '2018-01-15 17:00:02', NULL),
(643, 'تساغکادزور', 'Tsaghkadzor', 'tsaghkadzor', 'تساغکادزور', '', 5, '', '', '', 641, 916, 917, 3, 1, 1, 1, '2017-01-22 05:50:24', '2017-11-06 20:23:36', NULL),
(644, 'گرجستان', 'Georgia', 'georgia', 'گرجستان', '', 3, '35.766012', '51.432455', '12', 2, 1193, 1212, 2, 1, 1, 69896, '2017-01-22 05:50:24', '2018-01-02 22:01:51', NULL),
(645, 'تفلیس', 'Tbilisi', 'tbilisi', 'تفلیس', '', 5, '35.766012', '51.432455', '12', 644, 1204, 1205, 3, 1, 1, 1, '2017-01-22 05:50:24', '2018-01-15 16:46:49', NULL),
(646, 'باتومی', 'Batomi', 'batomi', 'باتومی', '', 5, '35.766012', '51.432455', '12', 644, 1206, 1207, 3, 1, 1, 1, '2017-01-22 05:50:25', '2018-01-02 22:01:51', NULL),
(647, 'کبولتی', 'Kobuleti', 'kobuleti', 'کبولتی', '', 5, '', '', '', 644, 1194, 1195, 3, 1, 1, 1, '2017-01-22 05:50:25', '2018-01-02 22:01:51', NULL),
(648, 'برجومی', 'Borjomi', 'borjomi', 'برجومی', '', 5, '', '', '', 644, 1196, 1197, 3, 1, 1, 1, '2017-01-22 05:50:25', '2018-01-02 22:01:51', NULL),
(649, 'اورکی', 'Ureki', 'ureki', 'اورکی', '', 5, '', '', '', 644, 1198, 1199, 3, 1, 1, 1, '2017-01-22 05:50:25', '2018-01-02 22:01:51', NULL),
(650, 'باکوریانی', 'Bakuriani', 'bakuriani', 'باکوریانی', '', 5, '', '', '', 644, 1200, 1201, 3, 1, 1, 1, '2017-01-22 05:50:25', '2018-01-04 15:03:48', NULL),
(651, 'بلغارستان', 'Bulgaria', 'bulgaria', 'بلغارستان', '', 1, '35.766012', '51.432455', '12', 548, 1355, 1364, 2, 1, 1, 69896, '2017-01-22 05:50:25', '2018-01-02 22:01:51', NULL),
(652, 'وارنا', 'Varna', 'varna', 'وارنا', '', 5, '35.766012', '51.432455', '12', 651, 1356, 1357, 3, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-02 22:01:51', NULL),
(653, 'صوفیا', 'Sofia', 'sofia', 'صوفیا', '', 5, '35.766012', '51.432455', '12', 651, 1358, 1359, 3, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-02 22:01:51', NULL),
(654, 'سانی بیچ', 'Sunny Beach', 'sunny-beach', 'سانی-بیچ', '', 7, '35.766012', '51.432455', '12', 651, 1362, 1363, 3, 1, 1, 69896, '2017-01-22 05:50:25', '2018-01-02 22:01:51', NULL),
(655, 'بنسکا', 'Bansko', 'bansko', 'بنسکا', '', 5, '35.766012', '51.432455', '12', 651, 1360, 1361, 3, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-02 22:01:51', NULL),
(657, 'استرالیا', 'Australia', 'australia', 'استرالیا', '', 3, '-25.16517336866393', '134.6484375', '4', 706, 1575, 1582, 2, 1, 1, 69896, '2017-01-22 05:50:25', '2018-01-03 20:05:10', NULL),
(658, 'سیدنی', 'Sydney', 'sydney', 'سیدنی', '', 5, '35.766012', '51.432455', '12', 657, 1580, 1581, 3, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-03 20:05:10', NULL),
(659, 'ملبورن', 'Melbourne', 'melbourne', 'ملبورن', '', 5, '35.766012', '51.432455', '12', 657, 1576, 1577, 3, 1, 1, 1, '2017-01-22 05:50:25', '2018-01-03 20:05:10', NULL),
(660, 'گلد کوست', 'Gold_Coast', 'gold_coast', 'گلد-کوست', '', 5, '35.766012', '51.432455', '12', 657, 1578, 1579, 3, 1, 1, 1, '2017-01-22 05:50:25', '2018-01-03 20:05:10', NULL),
(661, 'آفریقای جنوبی', 'South_Africa', 'south_africa', 'آفریقای-جنوبی', '', 3, '35.766012', '51.432455', '12', 667, 1731, 1744, 2, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-24 07:10:25', NULL),
(662, 'ژوهانسبورگ', 'Johannesburg', 'johannesburg', 'ژوهانسبورگ', '', 5, '35.766012', '51.432455', '12', 661, 1736, 1737, 3, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-24 07:10:25', NULL),
(663, 'کیپ تاون', 'Cape_Town', 'cape_town', 'کیپ-تاون', '', 5, '35.766012', '51.432455', '12', 661, 1738, 1739, 3, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-24 07:10:25', NULL),
(664, 'سان سیتی', 'Sun City', 'sun-city', 'سان-سیتی', '', 5, '35.766012', '51.432455000000004', '12', 661, 1742, 1743, 3, 1, 1, 69896, '2017-01-22 05:50:25', '2018-01-24 07:10:25', NULL),
(665, 'پارک جنگلی', 'Pilanesberg_National_Park', 'pilanesberg_national_park', 'پارک-جنگلی', '', 7, '', '', '', 661, 1732, 1733, 3, 1, 1, 1, '2017-01-22 05:50:25', '2018-01-24 07:10:25', NULL),
(666, 'دوربان', 'Durban', 'durban', 'دوربان', '', 5, '35.766012', '51.432455', '12', 661, 1740, 1741, 3, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-24 07:10:25', NULL),
(667, 'آفریقا', 'Africa', 'africa', 'آفریقا', '', 2, '-3.6955433', '-20.4753924', '13', 1, 1698, 1779, 1, 1, 1, 69896, '2017-01-22 05:50:25', '2018-01-24 07:10:25', NULL),
(668, 'جزیره موریس', 'Mauritius', 'mauritius', 'جزیره-موریس', '', 3, '35.766012', '51.432455', '12', 667, 1745, 1746, 2, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-24 07:10:25', NULL),
(669, 'جزیره سیشل', 'Seychelles', 'seychelles', 'جزیره-سیشل', '', 3, '35.766012', '51.432455', '12', 667, 1747, 1748, 2, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-24 07:10:25', NULL),
(670, 'کنیا', 'Kenya', 'kenya', 'کنیا', '', 3, '35.766012', '51.432455', '12', 667, 1749, 1764, 2, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-24 07:10:25', NULL),
(671, 'نایروبی', 'Nairobi', 'nairobi', 'نایروبی', '', 5, '35.766012', '51.432455', '12', 670, 1760, 1761, 3, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-24 07:10:25', NULL),
(672, 'مومباسا', 'Mombasa', 'mombasa', 'مومباسا', '', 5, '35.766012', '51.432455', '12', 670, 1762, 1763, 3, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-24 07:10:25', NULL),
(673, 'پارک جنگلی آمبوسلی', 'Amboseli_National_Park', 'amboseli_national_park', 'پارک-جنگلی-آمبوسلی', '', 7, '', '', '', 670, 1750, 1751, 3, 1, 1, 1, '2017-01-22 05:50:25', '2018-01-24 07:10:25', NULL),
(674, 'غرب پارک جنگلی ساو', 'Tsavo_National_Park_West', 'tsavo_national_park_west', 'غرب-پارک-جنگلی-ساو', '', 7, '', '', '', 670, 1752, 1753, 3, 1, 1, 1, '2017-01-22 05:50:25', '2018-01-24 07:10:25', NULL),
(675, 'پارک جنگلی لیک ناکورو', 'Lake_Nakuru_National_Park', 'lake_nakuru_national_park', 'پارک-جنگلی-لیک-ناکورو', '', 7, '', '', '', 670, 1754, 1755, 3, 1, 1, 1, '2017-01-22 05:50:25', '2018-01-24 07:10:25', NULL),
(676, 'دیانی بیچ', 'Diani_Beach', 'diani_beach', 'دیانی-بیچ', '', 7, '', '', '', 670, 1756, 1757, 3, 1, 1, 1, '2017-01-22 05:50:25', '2018-01-24 07:10:25', NULL),
(677, 'تانزانیا', 'Tanzania', 'tanzania', 'تانزانیا', '', 3, '35.766012', '51.432455', '12', 667, 1765, 1766, 2, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-24 07:10:25', NULL),
(678, 'مراکش', 'Morocco', 'morocco', 'مراکش', '', 3, '31.784216884487385', '-6.43798828125', '5', 667, 1699, 1716, 2, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-24 07:10:25', NULL),
(679, 'شهر مراکش', 'Marrakesh', 'marrakesh', 'شهر-مراکش', '', 5, '31.62532121329918', '-7.980194091796875', '11', 678, 1706, 1707, 3, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-24 07:10:25', NULL),
(680, 'کازابلانکا', 'Casablanca', 'casablanca', 'کازابلانکا', '', 5, '35.766012', '51.432455', '12', 678, 1704, 1705, 3, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-24 07:10:25', NULL),
(681, 'تونس', 'Tunisia', 'tunisia', 'تونس', '', 3, '35.766012', '51.432455', '12', 667, 1767, 1772, 2, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-24 07:10:25', NULL),
(682, 'ماداگاسکار', 'Madagascar', 'madagascar', 'ماداگاسکار', '', 3, '35.766012', '51.432455', '12', 667, 1773, 1778, 2, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-24 07:10:25', NULL),
(683, 'آنتاناناریوو', 'Antananarivo', 'antananarivo', 'آنتاناناریوو', '', 7, '', '', '', 682, 1774, 1775, 3, 1, 1, 1, '2017-01-22 05:50:25', '2018-01-24 07:10:25', NULL),
(684, 'آنداسیبه', 'Andasibe', 'andasibe', 'آنداسیبه', '', 7, '', '', '', 682, 1776, 1777, 3, 1, 1, 1, '2017-01-22 05:50:25', '2018-01-24 07:10:25', NULL),
(685, 'برزیل', 'Brazil', 'brazil', 'برزیل', '', 3, '35.766012', '51.432455', '12', 705, 1588, 1603, 3, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-24 07:32:10', NULL),
(686, 'سائوپائولو', 'Sao_Paulo', 'sao_paulo', 'سائوپائولو', '', 5, '35.766012', '51.432455', '12', 685, 1589, 1590, 4, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-24 07:32:10', NULL),
(687, 'ایگواسو', 'Iguazu', 'iguazu', 'ایگواسو', '', 5, '35.766012', '51.432455', '12', 697, 1605, 1606, 4, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-24 07:32:10', NULL),
(688, 'ریودوژانیرو', 'Rio de Janeiro', 'rio_de_janeiro', 'ریودوژانیرو', '', 5, '-22.909827416230744', '-43.19000244140625', '10', 685, 1601, 1602, 4, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-24 07:32:10', NULL),
(690, 'کانادا', 'Canada', 'canada', 'کانادا', '', 3, '35.766012', '51.432455', '12', 704, 1664, 1679, 3, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-24 07:32:10', NULL),
(691, 'تورنتو', 'Toronto', 'toronto', 'تورنتو', '', 5, '35.766012', '51.432455', '12', 690, 1667, 1668, 4, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-24 07:32:10', NULL),
(692, 'آبشار نیاگارا', 'Niagara Falls', 'niagara-falls', 'آبشار-نیاگارا', '', 7, '35.766012', '51.432455', '12', 690, 1675, 1676, 4, 1, 1, 69896, '2017-01-22 05:50:25', '2018-01-24 07:32:10', NULL),
(693, 'ونکوور', 'Vancouver', 'vancouver', 'ونکوور', '', 5, '35.766012', '51.432455', '12', 690, 1669, 1670, 4, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-24 07:32:10', NULL),
(694, 'کبک', 'Quebec', 'quebec', 'کبک', '', 4, '35.766012', '51.432455', '12', 690, 1671, 1672, 4, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-24 07:32:10', NULL),
(695, 'مونترال', 'Montreal', 'montreal', 'مونترال', '', 5, '35.766012', '51.432455', '12', 690, 1677, 1678, 4, 1, 1, 69896, '2017-01-22 05:50:25', '2018-01-24 07:32:10', NULL),
(696, 'وایت هورس', 'Whitehorse', 'whitehorse', 'وایت-هورس', '', 5, '35.766012', '51.432455', '12', 690, 1673, 1674, 4, 1, 1, 69792, '2017-01-22 05:50:25', '2018-01-24 07:32:10', NULL),
(697, 'آرژانتین', 'Argentina', 'argentina', 'آرژانتین', '', 3, '35.766012', '51.432455', '12', 705, 1604, 1607, 3, 1, 1, 69792, '2017-01-22 05:50:26', '2018-01-24 07:32:10', NULL),
(698, 'کوبا', 'Cuba', 'cuba', 'کوبا', '', 3, '35.766012', '51.432455', '12', 704, 1656, 1663, 3, 1, 1, 69792, '2017-01-22 05:50:26', '2018-01-24 07:32:10', NULL),
(699, 'هاوانا', 'Havana', 'havana', 'هاوانا', '', 5, '35.766012', '51.432455', '12', 698, 1661, 1662, 4, 1, 1, 69792, '2017-01-22 05:50:26', '2018-01-24 07:32:10', NULL),
(700, 'وارادرو', 'Varadero', 'varadero', 'وارادرو', '', 7, '', '', '', 698, 1657, 1658, 4, 1, 1, 1, '2017-01-22 05:50:26', '2018-01-24 07:32:10', NULL),
(701, 'ترینیداد', 'Trinidad', 'trinidad', 'ترینیداد', '', 7, '', '', '', 698, 1659, 1660, 4, 1, 1, 1, '2017-01-22 05:50:26', '2018-01-24 07:32:10', NULL),
(702, 'مکزیک', 'Mexico', 'mexico', 'مکزیک', '', 3, '35.766012', '51.432455', '12', 704, 1646, 1655, 3, 1, 1, 69792, '2017-01-22 05:50:26', '2018-01-24 07:32:10', NULL),
(703, 'کنکون', 'Cancun', 'cancun', 'کنکون', '', 5, '35.766012', '51.432455', '12', 702, 1653, 1654, 4, 1, 1, 69792, '2017-01-22 05:50:26', '2018-01-24 07:32:10', NULL),
(704, 'آمریکای شمالی', 'North America', 'north-america', 'آمریکای-شمالی', '', 2, '2.240414', '162.9225206', '13', 745, 1625, 1692, 2, 1, 1, 69792, '2017-01-22 05:43:27', '2018-01-24 07:32:10', NULL),
(705, 'آمریکای جنوبی', 'South America', 'south-america', 'آمریکای-جنوبی', '', 2, '-15.2284447', '-99.3783876', '13', 745, 1587, 1624, 2, 1, 1, 69792, '2017-01-22 05:46:10', '2018-01-24 07:32:10', NULL),
(706, 'اقیانوسیه', 'Oceania', 'oceania', 'اقیانوسیه', '', 2, '-13.4552269', '134.3101579', '13', 1, 1566, 1585, 1, 1, 1, 1, '2017-01-22 05:56:40', '2018-01-03 20:05:10', NULL),
(707, 'استان کرابی', 'Krabi Province', 'krabi-province', 'استان-کرابی', '', 4, '8.041762', '98.4321098', '10', 476, 1048, 1053, 3, 1, 1, 69756, '2017-01-22 12:00:52', '2017-12-10 15:50:06', NULL),
(708, 'صباح', 'Sabah', 'sabah', 'صباح', '', 5, '5.7385182', '116.180543', '8', 484, 1220, 1225, 3, 1, 1, 1, '2017-01-22 12:34:58', '2018-01-02 22:01:51', NULL),
(709, 'کلاردشت', 'Kelardasht', 'kelardasht', 'کلاردشت', NULL, 5, '36.49968', '51.157121', '16', 325, 315, 316, 4, 1, 1, 1, '2017-01-28 10:26:15', '2017-11-06 20:17:26', NULL),
(710, 'یاسوج', 'Yasuj', 'yasuj', 'یاسوج', NULL, 5, '30.6866956', '51.4964333', '12', 274, 649, 650, 4, 1, 1, 1, '2017-01-28 10:29:03', '2017-11-06 20:23:36', NULL),
(711, 'شارجه', 'Sharjah', 'sharjah', 'شارجه', '', 5, '25.3172222', '55.37080900000001', '12', 473, 894, 895, 3, 1, 1, 1, '2017-04-22 18:05:09', '2017-11-06 20:23:36', NULL),
(712, 'دالامان', 'Dalaman', 'dalaman', 'دالامان', '', 5, '36.766942102345155', '28.79962921142578', '13', 442, 1094, 1095, 3, 1, 1, 1, '2017-04-22 18:30:56', '2017-12-10 15:50:06', NULL),
(713, 'غازی عینتاپ', 'Gaziantep', 'gaziantep', 'غازی-عینتاپ', '', 5, '37.06476617305352', '37.37926483154297', '12', 442, 1132, 1133, 3, 1, 1, 69792, '2017-04-22 18:54:33', '2017-12-10 15:50:06', NULL),
(714, 'دنیزلی', 'Denizli', 'denizli', 'دنیزلی', '', 5, '37.78129802378191', '29.094886779785156', '12', 442, 1096, 1097, 3, 1, 1, 1, '2017-04-22 19:01:48', '2017-12-10 15:50:06', NULL),
(715, 'نخجوان', 'Nakhchivan', 'nakhchivan', 'نخجوان', '', 5, '39.193948213963665', '45.40924072265625', '10', 620, 910, 911, 3, 1, 1, 1, '2017-04-30 19:38:40', '2017-11-06 20:23:36', NULL),
(716, 'نیکوزیا', 'Nicosia', 'nicosia', 'نیکوزیا', '', 5, '35.185425769910104', '33.38264465332031', '12', 627, 1521, 1522, 4, 1, 1, 1, '2017-04-30 20:25:04', '2018-01-02 22:01:51', NULL),
(717, 'کوچی', 'Kochi', 'kochi', 'کوچی', '', 5, '9.929759366009208', '76.26502990722656', '11', 640, 1245, 1246, 4, 1, 1, 1, '2017-05-13 19:06:21', '2018-01-02 22:01:51', NULL),
(718, 'لوزان', 'Lausanne', 'lausanne', 'لوزان', '', 5, '46.5532928', '6.582455200000027', '12', 614, 1464, 1465, 3, 1, 1, 69896, '2017-05-21 15:53:28', '2018-01-15 15:26:11', NULL),
(719, 'هاکونه', 'Hakone', 'hakone', 'هاکونه', '', 5, '35.766012', '51.43805694475304', '12', 513, 988, 989, 3, 1, 1, 1, '2017-05-25 16:59:56', '2017-11-12 20:23:12', NULL),
(720, 'برن', 'Bern', 'bern', 'برن', '', 5, '35.766012', '51.43805694475304', '12', 614, 1460, 1461, 3, 1, 1, 1, '2017-05-25 17:03:17', '2018-01-02 22:01:51', NULL),
(721, 'لوسرن', 'Lucerne', 'lucerne', 'لوسرن', '', 5, '35.766012', '51.43805694475304', '12', 614, 1462, 1463, 3, 1, 1, 1, '2017-05-25 17:04:47', '2018-01-02 22:01:51', NULL),
(722, 'سوئد', 'Sweden', 'sweden', 'سوئد', '', 3, '35.766012', '51.43805694475304', '12', 548, 1289, 1292, 2, 1, 1, 1, '2017-05-25 17:06:38', '2018-01-02 22:01:51', NULL),
(723, 'استکهلم', 'Stockholm', 'stockholm', 'استکهلم', '', 5, '35.766012', '51.43805694475304', '12', 722, 1290, 1291, 3, 1, 1, 1, '2017-05-25 17:08:27', '2018-01-02 22:01:51', NULL),
(724, 'فاماگوستا', 'Famagusta', 'famagusta', 'فاماگوستا', '', 5, '35.766012', '51.43805694475304', '12', 627, 1523, 1524, 4, 1, 1, 1, '2017-05-25 17:09:44', '2018-01-02 22:01:51', NULL),
(725, 'گودائوری', 'Gudauri', 'gudauri', 'گودائوری', '', 5, '35.766012', '51.43805694475304', '12', 644, 1202, 1203, 3, 1, 1, 1, '2017-05-25 17:10:48', '2018-01-02 22:01:51', NULL),
(726, 'سندتون', 'Sandton', 'sandton', 'سندتون', '', 5, '35.766012', '51.43805694475304', '12', 661, 1734, 1735, 3, 1, 1, 1, '2017-05-25 17:12:00', '2018-01-24 07:10:25', NULL),
(727, 'نایواشا', 'Naivasha', 'naivasha', 'نایواشا', '', 5, '35.766012', '51.43805694475304', '12', 670, 1758, 1759, 3, 1, 1, 1, '2017-05-25 17:12:57', '2018-01-24 07:10:25', NULL),
(728, 'آگادیر', 'Agadir', 'agadir', 'آگادیر', '', 5, '30.431505741151746', '-9.597244262695312', '11', 678, 1714, 1715, 3, 1, 1, 69896, '2017-05-25 17:14:14', '2018-01-24 07:10:25', NULL),
(729, 'طنجه', 'Tangier', 'tangier', 'طنجه', '', 5, '35.766012', '51.43805694475304', '12', 678, 1700, 1701, 3, 1, 1, 1, '2017-05-25 17:15:14', '2018-01-24 07:10:25', NULL),
(730, 'فاس', 'Fes', 'fes', 'فاس', '', 5, '35.766012', '51.43805694475304', '12', 678, 1702, 1703, 3, 1, 1, 1, '2017-05-25 17:15:54', '2018-01-24 07:10:25', NULL),
(731, 'حمامات', 'Hammamet', 'hammamet', 'حمامات', '', 5, '35.766012', '51.43805694475304', '12', 681, 1768, 1769, 3, 1, 1, 1, '2017-05-25 17:16:48', '2018-01-24 07:10:25', NULL),
(732, 'سوسه', 'Sousse', 'sousse', 'سوسه', '', 5, '35.766012', '51.43805694475304', '12', 681, 1770, 1771, 3, 1, 1, 1, '2017-05-25 17:18:52', '2018-01-24 07:10:25', NULL),
(733, 'اتاوا', 'Ottawa', 'ottawa', 'اتاوا', '', 5, '35.766012', '51.43805694475304', '12', 690, 1665, 1666, 4, 1, 1, 1, '2017-05-25 17:19:47', '2018-01-24 07:32:10', NULL),
(734, 'مکزیکو سیتی', 'Mexico City', 'mexico_city', 'مکزیکو_سیتی', '', 5, '35.766012', '51.43805694475304', '12', 702, 1647, 1648, 4, 1, 1, 1, '2017-05-25 17:21:41', '2018-01-24 07:32:10', NULL),
(735, 'اسپارتا', 'Isparta', 'isparta', 'اسپارتا', '', 5, '37.76105277431703', '30.552635192871094', '12', 442, 1106, 1107, 3, 1, 1, 1, '2017-05-27 10:18:54', '2017-12-10 15:50:06', NULL),
(736, 'قطر', 'Qatar', 'qatar', 'قطر', '', 3, '25.300330806191212', '51.1907958984375', '9', 2, 1011, 1014, 2, 1, 69792, 69792, '2017-05-27 10:57:43', '2017-12-10 15:50:06', NULL),
(737, 'دوحه', 'Doha', 'doha', 'دوحه', '', 5, '25.28716951359646', '51.527252197265625', '11', 736, 1012, 1013, 3, 1, 69792, 69792, '2017-05-27 10:59:52', '2017-12-10 15:50:06', NULL),
(738, 'ابوظبی', 'Abu Dhabi', 'abu_dhabi', 'ابوظبی', '', 5, '24.460150642092874', '54.39056396484375', '10', 473, 896, 897, 3, 1, 69792, 69792, '2017-05-28 09:41:49', '2017-11-06 20:23:36', NULL),
(739, 'دنپاسار', 'Denpasar', 'denpasar', 'دنپاسار', '', 5, '-8.670497446742377', '115.2132797241211', '12', 493, 929, 930, 4, 1, 69792, 69896, '2017-05-29 07:38:06', '2017-11-06 20:23:36', NULL),
(740, 'ماله', 'Male', 'male', 'ماله', '', 5, '4.175369929395586', '73.50943565368652', '15', 508, 1000, 1001, 3, 1, 69792, 69792, '2017-05-29 07:42:50', '2017-12-10 15:50:06', NULL),
(741, 'مانیل', 'Manila', 'manila', 'مانیل', '', 5, '14.598866947156056', '120.98281860351562', '11', 543, 1022, 1023, 3, 1, 69792, 69792, '2017-05-30 11:19:21', '2017-12-10 15:50:06', NULL),
(742, 'بوراکای', 'Boracay', 'boracay', 'بوراکای', '', 5, '11.978874942482795', '121.91905975341797', '12', 543, 1024, 1025, 3, 1, 69792, 69792, '2017-05-30 11:29:59', '2017-12-10 15:50:06', NULL),
(743, 'فوز دو ایگواسو', 'Foz do Iguaçu', 'foz_do_iguacu', 'فوز_دو_ایگواسو', '<p>فوز دو ایگواسو</p>', 5, '-25.51722366560079', '-54.58831787109375', '12', 685, 1591, 1592, 4, 1, 69792, 69792, '2017-05-30 16:26:38', '2018-01-24 07:32:10', NULL),
(744, 'آمریکا', 'America', 'america', 'آمریکا', '', 3, '39.50404070558415', '-101.513671875', '4', 704, 1626, 1643, 3, 1, 69792, 69792, '2017-06-12 09:06:47', '2018-01-24 07:32:10', NULL),
(745, 'قاره آمریکا', 'Americas', 'americas', 'قاره-آمریکا', '', 2, '0.9321906', '-101.89826800000003', '2', 1, 1586, 1693, 1, 1, 69792, 69896, '2017-06-12 09:47:09', '2018-01-24 07:31:40', NULL),
(746, 'یاروسلاول', 'Yaroslavl', 'yaroslavl', 'یاروسلاول', '', 5, '57.62812577112046', '39.87693786621094', '11', 544, 1378, 1379, 3, 1, 69896, 69896, '2017-06-12 09:52:05', '2018-01-02 22:01:51', NULL),
(747, 'کوستروما', 'Kostroma', 'kostroma', 'کوستروما', '', 5, '57.77744666066492', '40.96183776855469', '11', 544, 1380, 1381, 3, 1, 69896, 69896, '2017-06-12 09:54:50', '2018-01-02 22:01:51', NULL),
(748, 'پرو', 'Peru', 'peru', 'پرو', '', 3, '-10.79014075032174', '-76.0693359375', '5', 705, 1608, 1609, 3, 1, 69792, 69792, '2017-06-14 07:58:47', '2018-01-24 07:32:10', NULL),
(749, 'گرینلند', 'Greenland', 'greenland', 'گرینلند', '', 3, '65.36683689226321', '-44.12109375', '3', 704, 1644, 1645, 3, 1, 69792, 69792, '2017-06-14 08:02:18', '2018-01-24 07:32:10', NULL),
(750, 'دانمارک', 'Denmark', 'denmark', 'دانمارک', '', 3, '55.56592203025787', '10.30517578125', '7', 548, 1293, 1296, 2, 1, 69792, 69792, '2017-06-14 12:42:58', '2018-01-02 22:01:51', NULL),
(751, 'هاوایی', 'Hawaii', 'hawaii', 'هاوایی', '', 4, '20.50935458871459', '-157.78564453125', '6', 744, 1627, 1628, 4, 1, 69792, 69792, '2017-06-14 12:51:07', '2018-01-24 07:32:10', NULL),
(752, 'نروژ', 'Norway', 'norway', 'نروژ', '', 3, '62.02152819100765', '9.228515625', '4', 548, 1297, 1298, 2, 1, 69792, 69792, '2017-06-14 12:53:50', '2018-01-02 22:01:51', NULL),
(753, 'مصر', 'Egypt', 'egypt', 'مصر', '', 3, '26.627818226393046', '30.146484375', '5', 667, 1717, 1718, 2, 1, 69792, 69792, '2017-06-14 12:56:34', '2018-01-24 07:10:25', NULL),
(754, 'ایرلند', 'Ireland', 'ireland', 'ایرلند', '', 3, '53.17311920264064', '-8.228759765625', '6', 548, 1299, 1300, 2, 1, 69792, 69792, '2017-06-14 12:59:01', '2018-01-02 22:01:51', NULL),
(755, 'بولیوی', 'Bolivia', 'bolivia', 'بولیوی', '', 3, '-16.84660510639629', '-64.3798828125', '5', 705, 1610, 1611, 3, 1, 69792, 69792, '2017-06-14 13:01:10', '2018-01-24 07:32:10', NULL),
(756, 'ایسلند', 'Iceland', 'iceland', 'ایسلند', '', 3, '64.94216049820736', '-18.369140625', '6', 548, 1301, 1302, 2, 1, 69792, 69792, '2017-06-14 13:08:24', '2018-01-02 22:01:51', NULL),
(757, 'مالتا', 'Malta', 'malta', 'مالتا', '', 3, '35.88571227867025', '14.423675537109375', '10', 548, 1303, 1304, 2, 1, 69792, 69792, '2017-06-14 13:13:47', '2018-01-02 22:01:51', NULL),
(758, 'پاپوآ گینه نو', 'Papua New Guinea', 'papua-new-guinea', 'پاپوآ-گینه-نو', '', 3, '-6.860985433763648', '144.7119140625', '6', 706, 1567, 1568, 2, 1, 69792, 69792, '2017-06-14 13:24:52', '2018-01-03 20:05:10', NULL),
(759, 'اسلوونی', 'Slovenia', 'slovenia', 'اسلوونی', '', 3, '46.01222384063236', '14.710693359375', '7', 548, 1305, 1306, 2, 1, 69792, 69792, '2017-06-14 13:27:50', '2018-01-02 22:01:51', NULL),
(760, 'ازبکستان', 'Uzbekistan', 'uzbekistan', 'ازبکستان', '', 3, '41.96765920367816', '63.6767578125', '5', 2, 1029, 1030, 2, 1, 69896, 69896, '2017-06-14 13:35:55', '2017-12-10 15:50:06', NULL),
(761, 'اسکاتلند', 'Scotland', 'scotland', 'اسکاتلند', '', 3, '57.064630273278546', '-4.46044921875', '6', 548, 1307, 1308, 2, 1, 69896, 69896, '2017-06-14 13:38:12', '2018-01-02 22:01:51', NULL),
(762, 'شیلی', 'Chile', 'chile', 'شیلی', '', 3, '-26.82407078047018', '-70.400390625', '4', 705, 1614, 1615, 3, 1, 69896, 69896, '2017-06-14 13:40:26', '2018-01-24 07:32:10', NULL),
(763, 'اوروگوئه', 'Uruguay', 'uruguay', 'اوروگوئه', '', 3, '-32.85190345738801', '-56.00830078125', '7', 705, 1612, 1613, 3, 1, 69896, 69896, '2017-06-14 13:42:45', '2018-01-24 07:32:10', NULL),
(764, 'پاناما', 'Panama', 'panama', 'پاناما', '', 3, '8.428904092875392', '-80.04638671875', '6', 774, 1681, 1682, 4, 1, 69896, 69896, '2017-06-14 13:45:06', '2018-01-24 07:32:10', NULL),
(765, 'گواتمالا', 'Guatemala', 'guatemala', 'گواتمالا', '', 3, '15.675932151334582', '-90.3515625', '7', 774, 1683, 1684, 4, 1, 69896, 69896, '2017-06-14 13:48:22', '2018-01-24 07:32:10', NULL),
(766, 'نپال', 'Nepal', 'nepal', 'نپال', '', 3, '28.16887518006335', '83.84765625', '6', 2, 1031, 1032, 2, 1, 69896, 69896, '2017-06-14 13:49:58', '2017-12-10 15:50:06', NULL),
(767, 'استونی', 'Estonia', 'estonia', 'استونی', '', 3, '58.631216643424786', '25.83984375', '6', 548, 1309, 1310, 2, 1, 69896, 69896, '2017-06-14 13:51:45', '2018-01-02 22:01:51', NULL),
(768, 'فنلاند', 'Finland', 'finland', 'فنلاند', '', 3, '62.000904713685856', '26.279296875', '5', 548, 1311, 1312, 2, 1, 69896, 69896, '2017-06-14 13:53:15', '2018-01-02 22:01:51', NULL),
(769, 'لهستان', 'Poland', 'poland', 'لهستان', '', 3, '52.8823912222619', '18.69873046875', '6', 548, 1313, 1316, 2, 1, 69896, 69896, '2017-06-14 13:54:49', '2018-01-02 22:01:51', NULL),
(770, 'زلاند نو', 'New Zealand', 'new-zealand', 'زلاند-نو', '', 3, '-42.553080288955805', '172.1337890625', '5', 706, 1573, 1574, 2, 1, 69896, 69896, '2017-06-14 13:57:44', '2018-01-03 20:05:10', NULL),
(773, 'زیمبابوه', 'Zimbabwe', 'zimbabwe', 'زیمبابوه', '', 3, '-19.082884369340157', '30.08056640625', '6', 667, 1719, 1720, 2, 1, 69896, 69896, '2017-06-14 14:09:00', '2018-01-24 07:10:25', NULL),
(774, 'آمریکای مرکزی', 'Central America', 'central-america', 'آمریکای-مرکزی', '', 2, '14.562317701914857', '-88.857421875', '5', 704, 1680, 1691, 3, 1, 69896, 69896, '2017-06-14 14:12:43', '2018-01-24 07:32:10', NULL),
(776, 'تایوان', 'Taiwan', 'taiwan', 'تایوان', '', 3, '23.40276490540795', '121.13525390625', '7', 2, 1033, 1034, 2, 1, 69896, 69896, '2017-06-14 14:18:07', '2017-12-10 15:50:06', NULL),
(778, 'شهر نیویورک', 'New York City', 'new-york-city', 'شهر-نیویورک', '', 5, '40.707710007867334', '-74.02862548828125', '9', 744, 1629, 1630, 4, 1, 69896, 69792, '2017-06-14 14:26:17', '2018-01-24 07:32:10', NULL),
(779, 'میانمار', 'Myanmar', 'myanmar', 'میانمار', '<p>Myanmar (Burma)</p>\r\n<p>Myanmar (formerly Burma)</p>\r\n<p>میانمار (برمه سابق)</p>', 3, '21.3303150734318', '96.427001953125', '6', 2, 1035, 1036, 2, 1, 69896, 69896, '2017-06-14 14:30:54', '2017-12-10 15:50:06', NULL),
(780, 'اردن', 'Jordan', 'jordan', 'اردن', '', 3, '31.278550858946534', '36.89208984375', '7', 2, 1039, 1040, 2, 1, 69896, 69896, '2017-06-14 14:32:19', '2017-12-10 15:50:06', NULL),
(781, 'اتیوپی', 'Ethiopia', 'ethiopia', 'اتیوپی', '', 3, '8.407168163601074', '39.111328125', '6', 667, 1723, 1724, 2, 1, 69896, 69896, '2017-06-14 14:33:55', '2018-01-24 07:10:25', NULL),
(782, 'یمن', 'ِYemen', 'yemen', 'یمن', '', 3, '15.707662769583518', '47.548828125', '6', 2, 1037, 1038, 2, 1, 69896, 69896, '2017-06-14 14:35:26', '2017-12-10 15:50:06', NULL),
(783, 'عربستان سعودی', 'Saudi Arabia', 'saudi-arabia', 'عربستان-سعودی', '', 3, '23.60426184707018', '44.912109375', '5', 2, 1175, 1178, 2, 1, 69896, 69896, '2017-06-17 05:57:11', '2018-01-02 22:01:51', NULL),
(784, 'ریاض', 'Riyadh', 'riyadh', 'ریاض', '', 5, '24.686952411999155', '46.66717529296875', '9', 783, 1176, 1177, 3, 1, 69896, 69896, '2017-06-17 07:53:32', '2018-01-02 22:01:51', NULL),
(785, 'بورکینافاسو', 'Burkina Faso', 'burkina_faso', 'بورکینافاسو', '', 3, '12.307802336622869', '-1.768798828125', '7', 667, 1727, 1728, 2, 1, 69896, 69896, '2017-06-17 07:56:25', '2018-01-24 07:10:25', NULL),
(786, 'تبت', 'Tibet', 'tibet', 'تبت', '', 7, '31.16580958786196', '88.857421875', '5', 498, 1074, 1075, 3, 1, 69896, 69896, '2017-06-17 08:04:08', '2017-12-10 15:50:06', NULL),
(787, 'مغولستان', 'Mongolia', 'mongolia', 'مغولستان', '', 3, '46.800059446787316', '102.9638671875', '5', 2, 1179, 1180, 2, 1, 69896, 69896, '2017-06-17 12:36:50', '2018-01-02 22:01:51', NULL),
(788, 'ترکمنستان', 'Turkmenistan', 'turkmenistan', 'ترکمنستان', '', 3, '38.94232097947902', '58.77685546875', '6', 2, 1181, 1182, 2, 1, 69896, 69896, '2017-06-17 12:38:33', '2018-01-02 22:01:51', NULL),
(789, 'لیتوانی', 'Lithuania', 'lithuania', 'لیتوانی', '', 3, '55.56592203025787', '23.7744140625', '7', 548, 1317, 1318, 2, 1, 69896, 69896, '2017-06-17 12:40:12', '2018-01-02 22:01:51', NULL),
(790, 'سودان', 'Sudan', 'sudan', 'سودان', '', 3, '16.25686733062344', '30.146484375', '5', 667, 1725, 1726, 2, 1, 69896, 69896, '2017-06-17 12:41:44', '2018-01-24 07:10:25', NULL),
(791, 'آبخازیا', 'Abkhazia', 'abkhazia', 'آبخازیا', '', 7, '43.0889491834659', '41.0284423828125', '8', 644, 1208, 1209, 3, 1, 69896, 69896, '2017-06-17 12:56:38', '2018-01-02 22:01:51', NULL),
(792, 'مولداوی', 'Moldova', 'moldova', 'مولداوی', '', 3, '45.78284835197677', '24.949951171875', '6', 548, 1319, 1320, 2, 1, 69896, 69896, '2017-06-17 12:59:12', '2018-01-02 22:01:51', NULL),
(793, 'ولز', 'Wales', 'wales', 'ولز', '', 3, '51.998410382390325', '-4.405517578125', '7', 548, 1321, 1322, 2, 1, 69896, 69896, '2017-06-17 13:01:58', '2018-01-02 22:01:51', NULL),
(794, 'هنگ کنگ', 'Hong Kong', 'hong-kong', 'هنگ-کنگ', '', 5, '22.278295210101668', '114.17335510253906', '12', 498, 1082, 1083, 3, 1, 69896, 69896, '2017-06-17 13:11:16', '2017-12-10 15:50:06', NULL),
(795, 'کاستاریکا', 'Costa Rica', 'costa_rica', 'کاستاریکا', '', 3, '10.401377554543553', '-84.232177734375', '7', 774, 1685, 1686, 4, 1, 69896, 69896, '2017-06-17 13:17:43', '2018-01-24 07:32:10', NULL),
(796, 'کره شمالی', 'North Korea', 'north-korea', 'کره-شمالی', '', 3, '40.1452892956766', '127.001953125', '6', 2, 1183, 1184, 2, 1, 69896, 69896, '2017-06-17 13:26:16', '2018-01-02 22:01:51', NULL),
(797, 'شیکاگو', 'Chicago', 'chicago', 'شیکاگو', '', 5, '41.87774145109677', '-87.64068603515625', '10', 744, 1631, 1632, 4, 1, 69896, 69896, '2017-06-17 13:27:52', '2018-01-24 07:32:10', NULL),
(798, 'کوزوو', 'Kosovo', 'kosovo', 'کوزوو', '', 3, '42.56926437219384', '20.830078125', '7', 548, 1323, 1324, 2, 1, 69896, 69896, '2017-06-17 13:30:07', '2018-01-02 22:01:51', NULL),
(799, 'لس آنجلس', 'Los Angeles', 'los-angeles', 'لس-آنجلس', '', 5, '34.04583232505719', '-118.2403564453125', '10', 800, 1634, 1635, 5, 1, 69896, 69896, '2017-06-17 13:32:52', '2018-01-24 07:32:10', NULL),
(800, 'کالیفرنیا', 'California', 'california', 'کالیفرنیا', '', 4, '36.43896124085945', '-119.4873046875', '5', 744, 1633, 1636, 4, 1, 69896, 69896, '2017-06-17 13:34:31', '2018-01-24 07:32:10', NULL),
(801, 'آریزونا', 'Arizona', 'arizona', 'آریزونا', '', 4, '34.23451236236987', '-111.7529296875', '6', 744, 1637, 1638, 4, 1, 69896, 69896, '2017-06-17 13:37:30', '2018-01-24 07:32:10', NULL),
(802, 'پورتوریکو', 'Puerto Rico', 'puerto_rico', 'پورتوریکو', '', 7, '18.198043686762656', '-66.62109375', '7', 744, 1639, 1640, 4, 1, 69896, 69896, '2017-06-17 13:42:29', '2018-01-24 07:32:10', NULL),
(803, 'آلاسکا', 'Alaska', 'alaska', 'آلاسکا', '', 4, '64.73664139557683', '-151.435546875', '4', 744, 1641, 1642, 4, 1, 69896, 69896, '2017-06-17 14:03:12', '2018-01-24 07:32:10', NULL),
(804, 'ونزوئلا', 'Venezuela', 'venezuela', 'ونزوئلا', '', 3, '6.926426847059551', '-66.62109375', '5', 705, 1616, 1617, 3, 1, 69896, 69896, '2017-06-17 14:05:08', '2018-01-24 07:32:10', NULL),
(805, 'بلیز', 'Belize', 'belize', 'بلیز', '', 3, '16.783505561927786', '-88.692626953125', '7', 774, 1687, 1688, 4, 1, 69896, 69896, '2017-06-17 14:06:47', '2018-01-24 07:32:10', NULL),
(806, 'مقدونیه', 'Macedonia', 'macedonia', 'مقدونیه', '<p>Macedonia (FYROM)</p>\r\n<p>&nbsp;</p>', 3, '41.65649719441145', '21.6650390625', '7', 548, 1325, 1326, 2, 1, 69896, 69896, '2017-06-17 14:09:34', '2018-01-02 22:01:51', NULL),
(807, 'بوسنی و هرزگوین', 'Bosnia and Herzegovina', 'bosnia-and-herzegovina', 'بوسنی-و-هرزگوین', '', 3, '44.55133484083592', '17.655029296875', '7', 548, 1327, 1330, 2, 1, 69896, 69896, '2017-06-17 14:12:23', '2018-01-02 22:01:51', NULL),
(808, 'سارایوو', 'Sarajevo', 'sarajevo', 'سارایوو', '', 5, '43.855821179763005', '18.411026000976562', '11', 807, 1328, 1329, 3, 1, 69896, 69896, '2017-06-17 14:14:07', '2018-01-02 22:01:51', NULL),
(809, 'کلمبیا', 'Colombia', 'colombia', 'کلمبیا', '', 3, '3.4695573030614724', '-73.65234375', '5', 705, 1618, 1619, 3, 1, 69896, 69896, '2017-06-17 14:15:41', '2018-01-24 07:32:10', NULL),
(810, 'سیبری', 'Siberia', 'siberia', 'سیبری', '', 4, '61.0137', '99.19669999999996', '3', 544, 1384, 1385, 3, 1, 69896, 69896, '2017-06-17 14:22:34', '2018-01-02 22:01:51', NULL),
(811, 'اقیانوس آرام جنوبی', 'South Pacific Ocean', 'south-pacific-ocean', 'اقیانوس-آرام-جنوبی', '', 7, '-29.075375179558346', '-137.98828125', '3', 1, 1694, 1697, 1, 1, 69896, 69896, '2017-06-17 14:41:35', '2018-01-24 07:31:40', NULL),
(812, 'تاهیتی', 'Tahiti', 'tahiti', 'تاهیتی', '', 5, '-17.651873989224537', '-149.42710876464844', '11', 811, 1695, 1696, 2, 1, 69896, 69896, '2017-06-17 14:43:36', '2018-01-24 07:31:40', NULL),
(813, 'کپنهاگ', 'Copenhagen', 'copenhagen', 'کپنهاگ', '', 5, '55.67603572236134', '12.571792602539062', '11', 750, 1294, 1295, 3, 1, 69896, 69896, '2017-06-17 14:45:10', '2018-01-02 22:01:51', NULL),
(814, 'سوریه', 'Syria', 'syria', 'سوریه', '', 3, '35.0120020431607', '38.408203125', '6', 2, 1185, 1186, 2, 1, 69896, 69896, '2017-06-18 12:17:20', '2018-01-02 22:01:51', NULL),
(815, 'رباط', 'Rabat', 'rabat', 'رباط', '', 5, '33.97411463602787', '-6.8499755859375', '12', 678, 1708, 1709, 3, 1, 69896, 69896, '2017-06-19 05:32:42', '2018-01-24 07:10:25', NULL),
(816, 'هائیتی', 'Haiti', 'haiti', 'هائیتی', '', 3, '18.855609961691815', '-72.64147675596178', '7', 774, 1689, 1690, 4, 1, 69896, 69792, '2017-06-19 10:46:21', '2018-01-24 07:32:10', NULL),
(817, 'خلیج ها لونگ', 'Ha-Long-Bay', 'ha-long-bay', 'خلیج-ها-لونگ', '', 7, '20.971217659495338', '107.04477310180664', '13', 528, 944, 945, 3, 1, 69896, 69896, '2017-06-24 10:26:04', '2017-11-12 20:23:12', NULL),
(818, 'مالای', 'Malay', 'malay', 'مالای', '', 7, '11.899401962836935', '121.95991516113281', '12', 543, 1026, 1027, 3, 1, 69792, 69792, '2017-06-25 07:04:41', '2017-12-10 15:50:06', NULL),
(819, 'الا', 'Ella', 'ella', 'الا', '', 7, '6.866652267212544', '81.04661464691162', '15', 522, 1268, 1269, 3, 1, 69896, 69896, '2017-06-28 10:30:27', '2018-01-02 22:01:51', NULL),
(820, 'ترینکومالی', 'Trincomalee', 'trincomalee', 'ترینکومالی', '', 5, '8.588319955811242', '81.21299743652344', '13', 522, 1270, 1271, 3, 1, 69896, 69896, '2017-06-28 10:33:50', '2018-01-02 22:01:51', NULL),
(821, 'گال', 'Galle', 'galle', 'گال', '', 5, '6.055039039484608', '80.21873474121094', '13', 522, 1272, 1273, 3, 1, 69896, 69896, '2017-06-28 10:37:05', '2018-01-02 22:01:51', NULL),
(822, 'آهانگاما', 'Ahangama', 'ahangama', 'آهانگاما', '', 5, '6.002630473906402', '80.36928176879883', '13', 522, 1274, 1275, 3, 1, 69896, 69896, '2017-06-28 11:03:31', '2018-01-02 22:01:51', NULL),
(823, 'شهر واتیکان', 'Vatican City', 'vatican-city', 'شهر-واتیکان', '', 3, '41.90214927584711', '12.453088760375977', '15', 548, 1331, 1332, 2, 0, 69896, 69896, '2017-06-28 11:12:46', '2018-01-02 22:01:51', NULL),
(824, 'لیبی', 'Libya', 'libya', 'لیبی', '', 3, '27.059125784374068', '17.314453125', '5', 667, 1729, 1730, 2, 1, 69896, 69896, '2017-06-28 11:29:00', '2018-01-24 07:10:25', NULL),
(825, ' سن مارینو', 'San Marino', 'san-marino', ' سن-مارینو', '', 3, '43.9349893800415', '12.449569702148438', '12', 548, 1333, 1334, 2, 1, 69896, 69896, '2017-06-28 11:31:24', '2018-01-02 22:01:51', NULL),
(826, 'آندورا', 'Andorra', 'andorra', 'آندورا', '', 3, '42.51158941527829', '1.51611328125', '10', 548, 1335, 1336, 2, 1, 69896, 69896, '2017-06-28 11:33:27', '2018-01-02 22:01:51', NULL),
(827, 'لیختن اشتاین', 'Liechtenstein', 'liechtenstein', 'لیختن_اشتاین', '', 3, '47.187845928576344', '9.5361328125', '9', 548, 1337, 1338, 2, 1, 69896, 69896, '2017-06-28 11:35:38', '2018-01-02 22:01:51', NULL),
(828, 'قرقیزستان', 'Kyrgyzstan', 'kyrgyzstan', 'قرقیزستان', '', 3, '41.475660200278206', '74.4873046875', '6', 2, 1187, 1188, 2, 1, 69896, 69896, '2017-06-28 11:37:22', '2018-01-02 22:01:51', NULL),
(829, 'تاجیکستان', 'Tajikistan', 'tajikistan', 'تاجیکستان', '', 3, '38.51378825951165', '71.16943359375', '6', 2, 1189, 1190, 2, 1, 69896, 69896, '2017-06-28 11:39:34', '2018-01-02 22:01:51', NULL),
(830, 'مالاکا', 'Malacca', 'malacca', 'مالاکا', '', 4, '2.1939826756524683', '102.24151611328125', '10', 484, 1230, 1231, 3, 1, 69896, 69896, '2017-07-05 11:26:44', '2018-01-02 22:01:51', NULL),
(831, 'مانائوس', 'Manaus', 'manaus', 'مانائوس', '', 5, '-3.119947473175678', '-60.022430419921875', '11', 833, 1596, 1597, 5, 1, 69896, 69792, '2017-07-09 05:23:52', '2018-01-24 07:32:10', NULL),
(832, 'اوتازس', 'Autazes', 'autazes', 'اوتازس', '', 7, '-3.586237147120614', '-59.126529693603516', '9', 833, 1594, 1595, 5, 1, 69896, 69792, '2017-07-09 08:19:11', '2018-01-24 07:32:10', NULL),
(833, 'آمازوناس', 'Amazonas', 'amazonas', 'آمازوناس', '', 4, '-4.959615024698014', '-64.57763671875', '5', 685, 1593, 1600, 4, 1, 69792, 69792, '2017-07-17 11:44:59', '2018-01-24 07:32:10', NULL),
(834, 'نوو آیرائو', 'Novo Airão', 'novo-airao', 'نوو-آیرائو', '', 7, '-2.6796866158037598', '-61.007080078125', '8', 833, 1598, 1599, 5, 1, 69792, 69792, '2017-07-17 11:58:12', '2018-01-24 07:32:10', NULL),
(835, 'ترنگانو', 'Terengganu', 'terengganu', 'ترنگانو', '', 4, '5.309766171943691', '103.0902099609375', '8', 484, 1232, 1233, 3, 1, 69896, 69896, '2017-07-17 12:38:18', '2018-01-02 22:01:51', NULL),
(836, 'گنت', 'Ghent', 'ghent', 'گنت', '', 5, '51.053912503544275', '3.7154388427734375', '11', 618, 1346, 1347, 3, 1, 69896, 69896, '2017-07-22 04:32:08', '2018-01-02 22:01:51', NULL),
(837, 'هوآ هین', 'Hua Hin', 'hua-hin', 'هوآ-هین', '', 6, '12.529093626349596', '99.79019165039062', '10', 476, 1058, 1059, 3, 1, 69792, 69792, '2017-07-23 07:17:11', '2017-12-10 15:50:06', NULL),
(838, 'پاکستان', 'Pakistan', 'pakistan', 'پاکستان', '', 3, '29.91685223307017', '69.169921875', '5', 2, 1191, 1192, 2, 1, 69896, 69896, '2017-08-06 12:33:07', '2018-01-02 22:01:51', NULL),
(839, 'پاراگوئه', 'Paraguay', 'paraguay', 'پاراگوئه', '', 3, '-23.362428593408826', '-58.07373046875', '6', 705, 1620, 1621, 3, 1, 69896, 69896, '2017-08-06 12:36:54', '2018-01-24 07:32:10', NULL),
(840, 'استان آیدین', 'Aydin Province', 'aydin-province', 'استان-آیدین', '', 4, '37.74031329210266', '27.9656982421875', '8', 442, 1114, 1119, 3, 1, 69792, 69792, '2017-08-13 14:13:53', '2017-12-10 15:50:06', NULL),
(841, 'استان ازمیر', 'Izmir Province', 'izmir-province', 'استان-ازمیر', '', 4, '38.50948995925553', '27.0648193359375', '8', 442, 1120, 1129, 3, 1, 69792, 69792, '2017-08-13 14:37:44', '2017-12-10 15:50:06', NULL),
(842, 'چشمه', 'Cesme', 'cesme', 'چشمه', '', 5, '38.32347772783846', '26.30401611328125', '12', 841, 1123, 1124, 4, 1, 69792, 69792, '2017-08-13 14:44:20', '2017-12-10 15:50:06', NULL),
(843, 'آلاچاتی', 'Alacati', 'alacati', 'آلاچاتی', '', 5, '38.28885871419223', '26.377315521240234', '13', 841, 1125, 1126, 4, 1, 69792, 69792, '2017-08-13 14:51:14', '2017-12-10 15:50:06', NULL),
(844, 'اوزدره', 'Ozdere', 'ozdere', 'اوزدره', '', 5, '38.02348376284101', '27.130050659179688', '12', 841, 1127, 1128, 4, 1, 69792, 69792, '2017-08-13 15:05:17', '2017-12-10 15:50:06', NULL),
(845, 'ریمینی', 'Rimini', 'rimini', 'ریمینی', '', 5, '44.067360301083085', '12.569389343261719', '11', 572, 1478, 1479, 3, 1, 69896, 69896, '2017-08-20 06:02:33', '2018-01-02 22:01:51', NULL),
(846, 'آدانا', 'Adana', 'adana', 'آدانا', '', 5, '36.98884240936997', '35.33271789550781', '11', 442, 1130, 1131, 3, 1, 69896, 69896, '2017-08-27 09:56:36', '2017-12-10 15:50:06', NULL),
(847, 'کاش', 'kas', 'kas', 'کاش', '', 5, '36.19978490414676', '29.639525413513184', '14', 443, 1161, 1162, 4, 1, 69896, 69896, '2017-08-30 05:08:36', '2017-12-10 15:50:06', NULL),
(848, 'ککووا', 'Kekova', 'kekova', 'ککووا', '', 5, '36.18125508686796', '29.878520965576172', '13', 443, 1163, 1164, 4, 1, 69896, 69896, '2017-08-30 05:20:21', '2017-12-10 15:50:06', NULL),
(849, 'وادووا', 'Wadduwa', 'wadduwa', 'وادووا', '', 5, '6.6383496475150245', '79.95231628417969', '12', 522, 1276, 1277, 3, 1, 69896, 69896, '2017-08-30 11:32:30', '2018-01-02 22:01:51', NULL),
(850, 'کایسری', 'Kayseri', 'kayseri', 'کایسری', '', 5, '38.71766178810086', '35.4803466796875', '11', 442, 1170, 1171, 3, 1, 69896, 69896, '2017-09-02 06:11:36', '2017-12-10 15:50:06', NULL),
(851, 'افغانستان', 'Afghanistan', 'afghanistan', 'افغانستان', '', 3, '33.8339199536547', '64.951171875', '6', 2, 1213, 1214, 2, 1, 69896, 69896, '2017-09-03 12:21:11', '2018-01-02 22:01:51', NULL),
(852, 'مریدا', 'Merida', 'merida', 'مریدا', '', 5, '20.96464560107569', '-89.59968566894531', '11', 702, 1649, 1650, 4, 1, 69896, 69896, '2017-09-24 16:38:44', '2018-01-24 07:32:10', NULL),
(853, 'چیاپاس', 'Chiapas', 'chiapas', 'چیاپاس', '', 4, '16.983248530690656', '-92.911376953125', '7', 702, 1651, 1652, 4, 1, 69896, 69896, '2017-09-24 16:39:33', '2018-01-24 07:32:10', NULL),
(854, 'ماکائو', 'Macau', 'macau', 'ماکائو', '', 3, '22.207431323159522', '113.55331420898438', '12', 2, 1257, 1258, 2, 1, 69896, 69896, '2017-09-24 17:13:48', '2018-01-02 22:01:51', NULL),
(855, 'انگلبرگ', 'Engelberg', 'engelberg', 'انگلبرگ', '', 7, '46.81979753343517', '8.408317565917969', '12', 614, 1468, 1469, 3, 1, 69896, 69896, '2017-09-24 19:29:05', '2018-01-02 22:01:51', NULL),
(856, 'سینترا', 'Sintra', 'sintra', 'سینترا', '', 7, '38.80279473378288', '-9.378890991210938', '10', 569, 1366, 1367, 3, 1, 69896, 69896, '2017-10-07 14:22:11', '2018-01-02 22:01:51', NULL),
(857, 'سلا', 'Sale', 'sale', 'سلا', '', 5, '34.03445260967644', '-6.7710113525390625', '11', 678, 1710, 1711, 3, 1, 69896, 69896, '2017-10-07 15:59:42', '2018-01-24 07:10:25', NULL),
(858, 'بنگلادش', 'Bangladesh', 'bangladesh', 'بنگلادش', '', 3, '24.08658925822803', '90.02197265625', '6', 2, 1259, 1262, 2, 1, 69896, 69896, '2017-10-08 16:05:06', '2018-01-02 22:01:51', NULL),
(859, 'داکا', 'Dhaka', 'dhaka', 'داکا', '', 5, '23.810475327766568', '90.4010009765625', '11', 858, 1260, 1261, 3, 1, 69896, 69896, '2017-10-08 16:07:42', '2018-01-02 22:01:51', NULL),
(860, 'اوبود', 'Ubud', 'ubud', 'اوبود', '', 1, '-8.511421546798838', '115.26237487792969', '15', 493, 931, 932, 4, 1, 74407, 74407, '2017-10-17 20:01:19', '2017-11-06 20:23:36', NULL),
(861, 'کوتا', 'Kuta', 'kuta', 'کوتا', '', 1, '-8.723702969471933', '115.17508506774902', '12', 493, 933, 934, 4, 1, 74407, 69896, '2017-10-17 20:04:12', '2017-11-12 20:23:12', NULL),
(863, 'اکوادور', 'Ecuador', 'ecuador', 'اکوادور', '', 3, '-1.4939713066293112', '-78.486328125', '6', 705, 1622, 1623, 3, 1, 69896, 69896, '2017-10-18 13:32:50', '2018-01-24 07:32:10', NULL),
(864, 'قاضی آباد', 'Ghaziabad', 'ghaziabad', 'قاضی-آباد', '', 5, '28.678540108533195', '77.4481201171875', '10', 890, 1251, 1252, 4, 1, 69896, 69792, '2017-10-21 14:57:54', '2018-01-02 22:01:51', NULL),
(865, 'ولیگاما', 'Weligama', 'weligama', 'ولیگاما', '', 7, '5.978387670645099', '80.4279899597168', '12', 522, 1284, 1285, 3, 1, 69896, 69896, '2017-10-25 13:57:37', '2018-01-02 22:01:51', NULL),
(866, 'کرنز مونتانا', 'Crans-Montana', 'crans-montana', 'کرنز-مونتانا', '', 7, '46.342572704001185', '7.49842643737793', '12', 614, 1472, 1473, 3, 1, 69896, 69896, '2017-10-25 17:49:49', '2018-01-09 17:42:06', NULL),
(867, 'کافو آتول', 'Kaafu Atoll', 'kaafu-atoll', 'کافو-آتول', '', 6, '4.47238006845355', '73.5589599609375', '9', 508, 1002, 1003, 3, 1, 69896, 69896, '2017-10-29 15:05:21', '2017-12-10 15:50:06', NULL),
(868, 'الیفو آتول', 'Alifu Atoll', 'alifu-atoll', 'الیفو-آتول', '', 6, '4.187551125218825', '72.85308837890625', '10', 508, 1004, 1005, 3, 1, 69896, 69896, '2017-10-29 15:26:07', '2017-12-10 15:50:06', NULL),
(869, 'نونو آتول', 'Noonu Atoll', 'noonu-atoll', 'نونو-آتول', '', 6, '5.853742312049771', '73.30352783203125', '10', 508, 1006, 1007, 3, 1, 69896, 69896, '2017-10-29 16:47:50', '2017-12-10 15:50:06', NULL),
(870, 'با آتول', 'Baa Atoll', 'baa-atoll', 'با-آتول', '', 6, '5.192158797900502', '72.98355102539062', '10', 508, 1008, 1009, 3, 1, 69896, 69896, '2017-10-29 19:06:13', '2017-12-10 15:50:06', NULL),
(871, 'عسلویه', 'Asaluyeh', 'asaluyeh', 'عسلویه', '', 5, '27.47149591709394', '52.614126205444336', '14', 87, 155, 156, 4, 1, 69896, 69896, '2017-11-06 20:09:06', '2017-11-06 20:09:07', NULL),
(872, 'بندر سیراف', 'Bandar Siraf', 'bandar-siraf', 'بندر-سیراف', '', 5, '27.669770237922503', '52.33818054199219', '15', 87, 157, 158, 4, 1, 69896, 69896, '2017-11-06 20:17:25', '2017-11-06 20:17:26', NULL),
(873, 'بندر مقام', 'Bandar-e Moqam', 'bandar-e-moqam', 'بندر-مقام', '', 5, '26.96614179481704', '53.480587005615234', '14', 358, 437, 438, 4, 1, 69896, 69896, '2017-11-06 20:20:27', '2017-11-06 20:20:28', NULL),
(874, 'جزیزه شیدور', 'Shidvar Island', 'shidvar-island', 'جزیره-شیدور', '', 7, '26.790976914493875', '53.41029167175293', '15', 358, 439, 440, 4, 1, 69896, 69896, '2017-11-06 20:23:36', '2017-11-06 20:23:36', NULL),
(875, 'روتردام', 'Rotterdam', 'rotterdam', 'روتردام', '', 5, '51.92479035569266', '4.471778869628906', '11', 587, 1500, 1501, 3, 1, 69896, 69896, '2017-11-06 20:26:39', '2018-01-02 22:01:51', NULL),
(876, 'دلفت', 'Delft', 'delft', 'دلفت', '', 5, '52.01193653675364', '4.35882568359375', '11', 587, 1502, 1503, 3, 1, 69896, 69896, '2017-11-06 20:29:13', '2018-01-02 22:01:51', NULL),
(877, 'لاهه', 'The Hague', 'the-hague', 'لاهه', '', 5, '52.07148747465287', '4.295654296875', '11', 587, 1504, 1505, 3, 1, 69896, 69896, '2017-11-06 20:33:20', '2018-01-02 22:01:51', NULL),
(878, 'مونترو', 'Montreux', 'montreux', 'مونترو', '', 7, '46.43146838115085', '6.912202835083008', '14', 614, 1474, 1475, 3, 1, 74407, 74407, '2017-11-06 21:22:37', '2018-01-02 22:01:51', NULL),
(879, 'هوی آن', 'Hoi An', 'hoi-an', 'هوی-آن', '', 5, '15.880771733784409', '108.33755493164062', '11', 528, 948, 949, 3, 1, 69896, 69896, '2017-11-11 22:11:47', '2017-11-12 20:23:12', NULL),
(880, 'کوتایسی', 'Kutaisi', 'kutaisi', 'کوتایسی', '', 5, '42.26757891577025', '42.7174186706543', '12', 644, 1210, 1211, 3, 1, 69896, 69896, '2017-11-20 15:38:03', '2018-01-02 22:01:51', NULL),
(881, 'ورشو', 'Warsaw', 'warsaw', 'ورشو', '', 5, '52.22729470696965', '21.009979248046875', '10', 769, 1314, 1315, 3, 1, 69896, 69896, '2017-11-21 18:35:42', '2018-01-02 22:01:51', NULL),
(882, 'رواسی-آن-فرانس', 'Roissy-en-France', 'Roissy-en-France', 'رواسی-آن-فرانس', '', 5, '49.003825914341775', '2.5151824951171875', '10', 549, 1454, 1455, 3, 1, 69896, 69896, '2017-11-21 20:35:32', '2018-01-02 22:01:51', NULL),
(883, 'کیوتو', 'Kyoto', 'kyoto', 'کیوتو', '', 5, '35.02774729487063', '135.76904296875', '11', 513, 990, 991, 3, 1, 69896, 69896, '2017-12-10 15:46:49', '2017-12-10 15:46:50', NULL),
(884, 'سندای', 'Sendai', 'sendai', 'سندای', '', 5, '38.28293006703912', '140.86875915527344', '11', 513, 992, 993, 3, 1, 69896, 69896, '2017-12-10 15:50:05', '2017-12-10 15:50:06', NULL),
(885, 'بروژ', 'Bruges', 'bruges', 'بروژ', '', 5, '51.209034296637', '3.223114013671875', '11', 618, 1348, 1349, 3, 1, 69896, 69896, '2017-12-10 15:54:29', '2018-01-02 22:01:51', NULL),
(886, 'اوستند', 'Ostend', 'ostend', 'اوستند', '', 5, '51.21462617111765', '2.9285430908203125', '11', 618, 1350, 1351, 3, 1, 69896, 69896, '2017-12-10 16:13:00', '2018-01-02 22:01:51', NULL),
(887, 'آنتورپ', 'Antwerp', 'antwerp', 'آنتورپ', '', 5, '51.21806698712828', '4.4000244140625', '11', 618, 1352, 1353, 3, 1, 69896, 69896, '2017-12-10 16:16:05', '2018-01-02 22:01:51', NULL),
(888, 'شفشاون', 'Chefchaouen', 'chefchaouen', 'شفشاون', '', 5, '35.16903738515342', '-5.2679443359375', '13', 678, 1712, 1713, 3, 1, 69896, 69896, '2017-12-13 20:07:49', '2018-01-24 07:10:25', NULL),
(889, 'روست', 'Rust', 'rust', 'روست', '', 7, '48.26719791875239', '7.725620269775391', '13', 579, 1418, 1419, 3, 1, 69896, 69896, '2017-12-16 18:07:42', '2018-01-02 22:01:51', NULL),
(890, 'ناحیه قاضی آباد', 'Ghaziabad District', 'ghaziabad-district', 'ناحیه-قاضی-آباد', '', 6, '28.670106001940425', '77.45052337646484', '12', 634, 1250, 1255, 3, 1, 69792, 69792, '2017-12-17 18:16:02', '2018-01-02 22:01:51', NULL),
(891, 'صاحب آباد', 'Sahibabad', 'sahibabad', 'صاحب-آباد', '', 7, '28.66438247151326', '77.3488998413086', '14', 890, 1253, 1254, 4, 1, 69792, 69792, '2017-12-17 18:23:30', '2018-01-02 22:01:51', NULL),
(892, 'کایرنیا', 'Kyrenia', 'kyrenia', 'کایرنیا', '', 5, '35.323879286132374', '33.314666748046875', '14', 627, 1525, 1526, 4, 1, 69896, 69896, '2017-12-20 15:10:56', '2018-01-02 22:01:51', NULL),
(893, 'کریباتی', 'Kiribati', 'kiribati', 'کریباتی', '', 3, '1.8398936649835123', '-157.36953735351562', '10', 706, 1583, 1584, 2, 1, 69896, 69896, '2017-12-24 20:04:54', '2018-01-03 20:05:10', NULL),
(894, 'لوکزامبورگ', 'Luxembourg', 'luxembourg', 'لوکزامبورگ', '', 1, '49.61782831211117', '6.119384765625', '9', 548, 1561, 1564, 2, 1, 69896, 69896, '2017-12-27 21:11:04', '2018-01-07 19:50:26', NULL),
(895, 'بورسا', 'Bursa', 'bursa', 'بورسا', '', 5, '40.188840371622106', '29.056777954101562', '12', 442, 1172, 1173, 3, 1, 69896, 69896, '2018-01-02 22:01:50', '2018-01-07 20:41:25', NULL),
(896, 'شهر لوکزامبورگ', 'Luxembourg City', 'luxembourg-city', 'شهر-لوکزامبورگ', '', 5, '49.611766637429625', '6.131830215454102', '10', 894, 1562, 1563, 3, 1, 69896, 69896, '2018-01-03 20:05:10', '2018-01-03 20:05:10', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `menus`
--

CREATE TABLE `menus` (
  `id` int(10) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `slug` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `route` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `description` text COLLATE utf8_unicode_ci,
  `parent_id` int(11) DEFAULT NULL,
  `lft` int(11) DEFAULT NULL,
  `rgt` int(11) DEFAULT NULL,
  `depth` int(11) DEFAULT NULL,
  `state` int(11) NOT NULL DEFAULT '1',
  `created_by` int(10) UNSIGNED NOT NULL,
  `updated_by` int(10) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `menus`
--

INSERT INTO `menus` (`id`, `title`, `slug`, `route`, `description`, `parent_id`, `lft`, `rgt`, `depth`, `state`, `created_by`, `updated_by`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, 'صفحه اصلی', '/', '/', NULL, 0, 1, 2, NULL, 1, 1, 1, '2018-01-24 07:40:33', '2018-01-24 07:40:33', NULL),
(2, 'منوی اصلی', 'منوی-اصلی', 'منوی-اصلی', 'منوی اصلی', NULL, 3, 6, 0, 1, 1, 1, '2018-01-24 07:46:25', '2018-01-24 07:46:55', NULL),
(3, 'صفحه اصلی', '/', '/', NULL, 2, 4, 5, 1, 1, 1, 1, '2018-01-24 07:46:55', '2018-01-24 07:47:08', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `menu_types`
--

CREATE TABLE `menu_types` (
  `id` int(10) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `content` text COLLATE utf8_unicode_ci,
  `state` int(11) NOT NULL DEFAULT '1',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2014_10_12_000000_create_users_table', 1),
(2, '2014_10_12_100000_create_password_resets_table', 1),
(3, '2017_03_24_130707_add_username_field_to_users_table', 1),
(4, '2017_03_26_073533_alter_users_table', 1),
(5, '2017_03_28_085535_entrust_setup_tables', 1),
(6, '2017_04_02_143123_create_settings_table', 1),
(7, '2017_04_10_065902_create_menus_table', 1),
(8, '2017_05_30_400000_create_locations_table', 1),
(9, '2017_09_21_100000_create_admins_table', 1),
(10, '2017_09_29_122900_create_customers_table', 1),
(54, '2018_01_20_170433_create_categories_table', 2),
(61, '2018_01_20_170445_create_chains_table', 3),
(62, '2018_01_20_183959_create_restaurants_table', 3),
(63, '2018_01_20_191801_create_menu_types_table', 3),
(64, '2018_01_20_192140_create_category_restaurant_table', 3),
(65, '2018_01_20_192725_create_restaurant_menus_table', 3),
(66, '2018_01_21_080215_create_likes_table', 3);

-- --------------------------------------------------------

--
-- Table structure for table `password_resets`
--

CREATE TABLE `password_resets` (
  `email` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `permissions`
--

CREATE TABLE `permissions` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `display_name` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `description` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `permissions`
--

INSERT INTO `permissions` (`id`, `name`, `display_name`, `description`, `created_at`, `updated_at`) VALUES
(1, 'admin.users.create', 'Users Create', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(2, 'admin.users.read', 'Users Read', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(3, 'admin.users.update', 'Users Update', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(4, 'admin.users.delete', 'Users Delete', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(5, 'admin.roles.create', 'Roles Create', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(6, 'admin.roles.read', 'Roles Read', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(7, 'admin.roles.update', 'Roles Update', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(8, 'admin.roles.delete', 'Roles Delete', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(9, 'admin.permissions.create', 'Permissions Create', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(10, 'admin.permissions.read', 'Permissions Read', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(11, 'admin.permissions.update', 'Permissions Update', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(12, 'admin.permissions.delete', 'Permissions Delete', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(13, 'admin.restaurants.create', 'Restaurants Create', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(14, 'admin.restaurants.read', 'Restaurants Read', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(15, 'admin.restaurants.update', 'Restaurants Update', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(16, 'admin.restaurants.delete', 'Restaurants Delete', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(17, 'admin.chains.create', 'Chains Create', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(18, 'admin.chains.read', 'Chains Read', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(19, 'admin.chains.update', 'Chains Update', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(20, 'admin.chains.delete', 'Chains Delete', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(21, 'admin.categories.create', 'Categories Create', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(22, 'admin.categories.read', 'Categories Read', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(23, 'admin.categories.update', 'Categories Update', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(24, 'admin.categories.delete', 'Categories Delete', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(25, 'admin.translations.create', 'Translations Create', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(26, 'admin.translations.read', 'Translations Read', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(27, 'admin.translations.update', 'Translations Update', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(28, 'admin.translations.delete', 'Translations Delete', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(29, 'admin.settings.create', 'Settings Create', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(30, 'admin.settings.read', 'Settings Read', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(31, 'admin.settings.update', 'Settings Update', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(32, 'admin.settings.delete', 'Settings Delete', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(33, 'admin.comments.create', 'Comments Create', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(34, 'admin.comments.read', 'Comments Read', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(35, 'admin.comments.update', 'Comments Update', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(36, 'admin.comments.delete', 'Comments Delete', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(37, 'admin.menus.create', 'Menus Create', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(38, 'admin.menus.read', 'Menus Read', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(39, 'admin.menus.update', 'Menus Update', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(40, 'admin.menus.delete', 'Menus Delete', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(41, 'admin.reserves.create', 'Reserves Create', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(42, 'admin.reserves.read', 'Reserves Read', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(43, 'admin.reserves.update', 'Reserves Update', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(44, 'admin.reserves.delete', 'Reserves Delete', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(45, 'admin.locations.create', 'Locations Create', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(46, 'admin.locations.read', 'Locations Read', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(47, 'admin.locations.update', 'Locations Update', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(48, 'admin.locations.delete', 'Locations Delete', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(49, 'admin.profile.read', 'Admin Profile Read', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(50, 'admin.profile.update', 'Admin Profile Update', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(51, 'admin.dashboard.read', 'Admin Dashboard Home Read', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09'),
(52, 'admin.databases.read', 'Admin Databases Home Read', NULL, '2018-01-23 06:39:09', '2018-01-23 06:39:09');

-- --------------------------------------------------------

--
-- Table structure for table `permission_role`
--

CREATE TABLE `permission_role` (
  `permission_id` int(10) UNSIGNED NOT NULL,
  `role_id` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `permission_role`
--

INSERT INTO `permission_role` (`permission_id`, `role_id`) VALUES
(1, 1),
(2, 1),
(3, 1),
(4, 1),
(5, 1),
(6, 1),
(7, 1),
(8, 1),
(9, 1),
(10, 1),
(11, 1),
(12, 1),
(13, 1),
(14, 1),
(15, 1),
(16, 1),
(17, 1),
(18, 1),
(19, 1),
(20, 1),
(21, 1),
(22, 1),
(23, 1),
(24, 1),
(25, 1),
(26, 1),
(27, 1),
(28, 1),
(29, 1),
(30, 1),
(31, 1),
(32, 1),
(33, 1),
(34, 1),
(35, 1),
(36, 1),
(37, 1),
(38, 1),
(39, 1),
(40, 1),
(41, 1),
(42, 1),
(43, 1),
(44, 1),
(45, 1),
(46, 1),
(47, 1),
(48, 1),
(49, 1),
(50, 1),
(51, 1),
(52, 1);

-- --------------------------------------------------------

--
-- Table structure for table `restaurants`
--

CREATE TABLE `restaurants` (
  `id` int(10) UNSIGNED NOT NULL,
  `title_fa` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `title_en` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `slug` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `content` text COLLATE utf8_unicode_ci,
  `image` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `header_bg` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `open_time` time DEFAULT NULL,
  `close_time` time DEFAULT NULL,
  `reservation_period` int(11) DEFAULT NULL,
  `price_range` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `chain_id` int(10) UNSIGNED DEFAULT NULL,
  `category_id` int(10) UNSIGNED DEFAULT NULL,
  `latitude` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `longitude` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `map_zoom` varchar(3) COLLATE utf8_unicode_ci NOT NULL DEFAULT '13',
  `location_id` int(10) UNSIGNED DEFAULT NULL,
  `locations` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `address` text COLLATE utf8_unicode_ci,
  `dining_style` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `phone_number` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `website` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `operation_hours` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `seating_capacity` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `table_capacity` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `page_title` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `meta_keywords` text COLLATE utf8_unicode_ci,
  `meta_description` text COLLATE utf8_unicode_ci,
  `comments_enabled` tinyint(1) NOT NULL DEFAULT '0',
  `show_in_home` tinyint(1) NOT NULL DEFAULT '0',
  `hits` int(11) NOT NULL DEFAULT '0',
  `state` int(11) NOT NULL DEFAULT '1',
  `created_by` int(10) UNSIGNED NOT NULL,
  `updated_by` int(10) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `restaurant_menus`
--

CREATE TABLE `restaurant_menus` (
  `id` int(10) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `content` text COLLATE utf8_unicode_ci,
  `restaurant_id` int(10) UNSIGNED NOT NULL,
  `menu_type_id` int(10) UNSIGNED NOT NULL,
  `state` int(11) NOT NULL DEFAULT '1',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `roles`
--

CREATE TABLE `roles` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `display_name` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `description` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `roles`
--

INSERT INTO `roles` (`id`, `name`, `display_name`, `description`, `created_at`, `updated_at`) VALUES
(1, 'admin', 'admin', 'admin', '2018-01-22 05:56:12', '2018-01-22 05:56:12');

-- --------------------------------------------------------

--
-- Table structure for table `role_user`
--

CREATE TABLE `role_user` (
  `user_id` int(10) UNSIGNED NOT NULL,
  `role_id` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `role_user`
--

INSERT INTO `role_user` (`user_id`, `role_id`) VALUES
(1, 1);

-- --------------------------------------------------------

--
-- Table structure for table `settings`
--

CREATE TABLE `settings` (
  `id` int(10) UNSIGNED NOT NULL,
  `key` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `value` text COLLATE utf8_unicode_ci NOT NULL,
  `type` enum('text','textarea','checkbox','image','file') COLLATE utf8_unicode_ci NOT NULL DEFAULT 'text',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `settings`
--

INSERT INTO `settings` (`id`, `key`, `value`, `type`, `created_at`, `updated_at`) VALUES
(1, 'site_title', 'سعید نصیری | برنامه نویس PHP و Laravel', 'text', '2018-01-22 05:56:12', '2018-01-22 05:56:12'),
(2, 'name', 'سعید نصیری', 'text', '2018-01-22 05:56:12', '2018-01-22 05:56:12'),
(3, 'birth_date', '1988-04-27', 'text', '2018-01-22 05:56:12', '2018-01-22 05:56:12'),
(4, 'address', 'ایران، تهران', 'text', '2018-01-22 05:56:12', '2018-01-22 05:56:12'),
(5, 'tel', '09212375850', 'text', '2018-01-22 05:56:12', '2018-01-22 05:56:12'),
(6, 'email', 'saeed.hajinasiri@gmail.com', 'text', '2018-01-22 05:56:12', '2018-01-22 05:56:12'),
(7, 'site', 'http://saeednasiri.com', 'text', '2018-01-22 05:56:12', '2018-01-22 05:56:12'),
(8, 'github_url', 'https://github.com/saeedhajinasiri', 'text', '2018-01-22 05:56:12', '2018-01-22 05:56:12'),
(9, 'linkedin_url', 'https://linkedin.com/saeedhajinasiri', 'text', '2018-01-22 05:56:12', '2018-01-22 05:56:12'),
(10, 'googleplus_url', 'https://plus.google.com/saeedhajinasiri', 'text', '2018-01-22 05:56:12', '2018-01-22 05:56:12'),
(11, 'twitter_url', 'https://twitter.com/saeedhajinasiri', 'text', '2018-01-22 05:56:12', '2018-01-22 05:56:12'),
(12, 'facebook_url', 'https://facebook.com/saeedhajinasiri', 'text', '2018-01-22 05:56:12', '2018-01-22 05:56:12'),
(13, 'pinterest_url', 'https://pinterest.com/saeedhajinasiri', 'text', '2018-01-22 05:56:12', '2018-01-22 05:56:12'),
(14, 'text_story', '', 'text', '2018-01-22 05:56:12', '2018-01-22 05:56:12'),
(15, 'text_skill', '', 'text', '2018-01-22 05:56:12', '2018-01-22 05:56:12'),
(16, 'text_experience', '', 'text', '2018-01-22 05:56:12', '2018-01-22 05:56:12'),
(17, 'text_education', '', 'text', '2018-01-22 05:56:12', '2018-01-22 05:56:12'),
(18, 'text_team', '', 'text', '2018-01-22 05:56:12', '2018-01-22 05:56:12'),
(19, 'text_testimonial', '', 'text', '2018-01-22 05:56:12', '2018-01-22 05:56:12'),
(20, 'text_blog', '', 'text', '2018-01-22 05:56:12', '2018-01-22 05:56:12'),
(21, 'contact_email', 'me@saeednasiri.com', 'text', '2018-01-22 05:56:12', '2018-01-22 05:56:12'),
(22, 'resume_file', '', 'text', '2018-01-22 05:56:12', '2018-01-22 05:56:12'),
(23, 'avatar_file', '', 'text', '2018-01-22 05:56:12', '2018-01-22 05:56:12');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(10) UNSIGNED NOT NULL,
  `state` tinyint(4) NOT NULL,
  `first_name` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `last_name` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `username` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `loginable_id` int(10) UNSIGNED NOT NULL,
  `loginable_type` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `mobile` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `address` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `avatar` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `new_avatar` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `remember_token` varchar(100) COLLATE utf8_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `state`, `first_name`, `last_name`, `username`, `email`, `password`, `loginable_id`, `loginable_type`, `mobile`, `address`, `avatar`, `new_avatar`, `remember_token`, `created_at`, `updated_at`) VALUES
(1, 1, 'سعید', 'نصیری', 'admin', 'saeed.hajinasiri@gmail.com', '$2y$10$MkKYl32MRup1M8nM5I0H1.QHBedru7OOx2Vi4/.kWcNs.sCcOdEW6', 1, 'App\\Admin', '09212375850', NULL, NULL, NULL, '3pBOOaqXgWdfASYpnKYGHip0f404N3ql51r3N16nyUqLdTnBgwmiHepl2njN', '2018-01-22 05:56:12', '2018-01-24 07:47:12');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `admins`
--
ALTER TABLE `admins`
  ADD PRIMARY KEY (`id`),
  ADD KEY `admins_created_by_foreign` (`created_by`),
  ADD KEY `admins_updated_by_foreign` (`updated_by`);

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`),
  ADD KEY `categories_created_by_foreign` (`created_by`),
  ADD KEY `categories_updated_by_foreign` (`updated_by`);

--
-- Indexes for table `category_restaurant`
--
ALTER TABLE `category_restaurant`
  ADD PRIMARY KEY (`id`),
  ADD KEY `category_restaurant_restaurant_id_foreign` (`restaurant_id`),
  ADD KEY `category_restaurant_category_id_foreign` (`category_id`);

--
-- Indexes for table `chains`
--
ALTER TABLE `chains`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `chains_slug_unique` (`slug`),
  ADD KEY `chains_created_by_foreign` (`created_by`),
  ADD KEY `chains_updated_by_foreign` (`updated_by`);

--
-- Indexes for table `customers`
--
ALTER TABLE `customers`
  ADD PRIMARY KEY (`id`),
  ADD KEY `customers_created_by_foreign` (`created_by`),
  ADD KEY `customers_updated_by_foreign` (`updated_by`);

--
-- Indexes for table `likes`
--
ALTER TABLE `likes`
  ADD PRIMARY KEY (`id`),
  ADD KEY `likes_likable_id_likable_type_index` (`likable_id`,`likable_type`),
  ADD KEY `likes_user_id_index` (`user_id`);

--
-- Indexes for table `locations`
--
ALTER TABLE `locations`
  ADD PRIMARY KEY (`id`),
  ADD KEY `locations_parent_id_index` (`parent_id`),
  ADD KEY `locations_lft_index` (`lft`),
  ADD KEY `locations_rgt_index` (`rgt`),
  ADD KEY `locations_depth_index` (`depth`),
  ADD KEY `locations_created_by_foreign` (`created_by`),
  ADD KEY `locations_updated_by_foreign` (`updated_by`);

--
-- Indexes for table `menus`
--
ALTER TABLE `menus`
  ADD PRIMARY KEY (`id`),
  ADD KEY `menus_parent_id_index` (`parent_id`),
  ADD KEY `menus_lft_index` (`lft`),
  ADD KEY `menus_rgt_index` (`rgt`),
  ADD KEY `menus_depth_index` (`depth`),
  ADD KEY `menus_created_by_foreign` (`created_by`),
  ADD KEY `menus_updated_by_foreign` (`updated_by`);

--
-- Indexes for table `menu_types`
--
ALTER TABLE `menu_types`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `password_resets`
--
ALTER TABLE `password_resets`
  ADD KEY `password_resets_email_index` (`email`),
  ADD KEY `password_resets_token_index` (`token`);

--
-- Indexes for table `permissions`
--
ALTER TABLE `permissions`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `permissions_name_unique` (`name`);

--
-- Indexes for table `permission_role`
--
ALTER TABLE `permission_role`
  ADD PRIMARY KEY (`permission_id`,`role_id`),
  ADD KEY `permission_role_role_id_foreign` (`role_id`);

--
-- Indexes for table `restaurants`
--
ALTER TABLE `restaurants`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `restaurants_slug_unique` (`slug`),
  ADD KEY `restaurants_chain_id_foreign` (`chain_id`),
  ADD KEY `restaurants_category_id_foreign` (`category_id`),
  ADD KEY `restaurants_location_id_foreign` (`location_id`),
  ADD KEY `restaurants_created_by_foreign` (`created_by`),
  ADD KEY `restaurants_updated_by_foreign` (`updated_by`);

--
-- Indexes for table `restaurant_menus`
--
ALTER TABLE `restaurant_menus`
  ADD PRIMARY KEY (`id`),
  ADD KEY `restaurant_menus_restaurant_id_foreign` (`restaurant_id`),
  ADD KEY `restaurant_menus_menu_type_id_foreign` (`menu_type_id`);

--
-- Indexes for table `roles`
--
ALTER TABLE `roles`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `roles_name_unique` (`name`);

--
-- Indexes for table `role_user`
--
ALTER TABLE `role_user`
  ADD PRIMARY KEY (`user_id`,`role_id`),
  ADD KEY `role_user_role_id_foreign` (`role_id`);

--
-- Indexes for table `settings`
--
ALTER TABLE `settings`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `settings_key_unique` (`key`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`),
  ADD UNIQUE KEY `users_username_unique` (`username`),
  ADD KEY `users_loginable_id_loginable_type_index` (`loginable_id`,`loginable_type`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `admins`
--
ALTER TABLE `admins`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `category_restaurant`
--
ALTER TABLE `category_restaurant`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `chains`
--
ALTER TABLE `chains`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `customers`
--
ALTER TABLE `customers`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `likes`
--
ALTER TABLE `likes`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `locations`
--
ALTER TABLE `locations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=897;

--
-- AUTO_INCREMENT for table `menus`
--
ALTER TABLE `menus`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `menu_types`
--
ALTER TABLE `menu_types`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=67;

--
-- AUTO_INCREMENT for table `permissions`
--
ALTER TABLE `permissions`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=53;

--
-- AUTO_INCREMENT for table `restaurants`
--
ALTER TABLE `restaurants`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `restaurant_menus`
--
ALTER TABLE `restaurant_menus`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `roles`
--
ALTER TABLE `roles`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `settings`
--
ALTER TABLE `settings`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=24;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `admins`
--
ALTER TABLE `admins`
  ADD CONSTRAINT `admins_created_by_foreign` FOREIGN KEY (`created_by`) REFERENCES `users` (`id`),
  ADD CONSTRAINT `admins_updated_by_foreign` FOREIGN KEY (`updated_by`) REFERENCES `users` (`id`);

--
-- Constraints for table `categories`
--
ALTER TABLE `categories`
  ADD CONSTRAINT `categories_created_by_foreign` FOREIGN KEY (`created_by`) REFERENCES `users` (`id`),
  ADD CONSTRAINT `categories_updated_by_foreign` FOREIGN KEY (`updated_by`) REFERENCES `users` (`id`);

--
-- Constraints for table `category_restaurant`
--
ALTER TABLE `category_restaurant`
  ADD CONSTRAINT `category_restaurant_category_id_foreign` FOREIGN KEY (`category_id`) REFERENCES `categories` (`id`),
  ADD CONSTRAINT `category_restaurant_restaurant_id_foreign` FOREIGN KEY (`restaurant_id`) REFERENCES `restaurants` (`id`);

--
-- Constraints for table `chains`
--
ALTER TABLE `chains`
  ADD CONSTRAINT `chains_created_by_foreign` FOREIGN KEY (`created_by`) REFERENCES `users` (`id`),
  ADD CONSTRAINT `chains_updated_by_foreign` FOREIGN KEY (`updated_by`) REFERENCES `users` (`id`);

--
-- Constraints for table `customers`
--
ALTER TABLE `customers`
  ADD CONSTRAINT `customers_created_by_foreign` FOREIGN KEY (`created_by`) REFERENCES `users` (`id`),
  ADD CONSTRAINT `customers_updated_by_foreign` FOREIGN KEY (`updated_by`) REFERENCES `users` (`id`);

--
-- Constraints for table `likes`
--
ALTER TABLE `likes`
  ADD CONSTRAINT `likes_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`);

--
-- Constraints for table `menus`
--
ALTER TABLE `menus`
  ADD CONSTRAINT `menus_created_by_foreign` FOREIGN KEY (`created_by`) REFERENCES `users` (`id`),
  ADD CONSTRAINT `menus_updated_by_foreign` FOREIGN KEY (`updated_by`) REFERENCES `users` (`id`);

--
-- Constraints for table `permission_role`
--
ALTER TABLE `permission_role`
  ADD CONSTRAINT `permission_role_permission_id_foreign` FOREIGN KEY (`permission_id`) REFERENCES `permissions` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `permission_role_role_id_foreign` FOREIGN KEY (`role_id`) REFERENCES `roles` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `restaurants`
--
ALTER TABLE `restaurants`
  ADD CONSTRAINT `restaurants_category_id_foreign` FOREIGN KEY (`category_id`) REFERENCES `categories` (`id`),
  ADD CONSTRAINT `restaurants_chain_id_foreign` FOREIGN KEY (`chain_id`) REFERENCES `chains` (`id`),
  ADD CONSTRAINT `restaurants_created_by_foreign` FOREIGN KEY (`created_by`) REFERENCES `users` (`id`),
  ADD CONSTRAINT `restaurants_location_id_foreign` FOREIGN KEY (`location_id`) REFERENCES `_locations` (`id`),
  ADD CONSTRAINT `restaurants_updated_by_foreign` FOREIGN KEY (`updated_by`) REFERENCES `users` (`id`);

--
-- Constraints for table `restaurant_menus`
--
ALTER TABLE `restaurant_menus`
  ADD CONSTRAINT `restaurant_menus_menu_type_id_foreign` FOREIGN KEY (`menu_type_id`) REFERENCES `menu_types` (`id`),
  ADD CONSTRAINT `restaurant_menus_restaurant_id_foreign` FOREIGN KEY (`restaurant_id`) REFERENCES `restaurants` (`id`);

--
-- Constraints for table `role_user`
--
ALTER TABLE `role_user`
  ADD CONSTRAINT `role_user_role_id_foreign` FOREIGN KEY (`role_id`) REFERENCES `roles` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `role_user_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
