app/Menus/AdminMenu.php

select * from `pages` where `page_name` is not null
---
    protected function getList()
    {
        $pageList = Page::query()
            ->whereNotNull('page_name')
            ->get()
            ->map(function ($item) {
                if ($item) {
                    return [
                        'title' => trans('admin.pages.' . $item->page_name),
                        'link' => route('admin.pages.edit', $item->id),
                        'route' => 'admin.pages.edit'
                    ];
                }
            });