app/Http/Controllers/Admin/PagesController.php

    public function update(Page $page, StorePagesRequest $request)
    {
        try {
            $input = $request->all();
            if (!isset($input['state'])) {
                $input['state'] = 0;
            }
            $input['slug'] = $this->slugify($input['slug']);

            if ($request->hasFile('image')) {
                $imageName = time() . $request->file('image')->getClientOriginalName();
                $img = $request->file('image')->move(
                    $this->path, $imageName
                );

                $input['image'] = $img->getFilename();
                if (\File::isFile($this->path . $page->image)) {
                    \File::delete($this->path . $page->image);
                }
            }
            $page->update($input);
---
update `pages` set `title` = 'Testimonials', `slug` = 'testimonials', `content` = 'Lorem ipsum, or lipsum as it is sometimes known, is dummy text used in laying out print, graphic or web designs. The passage is attributed to an unknown typesetter in the 15th century who is thought to have scrambled parts of Cicero\'s De Finibus Bonorum et Malorum for use in a type specimen book.', `keywords` = '', `description` = '', `updated_at` = '2019-04-21 10:22:50' where `id` = 5