app/Http/Controllers/Admin/TestimonialsController.php

    public function update(Testimonial $testimonial, StoreTestimonialsRequest $request)
    {
        try {
            $input = $request->all();
            if (!isset($input['state'])) {
                $input['state'] = 0;
            }

            if ($request->hasFile('image')) {
                $imageName = time() . $request->file('image')->getClientOriginalName();
                $img = $request->file('image')->move(
                    $this->path, $imageName
                );

                $input['image'] = $img->getFilename();
                if (\File::isFile($this->path . $testimonial->image)) {
                    \File::delete($this->path . $testimonial->image);
                }
            }

            $testimonial->update($input);
---
update `testimonials` set `content` = '<p>All the Lorem Ipsum generators on the Internet tend to repeat predefined chunks as necessary, making this the first true generator on the Internet. It uses a dictionary of over <br></p>', `updated_at` = '2019-04-21 09:58:27' where `id` = 1