app/Http/Controllers/Admin/VideosController.php

    public function index()
    {
        $items = Post::with('User')->whereType('video')->orderBy('id', 'DESC')->paginate(10);
---
select count(*) as aggregate from `posts` where `type` = 'video'